<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,ZooKeeper,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x8BF4;&amp;#x660E;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x5728;&amp;#x7814;&amp;#x7A76;&amp;#x751F;&amp;#x671F;&amp;#x95F4;&amp;#x8D1F;&amp;#x8D23;&amp;#x5F00;&amp;#x53D1;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x5BF9;&amp;#x53EF;&amp;#x7528;&amp;#x6027;&amp;#x6709;&amp;#x8981;&amp;#x6C42;">
<meta name="keywords" content="后端,ZooKeeper">
<meta property="og:type" content="article">
<meta property="og:title" content="用zookeeper来构建的一种一致性副本协议">
<meta property="og:url" content="https://dev.newban.cn/6844903520961822727.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x8BF4;&amp;#x660E;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x5728;&amp;#x7814;&amp;#x7A76;&amp;#x751F;&amp;#x671F;&amp;#x95F4;&amp;#x8D1F;&amp;#x8D23;&amp;#x5F00;&amp;#x53D1;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x5BF9;&amp;#x53EF;&amp;#x7528;&amp;#x6027;&amp;#x6709;&amp;#x8981;&amp;#x6C42;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/cc3a5d1478666e842a6601faf1fffada769e2dafcd286f7e069ec8d8baa8fa62">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/0452e1cdd869250ee878460d17d874600a365a25773f14ed76c600d83374b5fe">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/8d2e7c9c1e5f556c6981eab96f4484603e1e052f3d38727b5c360b4e405e2524">
<meta property="og:updated_time" content="2024-04-28T05:05:15.771Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="用zookeeper来构建的一种一致性副本协议">
<meta name="twitter:description" content="&amp;#x8BF4;&amp;#x660E;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x5728;&amp;#x7814;&amp;#x7A76;&amp;#x751F;&amp;#x671F;&amp;#x95F4;&amp;#x8D1F;&amp;#x8D23;&amp;#x5F00;&amp;#x53D1;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x5BF9;&amp;#x53EF;&amp;#x7528;&amp;#x6027;&amp;#x6709;&amp;#x8981;&amp;#x6C42;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/cc3a5d1478666e842a6601faf1fffada769e2dafcd286f7e069ec8d8baa8fa62">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903520961822727.html">





  <title>用zookeeper来构建的一种一致性副本协议 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">用zookeeper来构建的一种一致性副本协议</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-12T10:19:42+08:00">
                2017-12-12
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x8BF4;&#x660E;"><a href="#&#x8BF4;&#x660E;" class="headerlink" title="&#x8BF4;&#x660E;"></a>&#x8BF4;&#x660E;</h2><p>&#x6211;&#x66FE;&#x7ECF;&#x5728;&#x7814;&#x7A76;&#x751F;&#x671F;&#x95F4;&#x8D1F;&#x8D23;&#x5F00;&#x53D1;&#x8FC7;&#x4E00;&#x4E2A;&#x5BF9;&#x53EF;&#x7528;&#x6027;&#x6709;&#x8981;&#x6C42;&#x7684;&#x670D;&#x52A1;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x969C;&#x8BE5;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x6211;&#x57FA;&#x4E8E;zookeeper&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x590D;&#x5236;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5F53;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x88AB;&#x9009;&#x4E3A;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x4FDD;&#x969C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0D;&#x53D7;&#x5355;&#x70B9;&#x6545;&#x969C;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x80FD;&#x4FDD;&#x969C;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x603B;&#x7ED3;&#x548C;&#x62BD;&#x8C61;&#x3002;</p>
<h2 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a>&#x80CC;&#x666F;</h2><p>&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x6709;&#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x4FDD;&#x969C;&#x5176;&#x65E0;&#x6545;&#x969C;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x5176;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x6062;&#x590D;&#xFF0C;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x6709;&#x6311;&#x6218;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5E26;&#x6709;&#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5728;&#x5FEB;&#x901F;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6062;&#x590D;&#x5230;&#x6545;&#x969C;&#x51FA;&#x73B0;&#x524D;&#x7684;&#x670D;&#x52A1;&#x72B6;&#x6001;&#xFF0C;&#x66F4;&#x52A0;&#x5730;&#x52A0;&#x5927;&#x4E86;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x96BE;&#x5EA6;&#x3002;</p>
<h4 id="1-CAP&#x5B9A;&#x7406;"><a href="#1-CAP&#x5B9A;&#x7406;" class="headerlink" title="1. CAP&#x5B9A;&#x7406;"></a>1. CAP&#x5B9A;&#x7406;</h4><p>&#x7531;Eric Brewer&#x5728;2000&#x5E74;&#x63D0;&#x51FA;&#x7684;CAP&#x5B9A;&#x7406;[1]&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x4E2D;&#xFF0C;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x6027;&#x548C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#x3002;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#x4E0D;&#x4EC5;&#x4EC5;&#x5305;&#x542B;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x5B95;&#x673A;&#x7B49;&#x5F02;&#x5E38;&#x60C5;&#x5F62;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#x662F;&#x5FC5;&#x987B;&#x88AB;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x5728;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x6027;&#x4E2D;&#x505A;&#x51FA;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x53EF;&#x7528;&#x6027;&#x6307;&#x7684;&#x662F;&#x5728;&#x8DB3;&#x591F;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x8FDE;&#x7EED;&#x65E0;&#x6545;&#x969C;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x548C;&#x9700;&#x8981;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x5728;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x540E;&#x7684;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x3002;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#x4E0E;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x7684;&#x5B9E;&#x73B0;&#x4E0E;&#x90E8;&#x7F72;&#x6709;&#x5173;&#xFF0C;&#x4E0D;&#x5728;&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x7684;&#x8303;&#x56F4;&#x3002;&#x672C;&#x6587;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x540E;&#x7684;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4FDD;&#x969C;&#x7684;&#x662F;&#x540E;&#x7EED;&#x64CD;&#x4F5C;&#x5BF9;&#x4E8E;&#x5148;&#x524D;&#x64CD;&#x4F5C;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x3002;&#x5982;&#x679C;&#x540E;&#x7EED;&#x7684;&#x8BFB;&#x53D6;&#xFF0C;&#x65E0;&#x6CD5;&#x8BFB;&#x5230;&#x5148;&#x524D;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x57FA;&#x4E8E;&#x6B64;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;</p>
<h4 id="2-&#x591A;&#x526F;&#x672C;&#x5BB9;&#x707E;"><a href="#2-&#x591A;&#x526F;&#x672C;&#x5BB9;&#x707E;" class="headerlink" title="2. &#x591A;&#x526F;&#x672C;&#x5BB9;&#x707E;"></a>2. &#x591A;&#x526F;&#x672C;&#x5BB9;&#x707E;</h4><p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x8FBE;&#x6210;&#x6545;&#x969C;&#x6062;&#x590D;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x5907;&#x7528;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x505A;&#x540C;&#x6B65;&#x6216;&#x8005;&#x5F02;&#x6B65;&#x6570;&#x636E;&#x590D;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;primary-secondary&#x534F;&#x8BAE;[2]&#x3002;&#x5F53;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x6545;&#x969C;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5207;&#x6362;&#x5230;&#x5907;&#x7528;&#x670D;&#x52A1;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x969C;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x4FDD;&#x969C;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6027;&#x3002;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8FD8;&#x662F;&#x5907;&#x7528;&#x670D;&#x52A1;&#x51FA;&#x73B0;&#x4E86;&#x6545;&#x969C;&#xFF0C;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x5FC5;&#x987B;&#x5C06;&#x5B95;&#x673A;&#x670D;&#x52A1;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x540E;&#x624D;&#x80FD;&#x6062;&#x590D;&#x670D;&#x52A1;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x5207;&#x6362;&#x5230;&#x5907;&#x7528;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x7F29;&#x77ED;&#x4E86;&#x6545;&#x969C;&#x6062;&#x590D;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x800C;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3002;&#x4F46;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x4E4B;&#x524D;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x540E;&#x7EED;&#x7684;&#x8BFB;&#x53D6;&#x4E2D;&#x65E0;&#x6CD5;&#x88AB;&#x8BFB;&#x5230;&#x3002;</p>
<p>&#x57FA;&#x4E8E;paxos[3]&#x534F;&#x8BAE;&#x548C;raft[4]&#x534F;&#x8BAE;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x591A;&#x526F;&#x672C;&#x5BB9;&#x707E;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x56E0;&#x4E3A;paxos&#x534F;&#x8BAE;&#x6216;&#x8005;raft&#x534F;&#x8BAE;&#x80FD;&#x591F;&#x4FDD;&#x969C;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x540C;&#x65F6;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x4FDD;&#x969C;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x526F;&#x672C;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x4E00;&#x534A;&#x6216;&#x4EE5;&#x4E0A;&#x7684;&#x5B95;&#x673A;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x5F71;&#x54CD;&#x53EF;&#x7528;&#x6027;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x7CFB;&#x7EDF;&#x90FD;&#x80FD;&#x591F;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x6062;&#x590D;&#x56DE;&#x6765;&#xFF0C;&#x5E76;&#x62E5;&#x6709;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x5D4C;&#x5165;&#x5730;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x65E0;&#x8BBA;&#x662F;paxos&#x534F;&#x8BAE;&#xFF0C;&#x8FD8;&#x662F;&#x7B80;&#x5316;&#x7684;raft&#x534F;&#x8BAE;&#xFF0C;&#x90FD;&#x662F;&#x76F8;&#x5F53;&#x6709;&#x6311;&#x6218;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x4E0A;&#x8FF0;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x501F;&#x52A9;&#x50CF;zookeeper[5]&#x7B49;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x670D;&#x52A1;&#xFF0C;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x9009;&#x4E3B;&#xFF0C;&#x548C;&#x8282;&#x70B9;&#x72B6;&#x6001;&#x76D1;&#x542C;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;&#x4ECE;&#x800C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x7B49;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FDB;&#x800C;&#x5927;&#x5927;&#x5730;&#x7B80;&#x5316;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x4F7F;&#x7528;zookeeper&#x6765;&#x5B8C;&#x6210;&#x9009;&#x4E3B;&#x548C;&#x8282;&#x70B9;&#x76D1;&#x542C;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;</p>
<h4 id="3-&#x8BBE;&#x8BA1;&#x8003;&#x8651;"><a href="#3-&#x8BBE;&#x8BA1;&#x8003;&#x8651;" class="headerlink" title="3. &#x8BBE;&#x8BA1;&#x8003;&#x8651;"></a>3. &#x8BBE;&#x8BA1;&#x8003;&#x8651;</h4><p>&#x65E0;&#x8BBA;&#x662F;&#x5728;paxos&#x8FD8;&#x662F;raft&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x4FDD;&#x969C;&#x7684;&#x662F;CAP&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;CP&#x3002;&#x56E0;&#x4E3A;&#x53EA;&#x8981;&#x51FA;&#x73B0;&#x4E00;&#x534A;&#x6216;&#x8005;&#x4EE5;&#x4E0A;&#x6570;&#x91CF;&#x7684;&#x526F;&#x672C;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x56E0;&#x6B64;paxos&#x534F;&#x8BAE;&#x6216;&#x8005;raft&#x534F;&#x8BAE;&#x90FD;&#x4E0D;&#x80FD;&#x4FDD;&#x969C;&#x5B8C;&#x7F8E;&#x53EF;&#x7528;&#x6027;&#x3002;&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x4F9D;&#x7136;&#x662F;&#x4FDD;&#x8BC1;&#x4E86;CAP&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x91C7;&#x7528;paxos&#x6216;&#x8005;raft&#x7684;&#x65B9;&#x6848;&#x3002;&#x800C;&#x662F;&#x501F;&#x9274;&#x4E86;&#x4E86;primary-secondary&#x534F;&#x8BAE;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5728;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x548C;&#x5907;&#x7528;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x505A;&#x540C;&#x6B65;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x3002;&#x4F46;&#x540C;&#x65F6;&#x5F15;&#x5165;&#x4E86;zookeeper&#x6765;&#x76D1;&#x542C;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#xFF0C;&#x4ECE;&#x800C;&#x7F29;&#x77ED;&#x4E86;&#x7CFB;&#x7EDF;&#x6062;&#x590D;&#x53EF;&#x7528;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x53EF;&#x7528;&#x6027;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x4FDD;&#x969C;&#x4E86;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x727A;&#x7272;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x90E8;&#x5206;&#x6027;&#x80FD;&#x548C;&#x53EF;&#x7528;&#x6027;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x4FDD;&#x969C;&#x4E86;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5C4F;&#x853D;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x7ED9;&#x4E1A;&#x52A1;&#x5C42;&#x5E26;&#x6765;&#x7684;&#x70E6;&#x607C;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x5DE5;&#x4F5C;&#x96BE;&#x5EA6;&#x3002;</p>
<h2 id="&#x76F8;&#x5173;&#x5DE5;&#x4F5C;"><a href="#&#x76F8;&#x5173;&#x5DE5;&#x4F5C;" class="headerlink" title="&#x76F8;&#x5173;&#x5DE5;&#x4F5C;"></a>&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</h2><h4 id="1-&#x590D;&#x5236;&#x72B6;&#x6001;&#x673A;"><a href="#1-&#x590D;&#x5236;&#x72B6;&#x6001;&#x673A;" class="headerlink" title="1. &#x590D;&#x5236;&#x72B6;&#x6001;&#x673A;"></a>1. &#x590D;&#x5236;&#x72B6;&#x6001;&#x673A;</h4><p>&#x5728;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x62BD;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x673A;[6]&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x72B6;&#x6001;&#xFF0C;&#x4E00;&#x4E2A;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x548C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x51FD;&#x6570;&#x3002;&#x5BA2;&#x6237;&#x53D1;&#x5F80;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x7684;&#x8BF7;&#x6C42;&#x90FD;&#x53EF;&#x4EE5;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x4F5C;&#x4E3A;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x548C;&#x8F93;&#x51FA;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x3002;&#x591A;&#x4E2A;&#x76F8;&#x540C;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x7684;&#x72B6;&#x6001;&#x673A;&#xFF0C;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x5E8F;&#x5217;&#xFF0C;&#x6700;&#x7EC8;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x4E14;&#x8F93;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EA;&#x9700;&#x8981;&#x5728;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x8282;&#x70B9;&#x4E2D;&#x540C;&#x6B65;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x6D41;&#xFF0C;&#x5373;&#x53EF;&#x5B9E;&#x73B0;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x590D;&#x5236;&#x3002;</p>
<h4 id="2-&#x9009;&#x4E3B;&#x5B9E;&#x73B0;"><a href="#2-&#x9009;&#x4E3B;&#x5B9E;&#x73B0;" class="headerlink" title="2. &#x9009;&#x4E3B;&#x5B9E;&#x73B0;"></a>2. &#x9009;&#x4E3B;&#x5B9E;&#x73B0;</h4><p>&#x5728;&#x591A;&#x4E2A;&#x590D;&#x5236;&#x72B6;&#x6001;&#x673A;&#xFF0C;&#x4E5F;&#x5373;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x9009;&#x4E3E;&#x51FA;&#x4E00;&#x4E2A;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#xFF0C;&#x6765;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x8BFB;&#x5199;&#x670D;&#x52A1;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x5B9E;&#x73B0;&#xFF0C;&#x672C;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x4E86;zookeeper&#x4E2D;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x670D;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x9009;&#x4E3B;&#x529F;&#x80FD;&#x3002;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5728;&#x542F;&#x52A8;&#x540E;&#x90FD;&#x4F1A;&#x5411;zookeeper&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x53BB;&#x8BF7;&#x6C42;&#x521B;&#x5EFA;&#x540C;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x9501;&#x6587;&#x4EF6;&#x3002;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x6210;&#x529F;&#xFF0C;&#x63A5;&#x7740;&#x6210;&#x4E3A;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x3002;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x6210;&#x4E3A;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x53BB;&#x76D1;&#x542C;&#x4E34;&#x65F6;&#x9501;&#x6587;&#x4EF6;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5F53;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5BFC;&#x81F4;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#xFF0C;&#x4E34;&#x65F6;&#x9501;&#x6587;&#x4EF6;&#x4F1A;&#x88AB;zookeeper&#x5220;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x7684;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x3002;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x63A5;&#x7740;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x8BF7;&#x6C42;&#x521B;&#x5EFA;&#x4E34;&#x65F6;&#x9501;&#x6587;&#x4EF6;&#xFF0C;&#x8FDB;&#x800C;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x3002;</p>
<h4 id="3-&#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;"><a href="#3-&#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;" class="headerlink" title="3. &#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;"></a>3. &#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;</h4><p>&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x5728;zookeeper&#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x534F;&#x5546;&#x6700;&#x5927;&#x79DF;&#x7EA6;&#x65F6;&#x95F4;&#x3002;&#x5F53;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x540E;&#xFF0C;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5E76;&#x5411;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5E7F;&#x64AD;&#x8BE5;&#x8282;&#x70B9;&#x7684;&#x6545;&#x969C;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x6545;&#x969C;&#x7684;&#x8282;&#x70B9;&#x6062;&#x590D;&#x540E;&#xFF0C;&#x4F1A;&#x91CD;&#x65B0;&#x5230;zookeeper&#x4E0A;&#x53BB;&#x521B;&#x5EFA;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;zookeeper&#x4F1A;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5E7F;&#x64AD;&#x8BE5;&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x4E0A;&#x7EBF;&#x7684;&#x6D88;&#x606F;&#x3002;&#x4EE5;&#x4E0A;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x62E5;&#x6709;&#x4E86;&#x5F53;&#x524D;&#x6240;&#x6709;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x3002;</p>
<h4 id="4-&#x65E5;&#x5FD7;&#x590D;&#x5236;"><a href="#4-&#x65E5;&#x5FD7;&#x590D;&#x5236;" class="headerlink" title="4. &#x65E5;&#x5FD7;&#x590D;&#x5236;"></a>4. &#x65E5;&#x5FD7;&#x590D;&#x5236;</h4><p>&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x53D7;&#x5BA2;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x6D41;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x65E5;&#x5FD7;&#x6D41;&#x590D;&#x5236;&#x5230;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x6BCF;&#x6761;&#x65E5;&#x5FD7;&#x90FD;&#x5E26;&#x6709;&#x552F;&#x4E00;&#x81EA;&#x589E;&#x5E8F;&#x53F7;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x6761;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x987A;&#x5E8F;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x786E;&#x4FDD;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x7684;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x53D1;&#x5F80;&#x6240;&#x6709;&#x7684;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x3002;&#x6240;&#x6709;&#x7684;&#x5907;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x53D7;&#x5230;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x540C;&#x6837;&#x8981;&#x628A;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x987A;&#x5E8F;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x3002;&#x4E3B;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x53EA;&#x8981;&#x7B49;&#x5230;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x5DF2;&#x7ECF;&#x88AB;&#x5199;&#x5165;&#x672C;&#x673A;&#x78C1;&#x76D8;&#xFF0C;&#x4EE5;&#x53CA;&#x5DF2;&#x7ECF;&#x63A5;&#x6536;&#x5230;&#x9664;&#x81EA;&#x5DF1;&#x4E4B;&#x5916;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5B58;&#x6D3B;&#x7684;&#x5907;&#x7528;&#x8282;&#x70B9;&#x7684;&#x786E;&#x8BA4;&#x6D88;&#x606F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540C;&#x6B65;&#x5B8C;&#x6210;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x5904;&#x7406;&#x4E0B;&#x4E00;&#x6761;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x5728;&#x5904;&#x7406;&#x8FD4;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x5904;&#x7406;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x53BB;&#x5904;&#x7406;&#x4E0B;&#x4E00;&#x6761;&#x65E5;&#x5FD7;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x5728;zookeeper&#x4E0A;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x6700;&#x65B0;&#x786E;&#x8BA4;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x3002;&#x5728;zookeeper&#x4E0A;&#x8BB0;&#x5F55;&#x6700;&#x65B0;commit&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;zookeeper&#x4F1A;&#x5C06;&#x6700;&#x65B0;commit&#x7684;&#x5E8F;&#x53F7;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x8282;&#x70B9;&#xFF0C;&#x8282;&#x70B9;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x7ED9;&#x72B6;&#x6001;&#x673A;&#x4E86;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x4E0A;&#x8FD8;&#x8981;&#x8FD4;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x6700;&#x65B0;commit&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;&#x8BB0;&#x5F55;&#x5728;zookeeper&#x4E0A;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4EE5;&#x4F9B;&#x540E;&#x7EED;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x6062;&#x590D;&#x4EE5;&#x53CA;&#x65B0;&#x8282;&#x70B9;&#x52A0;&#x5165;&#x65F6;&#x4F7F;&#x7528;&#x3002;&#x65B0;&#x6062;&#x590D;&#x6216;&#x542F;&#x52A8;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x53EA;&#x9700;&#x5230;zookeeper&#x4E0A;&#x67E5;&#x8BE2;&#x6700;&#x65B0;commit&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x8BF7;&#x6C42;&#x81EA;&#x5DF1;&#x6240;&#x7F3A;&#x5931;&#x7684;&#x65E5;&#x5FD7;&#x4E86;&#x3002;</p>
<h4 id="5-&#x6545;&#x969C;&#x6062;&#x590D;"><a href="#5-&#x6545;&#x969C;&#x6062;&#x590D;" class="headerlink" title="5. &#x6545;&#x969C;&#x6062;&#x590D;"></a>5. &#x6545;&#x969C;&#x6062;&#x590D;</h4><p>&#x5F53;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x9996;&#x5148;&#x662F;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x65B0;&#x7684;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x4F1A;&#x88AB;&#x9009;&#x51FA;&#x6765;&#x3002;&#x7531;&#x4E8E;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x548C;&#x5907;&#x7528;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x91C7;&#x7528;&#x4E86;&#x540C;&#x6B65;&#x7684;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x5907;&#x7528;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5730;&#x6210;&#x4E3A;&#x4E3B;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x53BB;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E0A;&#x62C9;&#x53D6;&#x672A;&#x540C;&#x6B65;&#x7684;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5907;&#x7528;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x7684;&#x65E5;&#x5FD7;&#x6D41;&#x540C;&#x6B65;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x4F1A;&#x51FA;&#x73B0;&#x963B;&#x585E;&#x3002;&#x5F53;&#x5907;&#x7528;&#x8282;&#x70B9;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x540E;&#xFF0C;&#x5907;&#x7528;&#x8282;&#x70B9;&#x6545;&#x969C;&#x7684;&#x6D88;&#x606F;&#x4F1A;&#x88AB;zookeeper&#x5E7F;&#x64AD;&#x5230;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x7684;&#x65E5;&#x5FD7;&#x6D41;&#x540C;&#x6B65;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#x56DE;&#x6765;&#xFF0C;&#x6216;&#x8005;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x8282;&#x70B9;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x72B6;&#x6001;&#x4F1A;&#x843D;&#x540E;&#x4E8E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x4F1A;&#x5411;zookeeper&#x83B7;&#x53D6;&#x6700;&#x65B0;&#x786E;&#x8BA4;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x62C9;&#x53D6;&#x7F3A;&#x5931;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x3002;&#x5728;&#x8BE5;&#x8282;&#x70B9;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x540C;&#x6B65;&#x4E4B;&#x524D;&#xFF0C;&#x65E0;&#x6CD5;&#x5E94;&#x7B54;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x673A;&#x5668;&#x5B95;&#x673A;&#x548C;&#x673A;&#x5668;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x77ED;&#x6682;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x4ECE;&#x800C;&#x65E0;&#x6CD5;&#x5E94;&#x7B54;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x5E94;&#x7B54;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BFB;&#x53D6;&#x8BF7;&#x6C42;&#x3002;</p>
<h4 id="6-&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;"><a href="#6-&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;" class="headerlink" title="6. &#x65E5;&#x5FD7;&#x63D0;&#x4EA4;"></a>6. &#x65E5;&#x5FD7;&#x63D0;&#x4EA4;</h4><p>&#x65E5;&#x5FD7;&#x5728;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x7684;&#x5B58;&#x6D3B;&#x8282;&#x70B9;&#x4E0A;&#x540E;&#xFF0C;&#x6700;&#x540E;&#x9700;&#x8981;&#x786E;&#x8BA4;&#x63D0;&#x4EA4;&#x72B6;&#x6001;&#x3002;&#x5728;&#x5F88;&#x591A;&#x4E00;&#x81F4;&#x6027;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F1A;&#x5C06;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x548C;&#x63D0;&#x4EA4;&#x7684;&#x6D41;&#x7A0B;&#x5206;&#x79BB;&#x5F00;&#x3002;&#x9996;&#x5148;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x53D1;&#x8D77;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#xFF0C;&#x590D;&#x5236;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x518D;&#x53D1;&#x8D77;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x6D41;&#x7A0B;&#x3002;&#x5F53;&#x6536;&#x5230;&#x63D0;&#x4EA4;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x72B6;&#x6001;&#x673A;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x65E5;&#x5FD7;&#x4E86;&#x3002;&#x5728;&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F53;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x540E;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;id&#x66F4;&#x65B0;&#x5230;zookeeper&#xFF0C;&#x901A;&#x8FC7;zookeeper&#x6765;&#x5E7F;&#x64AD;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x7684;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#x3002;&#x901A;&#x8FC7;zookeeper&#x6765;&#x5206;&#x53D1;&#x548C;&#x8BB0;&#x5F55;&#x6700;&#x65B0;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x7684;id&#xFF0C;&#x867D;&#x7136;&#x5728;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x4E0A;&#x4F1A;&#x6709;&#x90E8;&#x5206;&#x635F;&#x8017;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x80FD;&#x6781;&#x5927;&#x7684;&#x7B80;&#x5316;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x52A0;&#x5165;&#x590D;&#x5236;&#x7EC4;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x6545;&#x969C;&#x7684;&#x8282;&#x70B9;&#x6062;&#x590D;&#x540E;&#xFF0C;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x90FD;&#x9700;&#x8981;&#x6062;&#x590D;&#x5230;&#x548C;zookeeper&#x4E0A;&#x7684;commit&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x4E00;&#x6837;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x65B0;&#x52A0;&#x5165;&#x8282;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x8282;&#x70B9;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6682;&#x65F6;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x4E0E;&#x8282;&#x70B9;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x5173;&#x3002;</p>
<p>&#x5F53;&#x65E5;&#x5FD7;&#x5B8C;&#x6210;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x72B6;&#x6001;&#x673A;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x72B6;&#x6001;&#x673A;&#x4E0E;&#x5177;&#x4F53;&#x7684;&#x5E94;&#x7528;&#x6709;&#x5173;&#xFF0C;&#x4E0D;&#x5C5E;&#x4E8E;&#x672C;&#x6587;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<h2 id="&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;"><a href="#&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;" class="headerlink" title="&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;"></a>&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;</h2><h4 id="1-&#x603B;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;"><a href="#1-&#x603B;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;" class="headerlink" title="1. &#x603B;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;"></a>1. &#x603B;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</h4><p>&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x603B;&#x4F53;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x6709;zookeeper&#x96C6;&#x7FA4;&#xFF0C;&#x4F5C;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x670D;&#x52A1;&#xFF0C;&#x8FD8;&#x6709;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x4E0E;&#x591A;&#x4E2A;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x5411;&#x5907;&#x7528;&#x8282;&#x70B9;&#x540C;&#x6B65;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x67B6;&#x6784;&#x56FE;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><a href="/external_links/9a57f1711cd5fc0abc1b091940b888df.html" target="blank" rel="noopener"><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/cc3a5d1478666e842a6601faf1fffada769e2dafcd286f7e069ec8d8baa8fa62" alt></a></p>
<h4 id="2-&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;"><a href="#2-&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;" class="headerlink" title="2. &#x7CFB;&#x7EDF;&#x63A5;&#x53E3;"></a>2. &#x7CFB;&#x7EDF;&#x63A5;&#x53E3;</h4><p>&#x7CFB;&#x7EDF;&#x5411;&#x7528;&#x6237;&#x66B4;&#x9732;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x540C;&#x6B65;&#x6216;&#x8005;&#x5F02;&#x6B65;&#x7684;&#x63D0;&#x4EA4;&#x786E;&#x8BA4;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x63A5;&#x53E3;&#x540D;&#x79F0;</th>
<th>&#x53C2;&#x6570;</th>
<th>&#x8FD4;&#x56DE;&#x503C;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody><tr>
<td>SubmitLogSync</td>
<td>log &#x64CD;&#x4F5C;&#x65E5;&#x5FD7;, timeout &#x8D85;&#x65F6;&#x65F6;&#x95F4;</td>
<td>state &#x63D0;&#x4EA4;&#x72B6;&#x6001;</td>
<td>&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540C;&#x6B65;&#x63D0;&#x4EA4;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#x3002;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x4E09;&#x79CD;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#xFF1A;&#x6210;&#x529F;&#xFF0C;&#x5931;&#x8D25;&#xFF0C;&#x548C;&#x8D85;&#x65F6;</td>
</tr>
<tr>
<td>SubmitLogAsync</td>
<td>log &#x64CD;&#x4F5C;&#x65E5;&#x5FD7;, timeout &#x8D85;&#x65F6;&#x65F6;&#x95F4;, callback((state) -&gt; {}) &#x56DE;&#x8C03;&#x51FD;&#x6570;</td>
<td>&#x65E0;</td>
<td>&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x5F02;&#x6B65;&#x63D0;&#x4EA4;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#x3002;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E2D;&#x540C;&#x6837;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#xFF1A;&#x6210;&#x529F;&#xFF0C;&#x5931;&#x8D25;&#x548C;&#x8D85;&#x65F6;</td>
</tr>
</tbody></table>
<p>&#x901A;&#x8FC7;&#x5411;&#x7528;&#x6237;&#x66B4;&#x9732;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5411;&#x7CFB;&#x7EDF;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x5728;&#x591A;&#x8282;&#x70B9;&#x7684;&#x590D;&#x5236;&#x540E;&#xFF0C;&#x4F1A;&#x63D0;&#x4EA4;&#x7ED9;&#x72B6;&#x6001;&#x673A;&#x6765;&#x6267;&#x884C;&#x3002;</p>
<h4 id="3-&#x4E0E;Zookeeper&#x4EA4;&#x4E92;&#x7684;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;"><a href="#3-&#x4E0E;Zookeeper&#x4EA4;&#x4E92;&#x7684;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;" class="headerlink" title="3. &#x4E0E;Zookeeper&#x4EA4;&#x4E92;&#x7684;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;"></a>3. &#x4E0E;Zookeeper&#x4EA4;&#x4E92;&#x7684;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;</h4><p>Zookeeper&#x5728;&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x4E09;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x9009;&#x4E3B;&#xFF0C;&#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;&#x548C;&#x8BB0;&#x5F55;&#x6700;&#x65B0;&#x4E00;&#x6B21;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x3002;</p>
<ul>
<li>Zookeeper&#x4E0A;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;</li>
</ul>
<p>&#x56E0;&#x6B64;&#x5728;zookeeper&#x4E0A;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x4F4D;&#x7F6E;</th>
<th>&#x4F5C;&#x7528;</th>
<th>&#x5C5E;&#x6027;</th>
<th>&#x76D1;&#x542C;&#x8282;&#x70B9;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody><tr>
<td>/lock</td>
<td>&#x7528;&#x4E8E;&#x9009;&#x4E3B;&#xFF0C;&#x6587;&#x4EF6;&#x4E2D;&#x4FDD;&#x5B58;&#x4E3B;&#x7528;&#x7684;&#x4F4D;&#x7F6E;</td>
<td>&#x4E34;&#x65F6;&#x6587;&#x4EF6;</td>
<td>&#x6240;&#x6709;&#x5907;&#x7528;&#x8282;&#x70B9;</td>
<td>&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x8282;&#x70B9;&#x6210;&#x4E3A;&#x4E3B;&#x7528;&#x8282;&#x70B9;</td>
</tr>
<tr>
<td>/nodes/[ip:port]</td>
<td>&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x6D3B;&#x72B6;&#x6001;</td>
<td>&#x4E34;&#x65F6;&#x6587;&#x4EF6;</td>
<td>&#x65E0;</td>
<td>[ip:port]&#x4E3A;&#x8282;&#x70B9;&#x63A5;&#x53D7;&#x8BF7;&#x6C42;&#x7684;&#x4F4D;&#x7F6E;</td>
</tr>
<tr>
<td>/logid</td>
<td>&#x8BB0;&#x5F55;&#x6700;&#x65B0;&#x4E00;&#x6B21;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;</td>
<td>&#x666E;&#x901A;&#x6587;&#x4EF6;</td>
<td>&#x6240;&#x6709;&#x8282;&#x70B9;</td>
<td>&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x90FD;&#x4F1A;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x8282;&#x70B9;</td>
</tr>
<tr>
<td>/nodes</td>
<td>&#x7528;&#x4E8E;&#x5E7F;&#x64AD;&#x8282;&#x70B9;&#x7684;&#x5B9E;&#x65F6;&#x5B58;&#x6D3B;&#x72B6;&#x6001;</td>
<td>&#x666E;&#x901A;&#x6587;&#x4EF6;</td>
<td>&#x6240;&#x6709;&#x8282;&#x70B9;</td>
<td>&#x6240;&#x6709;&#x8282;&#x70B9;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x8282;&#x70B9;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x5316;</td>
</tr>
</tbody></table>
<ul>
<li>&#x8282;&#x70B9;&#x5B58;&#x6D3B;&#x72B6;&#x6001;&#x76D1;&#x542C;</li>
</ul>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x53BB;zookeeper&#x7684;/nodes&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x4E3A;&#x672C;&#x8282;&#x70B9;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5728;zookeeper&#x4E0A;&#x6CE8;&#x518C;&#x76D1;&#x542C;/nodes&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x5F53;&#x6709;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x540E;&#xFF0C;&#x4E0E;zookeeper&#x7684;&#x5FC3;&#x8DF3;&#x4E2D;&#x65AD;&#xFF0C;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x3002;&#x4E4B;&#x540E;zookeeper&#x4F1A;&#x5220;&#x9664;&#x8BE5;&#x6545;&#x969C;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x7684;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x590D;&#x5236;&#x7EC4;&#x8282;&#x70B9;&#xFF0C;&#x5173;&#x4E8E;/nodes&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x53D8;&#x5316;&#x3002;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x65F6;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x6240;&#x6709;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x6D3B;&#x60C5;&#x51B5;&#x3002;</p>
<ul>
<li>&#x9009;&#x4E3B;</li>
</ul>
<p>&#x5728;&#x8282;&#x70B9;&#x6CE8;&#x518C;&#x5B8C;&#x81EA;&#x8EAB;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x53BB;&#x521B;&#x5EFA;/lock&#x7684;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x6210;&#x4E3A;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x8BF4;&#x660E;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x4E3B;&#x7528;&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x8981;&#x76D1;&#x542C;/lock&#x6587;&#x4EF6;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x6210;&#x4E3A;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x5F53;&#x4E3B;&#x7528;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x540E;&#xFF0C;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x4E5F;&#x4F1A;&#x5230;&#x671F;&#xFF0C;&#x6587;&#x4EF6;&#x4E5F;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5E76;&#x901A;&#x77E5;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x5907;&#x7528;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x5230;/lock&#x6587;&#x4EF6;&#x88AB;&#x5220;&#x9664;&#x7684;&#x901A;&#x77E5;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x53BB;&#x521B;&#x5EFA;/lock&#x6587;&#x4EF6;&#x3002;</p>
<ul>
<li>&#x8BB0;&#x5F55;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;</li>
</ul>
<p>&#x5728;&#x5B8C;&#x6210;&#x6BCF;&#x4E00;&#x6761;&#x65E5;&#x5FD7;&#x7684;&#x590D;&#x5236;&#x540E;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x4F1A;&#x53BB;zookeeper&#x4E0A;&#x66F4;&#x65B0;&#x6700;&#x65B0;&#x7684;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x3002;Zookeeper&#x4F1A;&#x628A;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x53D8;&#x5316;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x8282;&#x70B9;&#x3002;</p>
<h4 id="4-RPC&#x8BBE;&#x8BA1;"><a href="#4-RPC&#x8BBE;&#x8BA1;" class="headerlink" title="4. RPC&#x8BBE;&#x8BA1;"></a>4. RPC&#x8BBE;&#x8BA1;</h4><p>&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x9700;&#x8981;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x90FD;&#x5B9E;&#x73B0;&#x4EE5;&#x4E0B;&#x529F;&#x80FD;&#x7684;RPC&#x3002;</p>
<ul>
<li>&#x5904;&#x7406;&#x4E3B;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x7684;&#x65E5;&#x5FD7;</li>
</ul>
<p>&#x4E3B;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x53D1;&#x5F80;&#x5176;&#x4ED6;&#x7684;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x5907;&#x7528;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x6536;&#x5230;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x4F1A;&#x5C06;&#x65E5;&#x5FD7;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x6D88;&#x606F;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x65B9;&#x6CD5;&#x540D;</th>
<th>&#x53C2;&#x6570;1</th>
<th>&#x53C2;&#x6570;2</th>
<th>&#x8FD4;&#x56DE;&#x503C;</th>
</tr>
</thead>
<tbody><tr>
<td>HandleOpLog</td>
<td>logId</td>
<td>log</td>
<td>ack</td>
</tr>
<tr>
<td>&#x5904;&#x7406;&#x4E3B;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x7684;&#x65E5;&#x5FD7;</td>
<td>&#x63A5;&#x6536;&#x5230;&#x7684;&#x65E5;&#x5FD7;&#x7684;id&#x53F7;</td>
<td>&#x63A5;&#x6536;&#x5230;&#x7684;&#x65E5;&#x5FD7;</td>
<td>&#x8FD4;&#x56DE;&#x786E;&#x8BA4;</td>
</tr>
</tbody></table>
<ul>
<li>&#x5904;&#x7406;&#x65E5;&#x5FD7;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;</li>
</ul>
<p>&#x5728;&#x65B0;&#x8282;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x5148;&#x524D;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x8282;&#x70B9;&#x6062;&#x590D;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x62C9;&#x53D6;&#x65E5;&#x5FD7;&#xFF0C;&#x540C;&#x6B65;&#x5230;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E00;&#x81F4;&#x7684;&#x65E5;&#x5FD7;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x5BF9;&#x5916;&#x670D;&#x52A1;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x91CC;&#x540C;&#x6837;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x62C9;&#x53D6;&#x7684;RPC&#x8C03;&#x7528;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x65B9;&#x6CD5;&#x540D;</th>
<th>&#x53C2;&#x6570;1</th>
<th>&#x53C2;&#x6570;2</th>
<th>&#x8FD4;&#x56DE;&#x503C;</th>
</tr>
</thead>
<tbody><tr>
<td>PullLog</td>
<td>startId</td>
<td>endId</td>
<td>logs</td>
</tr>
<tr>
<td>&#x5904;&#x7406;&#x65E5;&#x5FD7;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;</td>
<td>&#x62C9;&#x53D6;&#x7684;&#x8D77;&#x59CB;&#x65E5;&#x5FD7;id</td>
<td>&#x62C9;&#x53D6;&#x7684;&#x6700;&#x540E;&#x65E5;&#x5FD7;id</td>
<td>&#x8FD4;&#x56DE;&#x65E5;&#x5FD7;</td>
</tr>
</tbody></table>
<h2 id="&#x529F;&#x80FD;&#x5B9E;&#x73B0;"><a href="#&#x529F;&#x80FD;&#x5B9E;&#x73B0;" class="headerlink" title="&#x529F;&#x80FD;&#x5B9E;&#x73B0;"></a>&#x529F;&#x80FD;&#x5B9E;&#x73B0;</h2><h4 id="1-&#x8282;&#x70B9;&#x4E0A;&#x7EBF;"><a href="#1-&#x8282;&#x70B9;&#x4E0A;&#x7EBF;" class="headerlink" title="1. &#x8282;&#x70B9;&#x4E0A;&#x7EBF;"></a>1. &#x8282;&#x70B9;&#x4E0A;&#x7EBF;</h4><p>&#x5F53;&#x8282;&#x70B9;&#x4E0A;&#x7EBF;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x5728;zookeeper&#x7684;/nodes&#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x5C1D;&#x8BD5;&#x5728;zookeeper&#x4E0A;&#x521B;&#x5EFA;/lock&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x6210;&#x4E3A;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x6210;&#x4E3A;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6267;&#x884C;&#x72B6;&#x6001;&#x6062;&#x590D;&#x7684;&#x6D41;&#x7A0B;&#x3002;&#x8BFB;&#x53D6;zookeeper&#x4E0A;/logid&#x6587;&#x4EF6;&#x5185;&#x7684;&#x6700;&#x65B0;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;&#x5E76;&#x8BFB;&#x53D6;&#x672C;&#x8282;&#x70B9;&#x7684;&#x6700;&#x65B0;&#x63D0;&#x4EA4;&#x7684;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x3002;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#xFF0C;&#x5982;&#x679C;&#x672C;&#x8282;&#x70B9;&#x5DF2;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x843D;&#x540E;&#x4E8E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x5219;&#x8C03;&#x7528;PullLog&#x7684;RPC&#xFF0C;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x62C9;&#x53D6;&#x5E76;&#x6062;&#x590D;&#x3002;&#x5728;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;RPC&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x54CD;&#x5E94;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;RPC&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><a href="/external_links/b3ed91492e754fe0aa49f9aaf75237cc.html" target="blank" rel="noopener"><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/0452e1cdd869250ee878460d17d874600a365a25773f14ed76c600d83374b5fe" alt></a></p>
<h4 id="2-&#x4E3B;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;"><a href="#2-&#x4E3B;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;" class="headerlink" title="2. &#x4E3B;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;"></a>2. &#x4E3B;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;</h4><p>&#x5F53;&#x4E3B;&#x8282;&#x70B9;&#x63A5;&#x53D7;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x9996;&#x5148;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x65E5;&#x5FD7;&#x901A;&#x8FC7;HandleOpLog&#x7684;RPC&#xFF0C;&#x53D1;&#x5F80;&#x5907;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x7B49;&#x5F85;&#x5907;&#x7528;&#x8282;&#x70B9;RPC&#x90FD;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x540E;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x8BE5;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#x6210;&#x529F;&#xFF0C;&#x4FEE;&#x6539;zookeeper&#x4E0A;/logid&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x4E3A;&#x8BE5;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x3002;&#x5982;&#x679C;&#x53D1;&#x5F80;&#x67D0;&#x4E2A;&#x5907;&#x7528;&#x8282;&#x70B9;&#x7684;HandleOpLog&#x7684;RPC&#x8C03;&#x7528;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x4E0D;&#x65AD;&#x91CD;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x6210;&#x529F;&#xFF0C;&#x6216;&#x8005;&#x8BE5;&#x5907;&#x7528;&#x8282;&#x70B9;&#x88AB;zookeeper&#x68C0;&#x6D4B;&#x5230;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x3002;</p>
<p>&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><a href="/external_links/5f956e1fa02c573c3301a2c31082bcce.html" target="blank" rel="noopener"><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/8d2e7c9c1e5f556c6981eab96f4484603e1e052f3d38727b5c360b4e405e2524" alt></a></p>
<h4 id="3-&#x5907;&#x7528;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;"><a href="#3-&#x5907;&#x7528;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;" class="headerlink" title="3. &#x5907;&#x7528;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;"></a>3. &#x5907;&#x7528;&#x8282;&#x70B9;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;</h4><p>&#x5F53;&#x5907;&#x7528;&#x8282;&#x70B9;&#x901A;&#x8FC7;PRC HandleOpLog&#x63A5;&#x6536;&#x5230;&#x4E3B;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x7B49;&#x5F85;&#x65E5;&#x5FD7;&#x6301;&#x4E45;&#x5316;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x518D;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#x786E;&#x8BA4;&#x3002;</p>
<h4 id="4-&#x72B6;&#x6001;&#x673A;&#x6267;&#x884C;"><a href="#4-&#x72B6;&#x6001;&#x673A;&#x6267;&#x884C;" class="headerlink" title="4. &#x72B6;&#x6001;&#x673A;&#x6267;&#x884C;"></a>4. &#x72B6;&#x6001;&#x673A;&#x6267;&#x884C;</h4><p>&#x5F53;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x66F4;&#x65B0;/logid &#x4E2D;&#x7684;&#x6700;&#x65B0;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x540E;&#xFF0C;zookeeper&#x4F1A;&#x5C06;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x8282;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x63A8;&#x8FDB;&#x72B6;&#x6001;&#x673A;&#x7684;&#x6267;&#x884C;&#x65E5;&#x5FD7;&#x3002;</p>
<h4 id="5-&#x9009;&#x4E3B;&#x5B9E;&#x73B0;"><a href="#5-&#x9009;&#x4E3B;&#x5B9E;&#x73B0;" class="headerlink" title="5. &#x9009;&#x4E3B;&#x5B9E;&#x73B0;"></a>5. &#x9009;&#x4E3B;&#x5B9E;&#x73B0;</h4><p>&#x5728;&#x672C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9009;&#x4E3B;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;zookeeper&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x62A2;&#x5360;&#x521B;&#x5EFA;zookeeper&#x4E0A;&#x7684;/lock&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x4E3B;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x540E;&#xFF0C;/lock&#x6587;&#x4EF6;&#x4F1A;&#x88AB;zookeeper&#x5220;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x5E7F;&#x64AD;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x63A5;&#x6536;&#x5230;&#x901A;&#x77E5;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x62A2;&#x5360;&#x521B;&#x5EFA;/lock&#x6587;&#x4EF6;&#x3002;</p>
<h2 id="&#x4F18;&#x5316;"><a href="#&#x4F18;&#x5316;" class="headerlink" title="&#x4F18;&#x5316;"></a>&#x4F18;&#x5316;</h2><h4 id="1-&#x65E5;&#x5FD7;&#x6279;&#x91CF;&#x64CD;&#x4F5C;"><a href="#1-&#x65E5;&#x5FD7;&#x6279;&#x91CF;&#x64CD;&#x4F5C;" class="headerlink" title="1. &#x65E5;&#x5FD7;&#x6279;&#x91CF;&#x64CD;&#x4F5C;"></a>1. &#x65E5;&#x5FD7;&#x6279;&#x91CF;&#x64CD;&#x4F5C;</h4><p>&#x5728;&#x4E3B;&#x8282;&#x70B9;&#x63A5;&#x53D7;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x4E0D;&#x6025;&#x7740;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x548C;&#x53D1;&#x5F80;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4E00;&#x8D77;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x548C;&#x53D1;&#x5F80;&#x5907;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x4F46;&#x662F;&#x4E3B;&#x8282;&#x70B9;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x65E5;&#x5FD7;&#xFF0C;&#x6240;&#x4EE5;&#x7CFB;&#x7EDF;&#x7684;&#x54CD;&#x5E94;&#x5EF6;&#x8FDF;&#x4F1A;&#x589E;&#x957F;&#x3002;&#x6240;&#x4EE5;&#x7CFB;&#x7EDF;&#x8981;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x6765;&#x9009;&#x62E9;&#x7F13;&#x5B58;&#x65F6;&#x95F4;&#x3002;</p>
<h4 id="2-&#x65E5;&#x5FD7;&#x6D41;&#x6C34;&#x7EBF;&#x64CD;&#x4F5C;"><a href="#2-&#x65E5;&#x5FD7;&#x6D41;&#x6C34;&#x7EBF;&#x64CD;&#x4F5C;" class="headerlink" title="2. &#x65E5;&#x5FD7;&#x6D41;&#x6C34;&#x7EBF;&#x64CD;&#x4F5C;"></a>2. &#x65E5;&#x5FD7;&#x6D41;&#x6C34;&#x7EBF;&#x64CD;&#x4F5C;</h4><p>&#x4E3B;&#x8282;&#x70B9;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x90FD;&#x6210;&#x529F;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x548C;&#x590D;&#x5236;&#x5230;&#x5907;&#x7528;&#x8282;&#x70B9;&#x4E0A;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x53D1;&#x8D77;&#x65B0;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x7684;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x3002;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x53D1;&#x8D77;&#x591A;&#x6761;&#x65E5;&#x5FD7;&#x7684;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x548C;&#x590D;&#x5236;&#x5230;&#x5907;&#x7528;&#x8282;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x67D0;&#x6761;&#x65E5;&#x5FD7;&#x7684;&#x590D;&#x5236;&#x963B;&#x585E;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x540E;&#x9762;&#x65E5;&#x5FD7;&#x7684;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x5728;zookeeper&#x4E0A;&#x66F4;&#x65B0;&#x5DF2;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x5FC5;&#x987B;&#x662F;&#x589E;&#x957F;&#x7684;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x72B6;&#x6001;&#x673A;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x4E5F;&#x662F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;</p>
<h4 id="3-&#x65E5;&#x5FD7;&#x62C9;&#x53D6;"><a href="#3-&#x65E5;&#x5FD7;&#x62C9;&#x53D6;" class="headerlink" title="3. &#x65E5;&#x5FD7;&#x62C9;&#x53D6;"></a>3. &#x65E5;&#x5FD7;&#x62C9;&#x53D6;</h4><p>&#x5982;&#x679C;&#x521A;&#x52A0;&#x5165;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x65E5;&#x5FD7;&#x843D;&#x540E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x592A;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x751F;&#x6210;snapshot&#x6587;&#x4EF6;&#xFF0C;&#x65B0;&#x8282;&#x70B9;&#x62C9;&#x53D6;snapshot&#xFF0C;&#x6765;&#x52A0;&#x5FEB;&#x65E5;&#x5FD7;&#x548C;&#x72B6;&#x6001;&#x7684;&#x6062;&#x590D;&#x3002;</p>
<h4 id="4-&#x6570;&#x636E;&#x8BFB;&#x53D6;"><a href="#4-&#x6570;&#x636E;&#x8BFB;&#x53D6;" class="headerlink" title="4. &#x6570;&#x636E;&#x8BFB;&#x53D6;"></a>4. &#x6570;&#x636E;&#x8BFB;&#x53D6;</h4><p>&#x7531;&#x4E8E;&#x5728;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x72B6;&#x6001;&#x662F;&#x5F3A;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x3002;&#x6240;&#x4EE5;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x5199;&#x591A;&#x8BFB;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x957F;&#x8282;&#x70B9;&#x4E2A;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x6027;&#x80FD;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F1A;&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x53D8;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x65E5;&#x5FD7;&#x540C;&#x6B65;&#x7684;&#x4EE3;&#x4EF7;&#x4F1A;&#x52A0;&#x5927;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E1A;&#x52A1;&#x4E2D;&#x5BF9;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x8981;&#x6C42;&#x5F3A;&#x4E00;&#x81F4;&#xFF0C;&#x5141;&#x8BB8;&#x4E00;&#x5B9A;&#x7684;&#x5EF6;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x52A0;&#x5165;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x7684;&#x5F31;&#x4E00;&#x81F4;&#x8282;&#x70B9;&#x3002;&#x5F31;&#x4E00;&#x81F4;&#x8282;&#x70B9;&#x4E0D;&#x53C2;&#x4E0E;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x9009;&#x4E3E;&#x548C;&#x540C;&#x6B65;&#x7684;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#xFF0C;&#x53EA;&#x4F1A;&#x5F02;&#x6B65;&#x7684;&#x5411;&#x666E;&#x901A;&#x8282;&#x70B9;&#x62C9;&#x53D6;&#x65E5;&#x5FD7;&#xFF0C;&#x5E76;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x5F31;&#x4E00;&#x81F4;&#x6027;&#x8BFB;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h2 id="&#x8BA8;&#x8BBA;"><a href="#&#x8BA8;&#x8BBA;" class="headerlink" title="&#x8BA8;&#x8BBA;"></a>&#x8BA8;&#x8BBA;</h2><h4 id="1-&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4EA4;&#x4E92;"><a href="#1-&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4EA4;&#x4E92;" class="headerlink" title="1. &#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4EA4;&#x4E92;"></a>1. &#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4EA4;&#x4E92;</h4><p>&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x5411;&#x4E3B;&#x8282;&#x70B9;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x9700;&#x8981;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x3002;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x7684;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x5C06;&#x65E5;&#x5FD7;&#x5E8F;&#x53F7;&#x66F4;&#x65B0;&#x5230;zookeeper&#x7684;/logid&#x4E2D;&#x540E;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x65E5;&#x5FD7;&#x5DF2;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x7531;&#x4E8E;&#x5F02;&#x5E38;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#xFF0C;&#x673A;&#x5668;&#x5B95;&#x673A;&#x7B49;&#xFF0C;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x7AEF;&#x8D85;&#x65F6;&#x672A;&#x5F97;&#x5230;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x7ED3;&#x679C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x8FDB;&#x5165;&#x672A;&#x77E5;&#x72B6;&#x6001;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x5148;&#x5411;&#x7CFB;&#x7EDF;&#x8BFB;&#x53D6;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x60C5;&#x51B5;&#xFF0C;&#x6839;&#x636E;&#x60C5;&#x51B5;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x3002;</p>
<h4 id="2-&#x4E0E;paxos&#x548C;raft&#x7684;&#x6BD4;&#x8F83;"><a href="#2-&#x4E0E;paxos&#x548C;raft&#x7684;&#x6BD4;&#x8F83;" class="headerlink" title="2. &#x4E0E;paxos&#x548C;raft&#x7684;&#x6BD4;&#x8F83;"></a>2. &#x4E0E;paxos&#x548C;raft&#x7684;&#x6BD4;&#x8F83;</h4><p>&#x5728;&#x672C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x65F6;&#x957F;&#x6709;&#x5173;&#x3002;&#x4F46;&#x662F;&#x5728;paxos&#x4E2D;&#xFF0C;&#x5355;&#x53F0;&#x673A;&#x5668;&#x7684;&#x6545;&#x969C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x5982;&#x679C;&#x662F;&#x5E26;&#x6709;leader&#x7684;paxos&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#x679C;leader&#x6240;&#x5728;&#x7684;&#x673A;&#x5668;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x65B0;&#x9009;&#x51FA;&#x7684;leader&#x9700;&#x8981;&#x6267;&#x884C;&#x4E24;&#x9636;&#x6BB5;&#x6D41;&#x7A0B;&#x6062;&#x590D;&#x65E5;&#x5FD7;&#x72B6;&#x6001;&#xFF0C;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x4E0E;&#x65B0;leader&#x6062;&#x590D;&#x65E5;&#x5FD7;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x5173;&#x3002;&#x6240;&#x4EE5;paxos&#x4E0A;&#x5982;&#x679C;leader&#x6240;&#x5728;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x624D;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;&#x4E0E;&#x9009;&#x4E3B;&#x548C;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x6709;&#x5173;&#x3002;&#x5728;raft&#x4E2D;&#xFF0C;leader&#x4F1A;&#x7531;&#x65E5;&#x5FD7;&#x6700;&#x957F;&#x7684;&#x673A;&#x5668;&#x62C5;&#x4EFB;&#xFF0C;&#x6240;&#x4EE5;raft&#x4E0D;&#x5B58;&#x5728;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x6D41;&#x7A0B;&#x3002;&#x6240;&#x4EE5;raft&#x7CFB;&#x7EDF;&#x540C;&#x6837;&#x53EA;&#x53D7;leader&#x6545;&#x969C;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;&#x4E0E;&#x9009;&#x4E3B;&#x65F6;&#x95F4;&#x6709;&#x5173;&#x3002;</p>
<p>&#x5728;&#x6709;&#x8282;&#x70B9;&#x52A0;&#x5165;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x672C;&#x7CFB;&#x7EDF;&#x540C;&#x6837;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;&#x4E0E;&#x65E5;&#x5FD7;&#x6062;&#x590D;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x5173;&#x3002;&#x4F46;&#x5728;paxos&#x548C;raft&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;paxos&#x548C;raft&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x51FA;&#x73B0;&#x4E00;&#x534A;&#x6216;&#x8005;&#x4E00;&#x534A;&#x4EE5;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#x6545;&#x969C;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x6CA1;&#x529E;&#x6CD5;&#x81EA;&#x52A8;&#x6062;&#x590D;&#xFF0C;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#x3002;&#x4F46;&#x662F;&#x5728;&#x672C;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EA;&#x6709;&#x6240;&#x6709;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x624D;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6CA1;&#x6CD5;&#x81EA;&#x52A8;&#x6062;&#x590D;&#x3002;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#x7CFB;&#x7EDF;&#x6062;&#x590D;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;&#x5EF6;&#x957F;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6027;&#x8981;&#x597D;&#x4E8E;paxos&#x548C;raft&#x3002;</p>
<h4 id="3-&#x9002;&#x7528;&#x573A;&#x666F;"><a href="#3-&#x9002;&#x7528;&#x573A;&#x666F;" class="headerlink" title="3. &#x9002;&#x7528;&#x573A;&#x666F;"></a>3. &#x9002;&#x7528;&#x573A;&#x666F;</h4><p>&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x7CFB;&#x7EDF;&#x7531;&#x4E8E;&#x65E5;&#x5FD7;&#x9700;&#x8981;&#x540C;&#x6B65;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x7387;&#x9AD8;&#xFF0C;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x9AD8;&#x7684;&#x5E7F;&#x57DF;&#x7F51;&#x573A;&#x666F;&#xFF0C;&#x4EC5;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x7684;&#x5C40;&#x57DF;&#x7F51;&#x90E8;&#x7F72;&#x3002;</p>
<h2 id="&#x6D4B;&#x8BD5;"><a href="#&#x6D4B;&#x8BD5;" class="headerlink" title="&#x6D4B;&#x8BD5;"></a>&#x6D4B;&#x8BD5;</h2><h4 id="1-&#x6D4B;&#x8BD5;&#x73AF;&#x5883;"><a href="#1-&#x6D4B;&#x8BD5;&#x73AF;&#x5883;" class="headerlink" title="1. &#x6D4B;&#x8BD5;&#x73AF;&#x5883;"></a>1. &#x6D4B;&#x8BD5;&#x73AF;&#x5883;</h4><p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x7531;6&#x53F0;&#x5171;&#x6709;&#x4E91;&#x4E0A;&#x7684;&#x4E3B;&#x673A;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x51E0;&#x53F0;&#x4E3B;&#x673A;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x6709;&#x4E09;&#x53F0;&#x7528;&#x4E8E;&#x90E8;&#x7F72;zookeeper&#x96C6;&#x7FA4;&#xFF0C;&#x6709;&#x4E09;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x7528;&#x4E8E;&#x90E8;&#x7F72;&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x7CFB;&#x7EDF;&#x96C6;&#x7FA4;&#x3002;</p>
<h4 id="2-&#x6D4B;&#x8BD5;&#x8BF4;&#x660E;"><a href="#2-&#x6D4B;&#x8BD5;&#x8BF4;&#x660E;" class="headerlink" title="2. &#x6D4B;&#x8BD5;&#x8BF4;&#x660E;"></a>2. &#x6D4B;&#x8BD5;&#x8BF4;&#x660E;</h4><p>&#x672C;&#x6D4B;&#x8BD5;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x4E8E;&#x5F53;&#x7CFB;&#x7EDF;&#x4E2D;&#x51FA;&#x73B0;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6062;&#x590D;&#x6240;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x8BFB;&#x5199;&#x6027;&#x80FD;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53;&#x65B0;&#x8282;&#x70B9;&#x52A0;&#x5165;&#x540E;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6062;&#x590D;&#xFF0C;&#x90FD;&#x4E0E;&#x7CFB;&#x7EDF;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x6709;&#x5173;&#xFF0C;&#x4E0D;&#x5728;&#x672C;&#x6D4B;&#x8BD5;&#x8BA8;&#x8BBA;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<p>&#x96C6;&#x7FA4;&#x4E2D;&#x6709;&#x4E09;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x53F0;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x548C;&#x4E24;&#x53F0;&#x5907;&#x7528;&#x8282;&#x70B9;&#x3002;&#x5F53;&#x5907;&#x7528;&#x8282;&#x70B9;&#x6545;&#x969C;&#x540E;&#xFF0C;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x5411;&#x5176;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#xFF0C;&#x56E0;&#x6B64;&#x65E5;&#x5FD7;&#x63D0;&#x4EA4;&#x65E0;&#x6CD5;&#x63A8;&#x8FDB;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5904;&#x4E8E;&#x4E0D;&#x53EF;&#x7528;&#x72B6;&#x6001;&#x3002;&#x63A5;&#x7740;&#x5F53;&#x6545;&#x969C;&#x7684;&#x5907;&#x7528;&#x8282;&#x70B9;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#xFF0C;&#x7136;&#x540E;zookeeper&#x901A;&#x77E5;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x6B64;&#x65F6;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x66F4;&#x65B0;&#x5B58;&#x6D3B;&#x8282;&#x70B9;&#x5217;&#x8868;&#xFF0C;&#x4E0D;&#x4F1A;&#x5411;&#x8BE5;&#x6545;&#x969C;&#x8282;&#x70B9;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x3002;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x6062;&#x590D;&#xFF0C;&#x8FDB;&#x5165;&#x53EF;&#x7528;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5F53;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x540C;&#x6837;&#x8FDB;&#x5165;&#x4E0D;&#x53EF;&#x7528;&#x72B6;&#x6001;&#x3002;&#x6545;&#x969C;&#x7684;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x4E0E;zookeeper&#x7684;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x540E;&#xFF0C;zookeeper&#x4F1A;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x5907;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x4E3B;&#x7528;&#x5931;&#x6548;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5907;&#x7528;&#x8282;&#x70B9;&#x9996;&#x5148;&#x8981;&#x62A2;&#x5360;&#x521B;&#x5EFA;zookeeper&#x4E0A;&#x7684;/lock&#x6587;&#x4EF6;&#xFF0C;&#x63A5;&#x7740;&#x66F4;&#x65B0;&#x5B58;&#x6D3B;&#x8282;&#x70B9;&#x5217;&#x8868;&#xFF0C;&#x6700;&#x540E;&#x7CFB;&#x7EDF;&#x7684;&#x6545;&#x969C;&#x624D;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#xFF0C;&#x8FDB;&#x5165;&#x53EF;&#x7528;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x8C03;&#x7528;HandleOpLog&#x5411;&#x5907;&#x7528;&#x8282;&#x70B9;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x7684;RPC&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x8BBE;&#x7F6E;&#x4E3A;1s&#x3002;</p>
<p>&#x4E0B;&#x8FF0;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#xFF0C;&#x4E0E;&#x5177;&#x4F53;&#x7684;&#x7A0B;&#x5E8F;&#x5B9E;&#x73B0;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x6839;&#x636E;&#x7814;&#x7A76;&#x751F;&#x671F;&#x95F4;&#x57FA;&#x4E8E;&#x6B64;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#xFF0C;&#x5F97;&#x51FA;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h4 id="3-&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;"><a href="#3-&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;" class="headerlink" title="3. &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;"></a>3. &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;</h4><p>&#x5907;&#x7528;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x6062;&#x590D;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x79DF;&#x7EA6;&#x65F6;&#x95F4;/s</th>
<th>&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;/s</th>
</tr>
</thead>
<tbody><tr>
<td>5</td>
<td>6.8</td>
</tr>
<tr>
<td>10</td>
<td>12.1</td>
</tr>
<tr>
<td>20</td>
<td>22.5</td>
</tr>
</tbody></table>
<p>&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x6062;&#x590D;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x79DF;&#x7EA6;&#x65F6;&#x95F4;/s</th>
<th>&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;/s</th>
</tr>
</thead>
<tbody><tr>
<td>5</td>
<td>7.4</td>
</tr>
<tr>
<td>10</td>
<td>13.2</td>
</tr>
<tr>
<td>20</td>
<td>23.5</td>
</tr>
</tbody></table>
<p>&#x8FD9;&#x91CC;&#x6D4B;&#x8BD5;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#x95F4;&#xFF0C;&#x6839;&#x636E;&#x7684;&#x662F;&#x4E3B;&#x7528;&#x8282;&#x70B9;&#x548C;&#x5907;&#x7528;&#x8282;&#x70B9;&#x7684;&#x65E5;&#x5FD7;&#x6570;&#x636E;&#x4F30;&#x7B97;&#x800C;&#x6765;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E9B;&#x8BEF;&#x5DEE;&#xFF0C;&#x5F85;&#x540E;&#x7EED;&#x518D;&#x8BBE;&#x8BA1;&#x5408;&#x7406;&#x7684;&#x6D4B;&#x8BD5;&#x573A;&#x666F;&#x6765;&#x9A8C;&#x8BC1;&#x3002;</p>
<h2 id="&#x6700;&#x540E;"><a href="#&#x6700;&#x540E;" class="headerlink" title="&#x6700;&#x540E;"></a>&#x6700;&#x540E;</h2><p>&#x672C;&#x6587;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x9AD8;&#x53EF;&#x7528;&#x5B9E;&#x8DF5;&#x4E2D;&#x7684;&#x4E00;&#x70B9;&#x601D;&#x8003;&#xFF0C;&#x4ECE;&#x800C;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x79CD;&#x5728;&#x4FDD;&#x969C;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x89E3;&#x51B3;&#x7CFB;&#x7EDF;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;paxos&#x548C;raft&#x534F;&#x8BAE;&#xFF0C;&#x7531;&#x4E8E;&#x672C;&#x8BBE;&#x8BA1;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6027;&#x80FD;&#x7B49;&#x65B9;&#x9762;&#x4E0D;&#x5360;&#x4F18;&#x52BF;&#x3002;&#x4F46;&#x662F;&#x672C;&#x8BBE;&#x8BA1;&#x4F9D;&#x7136;&#x6709;&#x5176;&#x81EA;&#x8EAB;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x8BC1;&#x660E;&#x5176;&#x5B9E;&#x73B0;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x672C;&#x6587;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x526F;&#x672C;&#x534F;&#x8BAE;&#xFF0C;&#x6B63;&#x5728;&#x89E3;&#x8026;&#x51FA;&#x6765;&#xFF0C;&#x51C6;&#x5907;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x591A;&#x8282;&#x70B9;&#x526F;&#x672C;&#x62F7;&#x8D1D;&#x5E93;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x3002;&#x3002;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h2><p>[1] Brewer, Eric A. &#x201C;Towards robust distributed systems.&#x201D; PODC. Vol. 7. 2000.<br> [2] &#x5218;&#x6770;. &#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x539F;&#x7406;&#x4ECB;&#x7ECD;<br> [3] Lamport L. The part-time parliament. ACM Transactions on Computer Systems (TOCS). 1998<br> [4] Ongaro D, Ousterhout JK. In search of an<br> understandable consensus algorithm. InUSENIX Annual Technical Conference 2014<br> [5] Hunt P, Konar M, Junqueira FP, Reed B. ZooKeeper: Wait-free Coordination for Internet-scale Systems. InUSENIX annual technical conference 2010<br> [6] Schneider<br> FB. Implementing fault-tolerant services using the state machine approach: A tutorial. ACM Computing Surveys (CSUR). 1990</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/63711d5981917418b23b03a4060457ca.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-ZooKeeper/" rel="tag"># 后端,ZooKeeper</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903520966017031.html" rel="next" title="中小型研发团队架构实践：应用监控怎么做？">
                <i class="fa fa-chevron-left"></i> 中小型研发团队架构实践：应用监控怎么做？
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903520936656904.html" rel="prev" title="白话解析：一致性哈希算法 consistent hashin">
                白话解析：一致性哈希算法 consistent hashin <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#说明"><span class="nav-number">1.</span> <span class="nav-text">说明</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#背景"><span class="nav-number">2.</span> <span class="nav-text">背景</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-CAP定理"><span class="nav-number">2.0.1.</span> <span class="nav-text">1. CAP定理</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-多副本容灾"><span class="nav-number">2.0.2.</span> <span class="nav-text">2. 多副本容灾</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-设计考虑"><span class="nav-number">2.0.3.</span> <span class="nav-text">3. 设计考虑</span></a></li></ol></li></ol><li class="nav-item nav-level-2"><a class="nav-link" href="#相关工作"><span class="nav-number">3.</span> <span class="nav-text">相关工作</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-复制状态机"><span class="nav-number">3.0.1.</span> <span class="nav-text">1. 复制状态机</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-选主实现"><span class="nav-number">3.0.2.</span> <span class="nav-text">2. 选主实现</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-节点存活状态监听"><span class="nav-number">3.0.3.</span> <span class="nav-text">3. 节点存活状态监听</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#4-日志复制"><span class="nav-number">3.0.4.</span> <span class="nav-text">4. 日志复制</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#5-故障恢复"><span class="nav-number">3.0.5.</span> <span class="nav-text">5. 故障恢复</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#6-日志提交"><span class="nav-number">3.0.6.</span> <span class="nav-text">6. 日志提交</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#系统设计"><span class="nav-number">4.</span> <span class="nav-text">系统设计</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-总体架构设计"><span class="nav-number">4.0.1.</span> <span class="nav-text">1. 总体架构设计</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-系统接口"><span class="nav-number">4.0.2.</span> <span class="nav-text">2. 系统接口</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-与Zookeeper交互的模块设计"><span class="nav-number">4.0.3.</span> <span class="nav-text">3. 与Zookeeper交互的模块设计</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#4-RPC设计"><span class="nav-number">4.0.4.</span> <span class="nav-text">4. RPC设计</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#功能实现"><span class="nav-number">5.</span> <span class="nav-text">功能实现</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-节点上线"><span class="nav-number">5.0.1.</span> <span class="nav-text">1. 节点上线</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-主节点处理操作日志"><span class="nav-number">5.0.2.</span> <span class="nav-text">2. 主节点处理操作日志</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-备用节点处理操作日志"><span class="nav-number">5.0.3.</span> <span class="nav-text">3. 备用节点处理操作日志</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#4-状态机执行"><span class="nav-number">5.0.4.</span> <span class="nav-text">4. 状态机执行</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#5-选主实现"><span class="nav-number">5.0.5.</span> <span class="nav-text">5. 选主实现</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#优化"><span class="nav-number">6.</span> <span class="nav-text">优化</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-日志批量操作"><span class="nav-number">6.0.1.</span> <span class="nav-text">1. 日志批量操作</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-日志流水线操作"><span class="nav-number">6.0.2.</span> <span class="nav-text">2. 日志流水线操作</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-日志拉取"><span class="nav-number">6.0.3.</span> <span class="nav-text">3. 日志拉取</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#4-数据读取"><span class="nav-number">6.0.4.</span> <span class="nav-text">4. 数据读取</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#讨论"><span class="nav-number">7.</span> <span class="nav-text">讨论</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-与客户端交互"><span class="nav-number">7.0.1.</span> <span class="nav-text">1. 与客户端交互</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-与paxos和raft的比较"><span class="nav-number">7.0.2.</span> <span class="nav-text">2. 与paxos和raft的比较</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-适用场景"><span class="nav-number">7.0.3.</span> <span class="nav-text">3. 适用场景</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#测试"><span class="nav-number">8.</span> <span class="nav-text">测试</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#1-测试环境"><span class="nav-number">8.0.1.</span> <span class="nav-text">1. 测试环境</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-测试说明"><span class="nav-number">8.0.2.</span> <span class="nav-text">2. 测试说明</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-测试结果"><span class="nav-number">8.0.3.</span> <span class="nav-text">3. 测试结果</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#最后"><span class="nav-number">9.</span> <span class="nav-text">最后</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#参考文献"><span class="nav-number">10.</span> <span class="nav-text">参考文献</span></a></li></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
