<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="Java,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x6765;&amp;#x81EA;&amp;#x95EA;&amp;#x5BA2;Sun&amp;#x7684;&amp;#x6295;&amp;#x7A3F;&amp;#xFF0C;&amp;#x535A;&amp;#x5BA2;&amp;#x5730;&amp;#x5740;&amp;#xFF1A; https://www.cnblogs.com/flashsun/p/9450066.html &amp;#x770B;&amp;#x5B8C;&amp;#x4F60;&amp;#x5">
<meta name="keywords" content="Java">
<meta property="og:type" content="article">
<meta property="og:title" content="没有文档，没有老员工讲解，悲催的新人如何快速熟悉一个新项目？">
<meta property="og:url" content="https://dev.newban.cn/6844903766966157320.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x6765;&amp;#x81EA;&amp;#x95EA;&amp;#x5BA2;Sun&amp;#x7684;&amp;#x6295;&amp;#x7A3F;&amp;#xFF0C;&amp;#x535A;&amp;#x5BA2;&amp;#x5730;&amp;#x5740;&amp;#xFF1A; https://www.cnblogs.com/flashsun/p/9450066.html &amp;#x770B;&amp;#x5B8C;&amp;#x4F60;&amp;#x5">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/dd588ae92f597dae06ed218c12415fe44904fae7f633655591027c01a33c27f4">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/200b8c1633f8a76273d099c3bb0574a211aa34376dc1d91279c1d24d3e1e3087">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/d07176f511800f82556b9daa350c49e0782a77c1f0a4e9633f1d9fdbb19b9b5b">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/08e563d762a7c83489def3ad96844f515f93bf630bf99e123e503a5ce25733c9">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/200b8c1633f8a76273d099c3bb0574a211aa34376dc1d91279c1d24d3e1e3087">
<meta property="og:updated_time" content="2024-04-28T07:36:11.933Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="没有文档，没有老员工讲解，悲催的新人如何快速熟悉一个新项目？">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x6765;&amp;#x81EA;&amp;#x95EA;&amp;#x5BA2;Sun&amp;#x7684;&amp;#x6295;&amp;#x7A3F;&amp;#xFF0C;&amp;#x535A;&amp;#x5BA2;&amp;#x5730;&amp;#x5740;&amp;#xFF1A; https://www.cnblogs.com/flashsun/p/9450066.html &amp;#x770B;&amp;#x5B8C;&amp;#x4F60;&amp;#x5">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/dd588ae92f597dae06ed218c12415fe44904fae7f633655591027c01a33c27f4">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903766966157320.html">





  <title>没有文档，没有老员工讲解，悲催的新人如何快速熟悉一个新项目？ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">没有文档，没有老员工讲解，悲催的新人如何快速熟悉一个新项目？</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2019-01-24T16:56:10+08:00">
                2019-01-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x672C;&#x6587;&#x6765;&#x81EA;<strong>&#x95EA;&#x5BA2;Sun</strong>&#x7684;&#x6295;&#x7A3F;&#xFF0C;&#x535A;&#x5BA2;&#x5730;&#x5740;&#xFF1A;</p>
<p><a href="/external_links/d10c6a50a5d788302e1e494437842b3a.html" target="blank" rel="noopener">https://www.cnblogs.com/flashsun/p/9450066.html</a></p>
<p>&#x770B;&#x5B8C;&#x4F60;&#x5C31;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4E0B;&#x529F;&#x592B;&#xFF0C;&#x6CA1;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x8FD8;&#x662F;&#x4E07;&#x4E07;&#x4E0D;&#x884C;&#x7684;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65B0;&#x4EBA;&#x8FDB;&#x5165;&#x4E00;&#x5BB6;&#x65B0;&#x516C;&#x53F8;&#x540E;&#xFF0C;&#x6700;&#x5934;&#x75BC;&#x7684;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x548C;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x3002; </p>
<p>&#x56E0;&#x4E3A;&#x6587;&#x6863;&#x5F88;&#x5C11;&#xFF0C;&#x6CA1;&#x6709;&#x6587;&#x6863;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6587;&#x6863;&#x4E25;&#x91CD;&#x843D;&#x4F0D;&#xFF0C; &#x6839;&#x672C;&#x6CA1;&#x6CD5;&#x770B;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x70ED;&#x5FC3;&#x7684;&#x8001;&#x5458;&#x5DE5;&#xFF0C;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x5730;&#x7ED9;&#x4F60;&#x8BB2;&#xFF0C;&#x968F;&#x65F6;&#x5728;&#x4F60;&#x8EAB;&#x8FB9;&#x7B54;&#x7591;&#x89E3;&#x60D1;&#xFF0C; &#x90A3;&#x7B80;&#x76F4;&#x662F;&#x5929;&#x5927;&#x7684;&#x597D;&#x8FD0;&#x6C14;&#xFF0C; &#x73B0;&#x5B9E;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x5F88;&#x5FD9;&#xFF0C;&#x6CA1;&#x4EBA;&#x7ED9;&#x4F60;&#x8BB2;&#x89E3;&#x3002; </p>
<p>&#x5F88;&#x5FEB;&#x5C31;&#x8981;&#x6DF1;&#x5165;&#x9879;&#x76EE;&#x505A;&#x5F00;&#x53D1;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F; </p>
<p>&#x6211;&#x5728;&#x52A0;&#x5165;&#x65B0;&#x516C;&#x53F8;&#x540E;&#xFF0C;&#x5C31;&#x9047;&#x5230;&#x4E86;&#x60B2;&#x50AC;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x529B;&#x91CF;&#x719F;&#x6089;&#x4E86;<strong>&#x5927;&#x6982;&#x5341;&#x4E2A;&#x9879;&#x76EE;</strong>&#xFF0C;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x3002; </p>
<p>&#x8FD9;&#x91CC;&#x5F3A;&#x8C03;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x7684;&#x7B56;&#x7565;&#x662F;&#x5927;&#x4F53;&#x4E86;&#x89E3;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x7EBF;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x9879;&#x76EE;&#xFF0C;&#x5927;&#x6982;&#x6478;&#x6E05;&#x695A;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x662F;&#x5E72;&#x561B;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4F55;&#xFF0C;&#x4EE5;&#x4FBF;&#x4EE5;&#x540E;&#x5177;&#x4F53;&#x9879;&#x76EE;&#x65F6;&#x4E0D;&#x81F3;&#x4E8E;&#x627E;&#x4E0D;&#x5230;&#x65B9;&#x5411;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x7EC6;&#x8282;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x76F8;&#x6BD4;&#x5BF9;&#x6574;&#x4F53;&#x4E0A;&#x7684;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#xFF0C;&#x8FD8;&#x662F;&#x7B80;&#x5355;&#x8BB8;&#x591A;&#x7684;&#x3002;</p>
<p> &#x4E00;. &#x5FC5;&#x8981;&#x6761;&#x4EF6;</p>
<p> &#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x4E0D;&#x662F;&#x201C;&#x9879;&#x76EE;&#x9762;&#x5BF9;&#x7684;&#x5BA2;&#x6237;&#x662F;&#x8C01;&#x201D;&#xFF0C;&#x201C;&#x9879;&#x76EE;&#x7528;&#x7684;&#x6846;&#x67B6;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#x8FD9;&#x79CD;&#xFF0C;&#x800C;&#x662F;&#x771F;&#x771F;&#x6B63;&#x6B63;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x7528;&#x51E0;&#x6761;&#x6570;&#x5B66;&#x516C;&#x7406;&#x80FD;&#x63A8;&#x51FA;&#x6574;&#x4E2A;&#x6570;&#x5B66;&#x4F53;&#x7CFB;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x603B;&#x7ED3;&#x7684;&#x771F;&#x6B63;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x53EA;&#x6709;&#x8FD9;&#x4E24;&#x70B9;&#xFF1A;</p>
<p>&#x6E90;&#x7801;&#x4F4D;&#x7F6E;&#xFF08;gitlab&#x6216;svn&#xFF09; </p>
<p>&#x90E8;&#x7F72;&#x73AF;&#x5883;&#xFF08;dev/test/online&#xFF09; </p>
<p>&#x6240;&#x8C13;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E86;&#x4E00;&#x5806;&#x673A;&#x5668;&#x4E0A;&#x800C;&#x5DF2;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x52A0;&#x8282;&#x7EA6;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x8981;&#x83B7;&#x5F97;wiki&#x3001;jenkins&#x3001;&#x9875;&#x9762;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x3001; &#x6570;&#x636E;&#x5E93;&#x5730;&#x5740;&#x7B49;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002; </p>
<p>&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x90A3;&#x4E24;&#x4E2A;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x662F;&#x60F3;&#x8BF4;&#x5176;&#x5B9E;&#x9879;&#x76EE;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#x4E8B;&#xFF0C;&#x4F60;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x60F3;&#x7684;&#x592A;&#x590D;&#x6742;&#x3002;</p>
<p>&#x5B83;&#x7684;&#x4E1A;&#x52A1;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x672C;&#x8D28;&#x5374;&#x9003;&#x4E0D;&#x51FA;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x5343;&#x4E07;&#x4E0D;&#x53EF;&#x4EE5;&#x7CCA;&#x6D82;&#x3002;&#x5F53;&#x4F60;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x6216;&#x8005;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E3B;&#x8981;&#x628A;&#x6E90;&#x7801;&#x548C;&#x73AF;&#x5883;&#x5F04;&#x6E05;&#x695A;&#x5427;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x90FD;&#x662F;&#x9644;&#x5C5E;&#x54C1;&#x3002;</p>
<p> &#x4E8C;. &#x4ECE;&#x9875;&#x9762;&#x5230;&#x6570;&#x636E;&#x5E93;</p>
<p> &#x6709;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x4E86;&#x89E3;&#x9879;&#x76EE;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x4E0D;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x6240;&#x4EE5;&#x5343;&#x4E07;&#x4E0D;&#x80FD;&#x6DF1;&#x5165;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x70E6;&#xFF0C;&#x6000;&#x7591;&#x4EBA;&#x751F;&#xFF0C;&#x5F88;&#x5FEB;&#x653E;&#x5F03;&#x3002; </p>
<p>&#x5BF9;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x9879;&#x76EE;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5EFA;&#x7ACB;&#x5728;&#x5BF9;&#x6574;&#x4F53;&#x4E86;&#x89E3;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x3002;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4E3A;&#x5404;&#x4E2A;&#x9879;&#x76EE;&#x753B;&#x51FA;&#x4E00;&#x6761;&#x7EBF;&#xFF0C;&#x5E76;&#x6807;&#x660E;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x50CF;&#x4E0B;&#x9762;&#x7684;&#x6837;&#x5B50;&#xFF1A;</p>
<p>&#x9875;&#x9762;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x2013;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x2013;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x2013;&#x6570;&#x636E;&#x5E93;&#x5730;&#x5740;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x5BF9;&#x5E94;&#x591A;&#x4E2A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x56FE;&#x5E94;&#x8BE5;&#x5DEE;&#x4E0D;&#x591A;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/dd588ae92f597dae06ed218c12415fe44904fae7f633655591027c01a33c27f4" alt></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/200b8c1633f8a76273d099c3bb0574a211aa34376dc1d91279c1d24d3e1e3087" alt></p>
<p>&#x8FD9;&#x4E2A;&#x6574;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8BA9;&#x81EA;&#x5DF1;&#x68B3;&#x7406;&#x6E05;&#x695A;&#xFF0C;&#x4E00;&#x5171;&#x6709;&#x54EA;&#x4E9B;&#x9879;&#x76EE;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x524D;&#x7AEF;&#x53EF;&#x89C6;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x540E;&#x53F0;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x5206;&#x522B;&#x8C03;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x540E;&#x53F0;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x8FC7;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x4E86;&#x89E3;&#x5230;&#x8FD9;&#x6761;&#x4E1A;&#x52A1;&#x7EBF;&#x63D0;&#x4F9B;&#x4E86;&#x4EC0;&#x4E48;&#x529F;&#x80FD;&#xFF0C;&#x4ECE;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x548C;&#x9875;&#x9762;&#x8DEF;&#x5F84;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4E86;&#x89E3;&#x5230;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;&#x7528;&#x6237;&#x5C55;&#x793A;&#x4EC0;&#x4E48;&#x3002; </p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x89C1;&#x540D;&#x77E5;&#x610F;&#xFF0C;&#x5373;&#x4F7F;&#x70B9;&#x5F00;&#x9875;&#x9762;&#xFF0C;&#x8FDE;&#x63A5;&#x4E0A;&#x6570;&#x636E;&#x5E93;&#x770B;&#x770B;&#xFF0C;&#x4E5F;&#x5343;&#x4E07;&#x522B;&#x82B1;&#x8FC7;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x91CD;&#x70B9;&#x5C31;&#x662F;&#x4EC5;&#x4EC5;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x6761;&#x4E1A;&#x52A1;&#x7EBF;&#x63D0;&#x7684;&#x6574;&#x4F53;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x7EC6;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x9879;&#x76EE;&#x90E8;&#x7F72;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6807;&#x6CE8;&#x5728;&#x9879;&#x76EE;&#x65C1;&#x8FB9;&#xFF0C;&#x6216;&#x8005;&#x4FDD;&#x5B58;&#x5728;xshell&#x91CC;&#x3002;&#x6B64;&#x5916;&#x6240;&#x6709;&#x975E;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x80FD;&#x67E5;&#x5230;&#x7684;&#x5C3D;&#x91CF;&#x90FD;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x771F;&#x7684;&#x4E3A;&#x4EE5;&#x540E;&#x627E;&#x5404;&#x79CD;&#x4E1C;&#x897F;&#x65B9;&#x4FBF;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x5426;&#x5219;&#x522B;&#x770B;&#x4F60;&#x73B0;&#x5728;&#x8282;&#x7EA6;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x628A;&#x4EE5;&#x540E;&#x67E5;&#x627E;&#x76F8;&#x5173;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x95F4;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x5C06;&#x4F1A;&#x662F;&#x5929;&#x6587;&#x6570;&#x5B57;&#x4E86;&#x3002; </p>
<p>&#x8FD9;&#x91CC;&#x5173;&#x4E8E;&#x6574;&#x7406;&#x9879;&#x76EE;&#x90E8;&#x7F72;&#x7684;&#x673A;&#x5668;&#x8FD8;&#x6709;&#x4E2A;&#x5C0F;&#x63D2;&#x66F2;&#xFF0C;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x4FE1;&#x606F;&#x6CA1;&#x4EBA;&#x4F1A;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x5730;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x5C31;&#x7B97;&#x6709;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x8BF4;&#x7684;&#x7279;&#x522B;&#x5168;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x662F;&#x501F;&#x52A9;jenkins&#x6765;&#x6574;&#x7406;&#x7684;&#x3002;&#x9879;&#x76EE;&#x90E8;&#x7F72;&#x90FD;&#x9700;&#x8981;&#x7528;&#x5230;jenkins&#xFF0C;&#x53EA;&#x8981;&#x67E5;&#x770B;jenkins&#x914D;&#x7F6E;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x90E8;&#x7F72;&#x73AF;&#x5883;&#x4E00;&#x4E00;&#x6574;&#x7406;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x8BA4;&#x4E3A;&#x662F;&#x6700;&#x5168;&#x800C;&#x4E14;&#x6700;&#x65B0;&#x7684;&#x3002; </p>
<p>&#x4E0D;&#x8981;&#x548C;&#x6211;&#x8BF4;&#x67E5;wiki&#xFF0C;&#x5982;&#x679C;&#x516C;&#x53F8;wiki&#x90FD;&#x5199;&#x7684;&#x8FD9;&#x4E48;&#x5168;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x5C31;&#x6CA1;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4EC0;&#x4E48;&#x4E8B;&#x4E86;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x7684;jenkins&#x6743;&#x9650;&#x7279;&#x522B;&#x5C11;&#xFF0C;&#x53EA;&#x80FD;&#x770B;&#x4E00;&#x90E8;&#x5206;&#x9879;&#x76EE;&#xFF0C;&#x540E;&#x6765;&#x8D39;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x52B2;&#xFF0C;&#x60F3;&#x4E86;&#x5F88;&#x591A;&#x529E;&#x6CD5;&#x624D;&#x770B;&#x5230;&#x9879;&#x76EE;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x6574;&#x7406;&#x51FA;&#x4E86;&#x90E8;&#x7F72;&#x7684;&#x673A;&#x5668;&#x3002;</p>
<p> &#x4E09;. &#x4E86;&#x89E3;&#x9879;&#x76EE;&#x95F4;&#x7684;&#x5173;&#x7CFB;</p>
<p> &#x8FD9;&#x90E8;&#x5206;&#x5982;&#x679C;&#x6709;&#x8001;&#x5458;&#x5DE5;&#x613F;&#x610F;&#x548C;&#x4F60;&#x8BF4;&#x8BF4;&#xFF0C;&#x90A3;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5148;&#x8DF3;&#x8FC7;&#x8FD9;&#x6BB5;&#xFF0C;&#x4EE5;&#x540E;&#x6162;&#x6162;&#x4E86;&#x89E3;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p> &#x56DB;. &#x6574;&#x7406;&#x6570;&#x636E;&#x5E93;&#x8868;</p>
<p> &#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x90FD;&#x662F;&#x6574;&#x7406;&#x9879;&#x76EE;&#x7684;&#x5927;&#x4F53;&#x6846;&#x67B6;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x5177;&#x4F53;&#x7684;&#x9879;&#x76EE;&#x7EC6;&#x8282;&#x3002;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4ECD;&#x7136;&#x4E0D;&#x53BB;&#x6D89;&#x53CA;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BF4;&#x7AD9;&#x5728;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x7684;&#x672C;&#x8D28;&#x4E0A;&#x770B;&#xFF0C;&#x4E1A;&#x52A1;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x5806;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x7AD9;&#x5728;&#x5355;&#x4E2A;&#x9879;&#x76EE;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x589E;&#x5220;&#x6539;&#x67E5;&#x64CD;&#x4F5C;&#x800C;&#x5DF2;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5C31;&#x662F; &#x8F93;&#x5165;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002; </p>
<p>&#x6240;&#x4EE5;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x4E24;&#x4EF6;&#x4E8B;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6574;&#x7406;<strong>&#x6570;&#x636E;&#x5E93;&#x8868;</strong>&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6574;&#x7406;<strong>Controller&#x5C42;&#x7684;&#x6240;&#x6709;&#x63A5;&#x53E3;</strong>&#x3002; </p>
<p>&#x8FD9;&#x91CC;&#x9996;&#x5148;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x9879;&#x76EE;&#x53BB;&#x770B;&#xFF0C;&#x4F17;&#x591A;&#x9879;&#x76EE;&#x4E2D;&#x4E00;&#x5B9A;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x6838;&#x5FC3;&#x9879;&#x76EE;&#xFF0C;&#x5148;&#x4ECE;&#x8FD9;&#x4E2A;&#x5F00;&#x59CB;&#x770B;&#x8D77;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x62FF;&#x5DE5;&#x5177;&#x5BFC;&#x51FA;&#x6765;&#x8868;&#x7ED3;&#x6784;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x770B;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x96BE;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x5C06;&#x8868;&#x540D;&#x5168;&#x90E8;&#x5BFC;&#x51FA;&#xFF0C;&#x7B5B;&#x9009;&#x51FA;&#x90A3;&#x4E9B;&#x6838;&#x5FC3;&#x7684;&#x8868;&#x3002; </p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x5BFC;&#x51FA;&#x8868;&#x540D;&#x3001;&#x7B5B;&#x9009;&#x8868;&#x4EE5;&#x53CA;&#x540E;&#x9762;&#x7684;&#x5206;&#x6790;&#x8868;&#x5B57;&#x6BB5;&#xFF0C;&#x4E0D;&#x59A8;&#x7ED9;&#x81EA;&#x5DF1;&#x505A;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x5728;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x5F88;&#x9EBB;&#x70E6;&#x7684;&#x6216;&#x8005;&#x611F;&#x89C9;&#x4EE5;&#x540E;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x7528;&#x7684;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6211;&#x7ED9;&#x81EA;&#x5DF1;&#x8D77;&#x540D;&#x4E3A;javamate&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x5DE5;&#x5177;&#x9010;&#x6E10;&#x79EF;&#x7D2F;&#x8D77;&#x6765;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4ECA;&#x540E;&#x6709;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x65B9;&#x4FBF;&#x3002;</p>
</blockquote>
<p>&#x8BDD;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x662F;&#x6838;&#x5FC3;&#x8868;&#x5462;&#xFF0C;&#x4E0D;&#x8981;&#x7740;&#x6025;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6392;&#x9664;&#x6389;&#x4E00;&#x4E9B;&#x6CA1;&#x7528;&#x7684;&#x3002;&#x62FF;&#x6211;&#x5728;&#x516C;&#x53F8;&#x5206;&#x6790;&#x7684;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x5171;150&#x591A;&#x4E2A;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x597D;&#x591A;copy&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x5907;&#x4EFD;&#xFF0C;flow&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x6D41;&#x6C34;&#xFF0C;rel&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x4E2D;&#x95F4;&#x5173;&#x8054;&#x8868;&#xFF0C;statistics&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x6570;&#x636E;&#x7EDF;&#x8BA1;&#x8868;&#xFF0C;log&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x65E5;&#x5FD7;&#x8868;&#xFF0C;config&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x914D;&#x7F6E;&#x8868;&#x3002;&#x7B49;&#x7B49;&#x3002; </p>
<p>&#x6392;&#x9664;&#x6389;&#x8FD9;&#x4E9B;&#x5BF9;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x7406;&#x89E3;&#x65E0;&#x5F71;&#x54CD;&#x7684;&#x8868;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x5269;&#x7684;&#x4E5F;&#x5C31;20&#x6765;&#x5F20;&#x8868;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x597D;&#x591A;&#x8868;&#x662F;&#x5C5E;&#x4E8E;&#x4E00;&#x7C7B;&#x7684;&#xFF0C;&#x6BD4;&#x5982;order&#x8868;&#x5C31;&#x6709;&#x5404;&#x79CD;order&#xFF0C;&#x6309;&#x7C7B;&#x522B;&#x518D;&#x5206;&#x51FA;&#x6765;&#x4E5F;&#x5C31;&#x56DB;&#x4E94;&#x7C7B;&#xFF0C;&#x518D;&#x5206;&#x6790;&#x8D77;&#x6765;&#x5C31;&#x4E0D;&#x96BE;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x662F;&#x66F4;&#x5927;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x518D;&#x4E0D;&#x65AD;&#x505A;&#x62C6;&#x89E3;&#x3002;</p>
<p>&#x518D;&#x5177;&#x4F53;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x6838;&#x5FC3;&#x8868;&#x5B57;&#x6BB5;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x8981;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x627E;&#x51FA;&#x8868;&#x4E2D;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;&#x8868;b&#x4E2D;&#x6709;&#x4E2A;&#x5B57;&#x6BB5;&#x53EB;&#x6BD4;&#x5982;a.id&#xFF0C;&#x90A3;&#x4E48;b&#x548C; a&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x8868;&#x6709;rel&#x4E2D;&#x95F4;&#x8868;&#xFF0C;&#x90A3;&#x4E8C;&#x8005;&#x5C31;&#x662F;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8D77;&#x7801;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x8BB2;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x6211;&#x4E5F;&#x662F;&#x505A;&#x4E86;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x6765;&#x5224;&#x65AD;&#x7684;&#x3002; </p>
<p>&#x5230;&#x6B64;&#xFF0C;&#x4F60;&#x5C31;&#x5BF9;&#x6574;&#x4F53;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7ED3;&#x6784;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x4E86;&#x3002;&#x6839;&#x636E;&#x8868;&#x540D;&#x4E5F;&#x80FD;&#x5BF9;&#x8868;&#x7684;&#x5927;&#x81F4;&#x5185;&#x5BB9;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x9488;&#x5BF9;&#x5177;&#x4F53;&#x7684;&#x8868;&#xFF0C;&#x770B;&#x91CC;&#x9762;&#x5177;&#x4F53;&#x7684;&#x5B57;&#x6BB5;&#x548C;&#x524D;&#x4EBA;&#x7ED9;&#x51FA;&#x7684;&#x5907;&#x6CE8;&#xFF0C;<strong>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x6CA1;&#x6709;&#x6280;&#x5DE7;&#x4E86;&#xFF0C;&#x8981;&#x8010;&#x5FC3;&#xFF0C;&#x8981;&#x6162;&#x6162;&#x71AC;</strong>&#x3002; </p>
<p> &#x4E94;. &#x6DF1;&#x5165;&#x4EE3;&#x7801;&#x5C42;</p>
<p> &#x5F53;&#x4F60;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8868;&#x505A;&#x4E86;&#x4EE5;&#x4E0A;&#x5230;&#x4E86;&#x89E3;&#x540E;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x80FD;&#x63D0;&#x4F9B;&#x4EC0;&#x4E48;&#x670D;&#x52A1;&#x4E86;&#x89E3;&#x5230;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x8BBA;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6446;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x5176;&#x5B9E;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x5C31;&#x5DF2;&#x7ECF;&#x5DEE;&#x4E0D;&#x591A;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x6765;&#x8BB2;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E5F;&#x5927;&#x81F4;&#x80FD;&#x731C;&#x5230;&#x4E2A;&#x516B;&#x4E5D;&#x5206;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x9879;&#x76EE;&#x4EE3;&#x7801;&#x53EA;&#x5206;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF1A; </p>
<ol>
<li>&#x901A;&#x8FC7;&#x4EA4;&#x4E92;&#x5BF9;&#x81EA;&#x8EAB;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x589E;&#x5220;&#x6539;&#x67E5;&#x64CD;&#x4F5C; </li>
</ol>
<ol start="2">
<li>&#x901A;&#x8FC7;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x6216;&#x670D;&#x52A1;&#x5668;&#x811A;&#x672C;&#x5BF9;&#x81EA;&#x8EAB;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x589E;&#x5220;&#x6539;&#x67E5;&#x64CD;&#x4F5C; </li>
</ol>
<ol start="3">
<li>&#x8C03;&#x7528;&#x6216;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5; </li>
</ol>
<p>&#x5982;&#x679C;&#x53EA;&#x662F;&#x5355;&#x4E00;&#x9879;&#x76EE;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x9014;&#x5F84;&#x53BB;&#x73A9;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x800C;&#x5DF2;&#xFF0C;&#x524D;&#x4E24;&#x70B9;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x800C;&#x5982;&#x679C;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#xFF0C;&#x90A3;&#x4E48;&#x52A0;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x70B9;&#x8DB3;&#x77E3;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x5206;&#x6210;&#x8FD9;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x770B;&#xFF0C;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5C31;&#x4E0D;&#x6210;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x4F60;&#x6CA1;&#x6709;&#x770B;&#x8FC7;&#x67D0;&#x4E00;&#x9879;&#x76EE;&#x800C;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x4E2A;bug&#x8981;&#x4F60;&#x89E3;&#x51B3;&#x65F6;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53BB;&#x5FEB;&#x901F;&#x5B9A;&#x95EE;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4EA4;&#x4E92;&#x5BF9;&#x81EA;&#x8EAB;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x589E;&#x5220;&#x6539;&#x67E5;&#x64CD;&#x4F5C;</p>
<p>&#x8FD9;&#x4E2A;&#x65E0;&#x975E;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x4F7F;&#x590D;&#x6742;&#x4E5F;&#x662F;&#x4EE3;&#x7801;&#x8F83;&#x957F;&#xFF0C;&#x8868;&#x8F83;&#x591A;&#x800C;&#x5DF2;&#x3002;&#x6240;&#x8C13;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x6216;&#x8BB8;&#x662F;Controller&#x66B4;&#x9732;&#x7ED9;&#x524D;&#x7AEF;&#x7528;&#x6237;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x5F00;&#x4E00;&#x4E2A;rpc&#x7AEF;&#x53E3;&#x66B4;&#x9732;&#x7ED9;&#x5176;&#x4ED6;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x603B;&#x4E4B;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x53BB;&#x89E6;&#x53D1;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4E5F;&#x7ED9;&#x81EA;&#x5DF1;&#x505A;&#x4E86;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x626B;&#x63CF;&#x51FA;&#x6240;&#x6709;&#x7684;&#x66B4;&#x9732;&#x670D;&#x52A1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5C55;&#x793A;&#x51FA;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x8DEF;&#x5F84;&#x540D;&#xFF0C;&#x53C2;&#x6570;&#x5217;&#x8868;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x7B49;&#x3002;</p>
</blockquote>
<p>&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x63A5;&#x53E3;&#x5F88;&#x5C11;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x4E2A;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x8FD8;&#x662F;&#x5148;&#x627E;&#x51FA;&#x6BD4;&#x8F83;&#x6838;&#x5FC3;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x7814;&#x7A76;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x7528;&#x7684;&#x662F;postman&#xFF0C;&#x628A;&#x8981;&#x7814;&#x7A76;&#x7684;&#x63A5;&#x53E3;&#x8BBF;&#x95EE;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x6DFB;&#x52A0;&#x8BBF;&#x95EE;&#x6210;&#x529F;&#x548C;&#x5931;&#x8D25;&#x7684;Example&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x6211;&#x63A8;&#x8350;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x628A;postman&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x8D8A;&#x8BE6;&#x7EC6;&#x8D8A;&#x597D;&#xFF0C;postman&#x4E0D;&#x53EA;&#x662F;&#x53EF;&#x4EE5;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x8BBF;&#x95EE;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD8;&#x80FD;&#x505A;&#x6279;&#x91CF;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x751F;&#x6210;api&#x6587;&#x6863;&#x7528;&#x4E8E;&#x548C;&#x524D;&#x7AEF;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x6837;&#x4F60;&#x4E0D;&#x4F46;&#x6D4B;&#x8BD5;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD8;&#x7701;&#x7684;&#x5199;&#x6587;&#x6863;&#x4E86;&#x3002;&#x800C;&#x4E14;postman&#x8FD8;&#x6709;&#x4E2A;&#x597D;&#x5904;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;mock&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#x6302;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x5199;&#x597D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x524D;&#x7AEF;&#x4EBA;&#x5458;&#x5148;&#x8BBF;&#x95EE;&#x4F60;&#x7684;mock&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x5F71;&#x54CD;&#x524D;&#x7AEF;&#x8FB9;&#x6D4B;&#x8BD5;&#x8FB9;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x524D;&#x540E;&#x7AEF;&#x5206;&#x79BB;&#x561B;&#x3002;</p>
</blockquote>
<p>&#x6574;&#x7406;&#x51FA;&#x6240;&#x6709;&#x63A5;&#x53E3;&#x540E;&#xFF0C;&#x80AF;&#x5B9A;&#x5927;&#x90E8;&#x5206;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x61C2;&#xFF0C;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x70B9;&#x8FDB;&#x53BB;&#x76F4;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x7684;sql&#x8BED;&#x53E5;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x6700;&#x672C;&#x8D28;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x4E00;&#x6B65;&#x4E00;&#x6B65;debug&#xFF0C;&#x82B1;&#x65F6;&#x95F4;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x7684;&#x3002;&#x5982;&#x679C;&#x518D;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x753B;&#x6D41;&#x7A0B;&#x56FE;&#xFF08;&#x8FD9;&#x91CC;&#x6211;&#x6BD4;&#x8F83;&#x63A8;&#x8350;&#x7528;processon&#xFF09;&#x3002;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x63A5;&#x53E3;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x753B;&#x72B6;&#x6001;&#x6D41;&#x8F6C;&#x56FE;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4E4B;&#x524D;&#x770B;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x5904;&#x7406;&#x8BA2;&#x5355;&#x4E1A;&#x52A1;&#x8FD9;&#x5757;&#xFF0C;&#x903B;&#x8F91;&#x786E;&#x5B9E;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x5C31;&#x753B;&#x4E86;&#x7C7B;&#x4F3C;&#x5982;&#x4E0B;&#x7684;&#x56FE;&#xFF1A;</p>
<p>&#x72B6;&#x6001;&#x6D41;&#x8F6C;&#x56FE;&#xFF1A;&#x6A2A;&#x8F74;&#x4EE3;&#x8868;order_status&#x5B57;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x7EB5;&#x8F74;&#x4EE3;&#x8868;&#x5F53;order_status&#x662F;&#x4EE5;&#x4E0A;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x89E6;&#x53D1;&#x8BE5;&#x63A5;&#x53E3;&#x64CD;&#x4F5C;&#x4F1A;&#x4F7F;&#x8BE5;&#x5B57;&#x6BB5;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#xFF09;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/d07176f511800f82556b9daa350c49e0782a77c1f0a4e9633f1d9fdbb19b9b5b" alt></p>
<p>&#x63A5;&#x53E3;&#x5BF9;&#x8868;&#x7684;&#x5F71;&#x54CD;&#x56FE;&#xFF1A;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x8868;&#x4EE5;&#x53CA;&#x8868;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x5217;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x5206;&#x522B;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#x540E;&#x5BF9;&#x5404;&#x4E2A;&#x8868;&#x5B57;&#x6BB5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x53D8;&#x5316;&#x7684;&#x5C31;&#x7528;&#x7EA2;&#x8272;&#x6807;&#x51FA; </p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/08e563d762a7c83489def3ad96844f515f93bf630bf99e123e503a5ce25733c9" alt></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/200b8c1633f8a76273d099c3bb0574a211aa34376dc1d91279c1d24d3e1e3087" alt></p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x7EF4;&#x5EA6;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x518D;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x90FD;&#x80FD;&#x5F88;&#x7406;&#x6E05;&#x695A;&#xFF0C;&#x4E5F;&#x80FD;&#x53D1;&#x73B0;&#x67D0;&#x4E9B;bug&#x6700;&#x672C;&#x8D28;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x6211;&#x6B63;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x672C;&#x6765;&#x4E0D;&#x5C5E;&#x4E8E;&#x6211;&#x7684;&#x9879;&#x76EE;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x4E86;&#x89E3;&#x6E05;&#x695A;&#xFF0C;&#x5FEB;&#x901F;&#x51C6;&#x786E;&#x5730;&#x4FEE;&#x590D;&#x4E86;&#x597D;&#x591A;&#x987D;&#x56FA;&#x7684;bug</strong>&#x3002;</p>
<p>&#x867D;&#x7136;&#x9879;&#x76EE;&#x5F88;&#x70C2;&#xFF0C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5341;&#x5206;&#x6DF7;&#x4E71;&#xFF0C;&#x4F46;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x953B;&#x70BC;&#x4E86;&#x6211;&#x6DF1;&#x5165;&#x4EE3;&#x7801;&#x7406;&#x6E05;&#x903B;&#x8F91;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x72EC;&#x7279;&#x7684;&#x4E00;&#x5957;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x6216;&#x670D;&#x52A1;&#x5668;&#x811A;&#x672C;</p>
<p>&#x8FD9;&#x4E2A;&#x548C;&#x7B2C;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6362;&#x4E86;&#x4E2A;&#x5165;&#x53E3;&#x3002;&#x6BD4;&#x5982;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x542F;&#x7684;&#x4E00;&#x4E9B;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x5BFB;&#x627E;&#x8FD9;&#x4E9B;&#x5165;&#x53E3;&#x7684;&#x786E;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x5BB9;&#x6613;&#xFF0C;&#x6BD4;&#x8F83;&#x5934;&#x75BC;&#xFF0C;&#x4F46;&#x4E5F;&#x53EA;&#x662F;&#x5165;&#x53E3;&#x6BD4;&#x8F83;&#x9690;&#x853D;&#x800C;&#x5DF2;&#x3002;&#x627E;&#x5230;&#x4ED6;&#xFF0C;&#x8BB0;&#x4E0B;&#x6765;&#xFF0C;&#x5177;&#x4F53;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x8FD8;&#x662F;&#x6309;&#x7167;&#x4E0A;&#x8FF0;&#x65B9;&#x6CD5;&#x53BB;&#x5206;&#x6790;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x8C03;&#x7528;&#x6216;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;</p>
<p>&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x901A;&#x8FC7;mq&#x7ED9;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x53D1;&#x6D88;&#x606F;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6216;&#x8005;&#x8C03;&#x7528;&#x7C7B;&#x4F3C;&#x4E91;&#x63A8;&#x9001;&#x7684;&#x63A5;&#x53E3;&#x8BA9;&#x5B83;&#x53BB;&#x5E2E;&#x5FD9;&#x50CF;mq&#x53D1;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x66F4;&#x52A0;&#x9690;&#x853D;&#xFF0C;&#x4F46;&#x6570;&#x91CF;&#x5C11;&#xFF0C;&#x903B;&#x8F91;&#x4E5F;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x4ECD;&#x7136;&#x53EA;&#x662F;&#x627E;&#x5230;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6253;&#x4E0B;&#x4F0F;&#x7B14;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4EE3;&#x7801;&#x7814;&#x7A76;&#x6E05;&#x695A;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x578B;&#x7684;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x670D;&#x52A1;&#x548C;&#x4E2D;&#x95F4;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8FD8;&#x662F;&#x5F97;&#x6162;&#x6162;&#x79EF;&#x7D2F;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#x624D;&#x884C;&#x3002;&#x7531;&#x4E8E;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x578B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E0D;&#x5C55;&#x5F00;&#x53D9;&#x8FF0;&#x4E86;&#x3002;</p>
<p> &#x516D;. &#x91CD;&#x65B0;&#x7406;&#x6E05;&#x9879;&#x76EE;&#x95F4;&#x7684;&#x5173;&#x7CFB;</p>
<p> &#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x4F60;&#x5DF2;&#x7ECF;&#x5927;&#x81F4;&#x4E86;&#x89E3;&#xFF0C;&#x6700;&#x8D77;&#x7801;&#x8C03;&#x7528;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6240;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x751A;&#x81F3;&#x67D0;&#x4E9B;&#x5173;&#x952E;&#x90E8;&#x5206;&#x7684;&#x672C;&#x8D28;&#x903B;&#x8F91;&#xFF0C;&#x4F60;&#x662F;&#x6E05;&#x695A;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x4E0B;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<ol>
<li>&#x6839;&#x636E;&#x4E4B;&#x524D;&#x7684;&#x63A5;&#x53E3;&#x540D;&#x79F0;&#xFF0C;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x4E0B;&#x9879;&#x76EE;&#x95F4;&#x7684;&#x8C03;&#x7528;&#x5173;&#x7CFB;&#x3002;&#x7406;&#x4E0D;&#x6E05;&#x7684;&#x90E8;&#x5206;&#x53BB;&#x95EE;&#x8001;&#x5458;&#x5DE5;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5E26;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x4E86;&#x89E3;&#x95EE;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x80FD;&#x7ED9;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
</ol>
<ol start="2">
<li>&#x770B;&#x770B;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4E3B;&#x8981;&#x662F;mq&#x670D;&#x52A1;&#xFF0C;&#x770B;&#x770B;&#x8C01;&#x662F;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x8C01;&#x662F;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x4E86;&#x89E3;&#x5173;&#x7CFB;</li>
</ol>
<ol start="3">
<li>&#x8FD9;&#x65F6;&#x4F60;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x5F00;&#x4E86;&#x597D;&#x51E0;&#x8F6E;&#x7684;&#x5468;&#x4F1A;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5468;&#x4F1A;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x542C;&#x61C2;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x63CF;&#x8FF0;&#x548C;&#x6700;&#x65B0;&#x7684;&#x51E0;&#x7EC4;&#x9700;&#x6C42;&#xFF0C;&#x9010;&#x6E10;&#x6478;&#x6E05;&#x695A;&#x73B0;&#x5728;&#x9879;&#x76EE;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x6838;&#x5FC3;&#xFF0C;&#x54EA;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x8F85;&#x52A9;&#xFF0C;&#x54EA;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x4EE5;&#x7A33;&#x5B9A;&#x5B89;&#x5168;&#x4E3A;&#x4E3B;&#x7684;</li>
</ol>
<p>&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x6574;&#x6761;&#x4E1A;&#x52A1;&#x7EBF;&#x4F60;&#x5C31;&#x6709;&#x4E86;&#x5927;&#x81F4;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x8981;&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x8D1F;&#x8D23;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x9886;&#x5BFC;&#x5B89;&#x6392;&#x4F60;&#x505A;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x53BB;&#x770B;&#x5177;&#x4F53;&#x7684;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x6DF1;&#x5165;&#x5176;&#x4E2D;&#xFF0C;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x5730;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x4F46;&#x6B64;&#x65F6;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x7AD9;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x9AD8;&#x5EA6;&#x770B;&#x6BCF;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x7EC6;&#x8282;&#x4E0A;&#x8FD8;&#x662F;&#x4E0D;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002;</p>
<p>&#x5728;&#x7814;&#x7A76;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x8DF3;&#x51FA;&#x6765;&#x770B;&#x6574;&#x6761;&#x4E1A;&#x52A1;&#x7EBF;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x4FEE;&#x6B63;&#x4E4B;&#x524D;&#x7531;&#x4E8E;&#x4E0D;&#x4E86;&#x89E3;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x800C;&#x7406;&#x89E3;&#x9519;&#x8BEF;&#x7684;&#x67B6;&#x6784;&#x3002;&#x957F;&#x6B64;&#x4EE5;&#x5F80;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x4F1A;&#x5728;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x8BA4;&#x8BC6;&#x5230;&#x4F60;&#x7684;&#x5168;&#x5C40;&#x89C6;&#x91CE;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8D70;&#x51FA;&#x8001;&#x662F;&#x5199;&#x589E;&#x5220;&#x6539;&#x67E5;&#x4EE3;&#x7801;&#x602A;&#x5708;&#x7684;&#x4E00;&#x4E2A;&#x9014;&#x5F84;&#x3002; </p>
<p>&#x6162;&#x6162;&#x4F1A;&#x6709;&#x4EBA;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x4F60;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x7406;&#x89E3;&#x603B;&#x80FD;&#x7AD9;&#x5728;&#x5168;&#x5C40;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x5F88;&#x591A;&#x9700;&#x8981;&#x8DE8;&#x9879;&#x76EE;&#x53BB;&#x505A;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x4E5F;&#x4F1A;&#x81EA;&#x7136;&#x800C;&#x7136;&#x60F3;&#x5230;&#x4F60;&#xFF0C;&#x6162;&#x6162;&#x5730;&#xFF0C;&#x4F60;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x66F4;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6210;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x6216;&#x8005;&#x53BB;&#x8F6C;&#x5411;&#x4EA7;&#x54C1;&#xFF0C;&#x8F6C;&#x5411;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x603B;&#x7ED3;&#x7684;&#x4E86;&#x89E3;&#x9879;&#x76EE;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x4F6C;&#x4EEC;&#x591A;&#x591A;&#x7559;&#x8A00;&#x6307;&#x70B9;&#xFF0C;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x3002;</p>
<p> &#x5F80;&#x671F;&#x7CBE;&#x5F69;&#x56DE;&#x987E;</p>
<p> <a href="/external_links/8b8093fede64271cdaa95df8f9edaae8.html" target="blank" rel="noopener">&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x7684;&#x4E09;&#x91CD;&#x5883;&#x754C;</a></p>
<p><a href="/external_links/58ac066605ea8e1ed73abeeb7f342bb7.html" target="blank" rel="noopener">&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;</a></p>
<p><a href="/external_links/b8c07478e3ecf96e3916466e50968d14.html" target="blank" rel="noopener">&#x5173;&#x4E8E;&#x8001;&#x5218;&#x548C;&#x7801;&#x519C;&#x7FFB;&#x8EAB;</a></p>
<p><a href="/external_links/79439955d677ac0557aa6520fb99bcd0.html" target="blank" rel="noopener">&#x6211;&#x662F;&#x4E00;&#x4E2A;Java Class</a></p>
<p><a href="/external_links/9d2d31f5f8a94f8408982872590be840.html" target="blank" rel="noopener">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5723;&#x7ECF;</a></p>
<p><a href="/external_links/9db800eea3f0f67a343acd217acaec07.html" target="blank" rel="noopener">TCP/IP&#x4E4B;&#x5927;&#x660E;&#x90AE;&#x5DEE;</a></p>
<p><a href="/external_links/ea95a10567085b30abbf8ca28bf4d137.html" target="blank" rel="noopener">CPU&#x963F;&#x7518;</a></p>
<p><a href="/external_links/9fe4940bd06d086111fd39af8e90f5bd.html" target="blank" rel="noopener">&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x5361;</a></p>
<p><a href="/external_links/0a97d27664e73a3864e3bd0907e8bf09.html" target="blank" rel="noopener">&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;</a></p>
<p><a href="/external_links/229fdc92e7b1896886aa9727ecbbaa21.html" target="blank" rel="noopener">&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#x8BB2;&#x5B8C;HTTPs</a></p>
<p><a href="/external_links/0bb0c29f3f552dbcf22379134ec28bac.html" target="blank" rel="noopener">&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5DC5;&#x5CF0;</a><br><a href="/external_links/5c9ac89e321ff32c3b11c7178edba650.html" target="blank" rel="noopener">Java&#xFF1A;&#x4E00;&#x4E2A;&#x5E1D;&#x56FD;&#x7684;&#x8BDE;&#x751F;</a></p>
<p><a href="/external_links/3f6edd7818f3691cedde7fa656328f57.html" target="blank" rel="noopener">JavaScript&#xFF1A;&#x4E00;&#x4E2A;&#x5C4C;&#x4E1D;&#x7684;&#x9006;&#x88AD;</a></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/fc2b78af7804a44d76edeb9def895657.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/Java/" rel="tag"># Java</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903759361884168.html" rel="next" title="PostgreSQL构建通用标签系统">
                <i class="fa fa-chevron-left"></i> PostgreSQL构建通用标签系统
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903773890936839.html" rel="prev" title="解决Android Studio版本大于32找不到Andr">
                解决Android Studio版本大于32找不到Andr <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
