<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="游戏,神经网络,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x4F60;&amp;#x6709;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8C61;&amp;#x8FC7;&amp;#x591A;&amp;#x4EBA;&amp;#x6E38;&amp;#x620F;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x5B9E;&amp;#x73B0;&amp;#x7684">
<meta name="keywords" content="游戏,神经网络">
<meta property="og:type" content="article">
<meta property="og:title" content="每个程序员都需要知道一些游戏网络知识">
<meta property="og:url" content="https://dev.newban.cn/6844903519388958728.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x4F60;&amp;#x6709;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8C61;&amp;#x8FC7;&amp;#x591A;&amp;#x4EBA;&amp;#x6E38;&amp;#x620F;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x5B9E;&amp;#x73B0;&amp;#x7684">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/bf2d1873995fe333273fc690a85293911de237286a87e33fc9377df3d2090899">
<meta property="og:updated_time" content="2024-04-28T04:43:50.662Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="每个程序员都需要知道一些游戏网络知识">
<meta name="twitter:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x4F60;&amp;#x6709;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8C61;&amp;#x8FC7;&amp;#x591A;&amp;#x4EBA;&amp;#x6E38;&amp;#x620F;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x5B9E;&amp;#x73B0;&amp;#x7684">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/bf2d1873995fe333273fc690a85293911de237286a87e33fc9377df3d2090899">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903519388958728.html">





  <title>每个程序员都需要知道一些游戏网络知识 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">每个程序员都需要知道一些游戏网络知识</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-06T10:05:09+08:00">
                2017-12-06
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x8FC7;&#x591A;&#x4EBA;&#x6E38;&#x620F;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF1F;</p>
</blockquote>
<p>&#x5728;&#x5916;&#x884C;&#x4EBA;&#x770B;&#x6765;&#x6E38;&#x620F;&#x5F88;&#x795E;&#x5947;&#xFF1A;&#x4E24;&#x4E2A;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x73A9;&#x5BB6;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5206;&#x4EAB;&#x5171;&#x540C;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x5C31;&#x50CF;&#x4ED6;&#x4EEC;&#x771F;&#x5B9E;&#x7684;&#x5B58;&#x5728;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x865A;&#x62DF;&#x7684;&#x4E16;&#x754C;&#x4E00;&#x6837;&#x3002;&#x6E38;&#x620F;&#x770B;&#x8D77;&#x6765;&#x72B9;&#x5982;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x9B54;&#x672F;&#xFF0C;&#x5947;&#x5999;&#x800C;&#x53C8;&#x523A;&#x6FC0;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x771F;&#x5B9E;&#x7684;&#x60C5;&#x51B5;&#x548C;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#x5E76;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x9519;&#x89C9;&#x3002;&#x4F60;&#x611F;&#x53D7;&#x5230;&#x7684;&#x5171;&#x4EAB;&#x73B0;&#x5B9E;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x90A3;&#x4E2A;&#x65F6;&#x523B;&#x5185;&#xFF0C;&#x7531;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x72EC;&#x7279;&#x89C6;&#x89D2;&#x548C;&#x4F4D;&#x7F6E;&#x6240;&#x611F;&#x77E5;&#x7684;&#x8FD1;&#x4F3C;&#x60C5;&#x51B5;&#x3002;  </p>
<h2 id="&#x4E00;&#x3001;Peer-to-Peer-&#x5E27;&#x540C;&#x6B65;"><a href="#&#x4E00;&#x3001;Peer-to-Peer-&#x5E27;&#x540C;&#x6B65;" class="headerlink" title="&#x4E00;&#x3001;Peer-to-Peer &#x5E27;&#x540C;&#x6B65;"></a>&#x4E00;&#x3001;Peer-to-Peer &#x5E27;&#x540C;&#x6B65;</h2><p>&#x6700;&#x521D;&#x7684;&#x6E38;&#x620F;&#x662F;&#x901A;&#x8FC7;peer-to-peer&#x6765;&#x8054;&#x7F51;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x8FC7;&#x7F51;&#x72B6;&#x62D3;&#x6251;&#x7684;&#x7ED3;&#x6784;&#x7684;&#x5F7C;&#x6B64;&#x8FDE;&#x63A5;&#x5E76;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x3002;&#x4F60;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x6A21;&#x578B;&#x5B58;&#x5728;&#x4E8E;RTS&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x57FA;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#x5B83;&#x8FD8;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8BA4;&#x4E3A;&#x6E38;&#x620F;&#x7F51;&#x7EDC;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5904;&#x7406;&#x6E38;&#x620F;&#x4FE1;&#x606F;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x628A;&#x6E38;&#x620F;&#x7684;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x5E76;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x547D;&#x4EE4;&#x6D88;&#x606F;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x6BCF;&#x4E2A;&#x8F6C;&#x6362;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x76F4;&#x63A5;&#x6F14;&#x53D8;&#x4E3A;&#x6E38;&#x620F;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6BD4;&#x5982;:&#x79FB;&#x52A8;&#x5355;&#x4F4D;&#x3001;&#x653B;&#x51FB;&#x7269;&#x4F53;&#x3001;&#x5EFA;&#x9020;&#x5EFA;&#x7B51;&#x3002;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x9700;&#x8981;&#x5728;&#x7EBF;&#x7684;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x673A;&#x5668;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x547D;&#x4EE4;&#x5F00;&#x59CB;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x8FD0;&#x884C;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x547D;&#x4EE4;&#x548C;&#x8F6C;&#x6362;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x9690;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x601D;&#x8DEF;&#x53EF;&#x4EE5;&#x77E5;&#x9053;RTS&#x6E38;&#x620F;&#x7684;&#x7F51;&#x7EDC;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x66F4;&#x591A;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF0C;&#x8BF7;&#x70B9;&#x51FB;:<a href="/external_links/502ef6b3572e8fb3bb7e48ceea87cc20.html" target="blank" rel="noopener">1500 Archers on a 28.8: Network Programming in Age of Empires and Beyond</a>.</p>
<p>&#x8FD9;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x548C;&#x4F18;&#x96C5;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x5B83;&#x4EEC;&#x6709;&#x51E0;&#x4E2A;&#x56E0;&#x7D20;&#x9650;&#x5236;&#x8005;&#x6211;&#x4EEC;&#x3002;</p>
<blockquote>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x6E38;&#x620F;&#x72B6;&#x6001;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#x4E00;&#x81F4;&#x7684;&#x662F;&#x5F02;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4FDD;&#x6301;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x6BCF;&#x4E2A;&#x8F6C;&#x6362;&#x8F93;&#x51FA;&#x90FD;&#x4FDD;&#x6301;&#x76F8;&#x540C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x5728;&#x4E24;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x6709;&#x7565;&#x5FAE;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x65E9;&#x4E00;&#x4E9B;&#x5230;&#x8FBE;&#x5E76;&#x5F00;&#x59CB;&#x4E86;&#x6218;&#x6597;&#xFF0C;&#x7ED3;&#x679C;&#x53CD;&#x8D25;&#x4E3A;&#x80DC;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E;&#x7A0D;&#x5FAE;&#x665A;&#x4E00;&#x4E9B;&#x5230;&#x8FBE;&#x800C;&#x5931;&#x8D25;&#x3002;&#x5C31;&#x50CF;&#x4E00;&#x53EA;&#x8774;&#x8776;&#x6247;&#x52A8;&#x4E86;&#x7FC5;&#x8180;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E16;&#x754C;&#x7684;&#x53E6;&#x4E00;&#x8FB9;&#x5BFC;&#x81F4;&#x4E86;&#x98D3;&#x98CE;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x4E00;&#x4E2A;&#x5FAE;&#x5C0F;&#x7684;&#x533A;&#x522B;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x4E24;&#x8FB9;&#x5B8C;&#x5168;&#x7684;&#x4E0D;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x6E38;&#x620F;&#x7684;&#x6240;&#x6709;&#x73A9;&#x5BB6;&#x8F93;&#x51FA;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x7B49;&#x5230;&#x6240;&#x6709;&#x73A9;&#x5BB6;&#x7684;&#x5F53;&#x524D;&#x56DE;&#x5408;&#x6570;&#x636E;&#x90FD;&#x5230;&#x8FBE;&#x4E4B;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x64AD;&#x653E;&#x8FD9;&#x4E00;&#x56DE;&#x5408;&#x52A8;&#x4F5C;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x90FD;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x6700;&#x9AD8;&#x7684;&#x90A3;&#x4E2A;&#x73A9;&#x5BB6;&#x3002;RTS&#x6E38;&#x620F;&#x901A;&#x5E38;&#x4EE3;&#x8868;&#x6027;&#x5730;&#x901A;&#x8FC7;&#x7ACB;&#x5373;&#x63D0;&#x4F9B;&#x97F3;&#x9891;&#x53CD;&#x9988;&#x4E0E;&#xFF08;&#x6216;&#x662F;&#xFF09;&#x64AD;&#x653E;&#x541F;&#x5531;&#xFF08;&#x8FC7;&#x6E21;&#xFF09;&#x52A8;&#x753B;&#x6765;&#x63A9;&#x76D6;&#x8FD9;&#x6BB5;&#x5EF6;&#x8FDF;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x771F;&#x6B63;&#x5F71;&#x54CD;&#x6E38;&#x620F;&#x7684;&#x52A8;&#x4F5C;&#x8981;&#x5728;&#x8FD9;&#x6BB5;&#x5EF6;&#x8FDF;&#x8FC7;&#x53BB;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x4E2D;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x7684;&#x540C;&#x6B65;&#x662F;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x547D;&#x4EE4;&#x4FE1;&#x606F;&#x6765;&#x540C;&#x6B65;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x6E38;&#x620F;&#x4E2D;&#x73A9;&#x5BB6;&#x72B6;&#x6001;&#x90FD;&#x4E00;&#x81F4;&#xFF0C;&#x9700;&#x8981;&#x6240;&#x6709;&#x7684;&#x73A9;&#x5BB6;&#x90FD;&#x8981;&#x4ECE;&#x76F8;&#x540C;&#x7684;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x6765;&#x5F00;&#x59CB;&#x6E38;&#x620F;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x5FC5;&#x987B;&#x5728;&#x5F00;&#x59CB;&#x6E38;&#x620F;&#x4E4B;&#x524D;&#x5148;&#x52A0;&#x5165;&#x623F;&#x95F4;&#x7136;&#x540E;&#x4E00;&#x8D77;&#x5F00;&#x59CB;&#x6E38;&#x620F;&#xFF0C;&#x5C3D;&#x7BA1;&#x7406;&#x8BBA;&#x4E0A;&#x4E5F;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x8BA9;&#x67D0;&#x4E9B;&#x73A9;&#x5BB6;&#x665A;&#x4E9B;&#x52A0;&#x5165;&#x6E38;&#x620F;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x573A;&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x6E38;&#x620F;&#x4E2D;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#x7684;&#x8D77;&#x59CB;&#x70B9;&#x7684;&#x96BE;&#x5EA6;&#x76F8;&#x5F53;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#x3002;</p>
</blockquote>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x9650;&#x5236;&#x56F0;&#x6270;&#x8005;&#x6211;&#x4EEC;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x8FD8;&#x662F;&#x5F88;&#x9002;&#x5408;RTS&#x6E38;&#x620F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x4E8E;&#x4ECA;&#x5929;&#x7684;&#x6E38;&#x620F;&#x5F53;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x201C;<strong>Command and Conquer</strong>&#x201D;&#x3001;&#x201C;<strong>Age of Empires</strong>&#x201D;&#x4E0E;&#x201C;<strong>Starcraft</strong>&#x201D;&#x7B49;&#x3002;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5728;RTS&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x4E0A;&#x5343;&#x591A;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5355;&#x4F4D;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x72B6;&#x6001;&#x9700;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x6570;&#x636E;&#x91CF;&#x90FD;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x5F88;&#x96BE;&#x7528;&#x6765;&#x5728;&#x73A9;&#x5BB6;&#x4E4B;&#x95F4;&#x4EA4;&#x6362;&#x3002;&#x522B;&#x65E0;&#x9009;&#x62E9;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6E38;&#x620F;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x7684;&#x547D;&#x4EE4;&#x6765;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x5C31;&#x662F; peer-to-peer &#x5E27;&#x540C;&#x6B65;&#x7684;&#x7F51;&#x8DEF;&#x6E38;&#x620F;&#x6A21;&#x578B;&#x7684;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x6280;&#x672F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4ECE;<strong>Doom</strong>, <strong>Quake</strong> &#x4EE5;&#x53CA; <strong>Unreal</strong>&#x7ECF;&#x5178;&#x6E38;&#x620F;&#x4E2D;&#x5F00;&#x59CB;&#x4E00;&#x8D77;&#x89C2;&#x5BDF;&#x52A8;&#x4F5C;&#x6E38;&#x620F;&#x7684;&#x6280;&#x672F;&#x6F14;&#x5316;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#xFF08;c-s&#x67B6;&#x6784;&#xFF09;"><a href="#&#x4E8C;&#x3001;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#xFF08;c-s&#x67B6;&#x6784;&#xFF09;" class="headerlink" title="&#x4E8C;&#x3001;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#xFF08;c/s&#x67B6;&#x6784;&#xFF09;"></a>&#x4E8C;&#x3001;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#xFF08;c/s&#x67B6;&#x6784;&#xFF09;</h2><p>&#x5728;&#x52A8;&#x4F5C;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x4EE5;&#x4E0A;&#x5E27;&#x540C;&#x6B65;&#x7684;&#x9650;&#x5236;&#x5728;<strong>Doom</strong> &#x6E38;&#x620F;&#x4E2D;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x660E;&#x663E;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x5C40;&#x57DF;&#x7F51;&#x4E2D;&#x4F53;&#x9A8C;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x5728;&#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x5B83;&#x4F53;&#x9A8C;&#x592A;&#x7CDF;&#x7CD5;&#x4E86;&#xFF1A;</p>
<blockquote>
<p>&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x732B;&#xFF08;&#x8C03;&#x5236;&#x89E3;&#x8C03;&#x5668;&#xFF09;&#x628A;&#x4E24;&#x4E2A;<strong>Doom</strong> &#x673A;&#x5668;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x6E38;&#x620F;&#x4F1A;&#x5F02;&#x5E38;&#x7F13;&#x6162;&#x3002;&#x8303;&#x56F4;&#x4ECE;&#x65E0;&#x6CD5;&#x6E38;&#x620F;&#xFF08;&#x4F8B;&#x5982;:14.4Kbps PPP &#x8FDE;&#x63A5;)&#x5230;&#x7A0D;&#x5FAE;&#x53EF;&#x4EE5;&#x73A9;(&#x4F8B;&#x5982; &#xFF1A;28.8Kbps &#x732B;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x88AB;SLIP&#x9A71;&#x52A8;&#x538B;&#x7F29;&#x7684;&#x6570;&#x636E;)&#x4E4B;&#x95F4;&#x6E38;&#x620F;&#x8054;&#x673A;&#x90FD;&#x5F02;&#x5E38;&#x7F13;&#x6162;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x65B9;&#x5F0F;&#x53EA;&#x662F;&#x8FB9;&#x9645;&#x6548;&#x7528;&#xFF0C;&#x672C;&#x6587;&#x5C06;&#x4EC5;&#x5173;&#x6CE8;&#x76F4;&#x63A5;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x56E0;&#x4E3A;Doom&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x672C;&#x6765;&#x5C31;&#x662F;&#x53EA;&#x4E3A;&#x5C40;&#x57DF;&#x7F51;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x4E86;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;peer-to-peer &#x5E27;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x3002;&#x6BCF;&#x4E00;&#x56DE;&#x5408;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x7684;&#x8F93;&#x5165;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x6BD4;&#x5982;&#x5173;&#x952E;&#x6309;&#x952E;&#x7B49;&#xFF09;&#x90FD;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x901A;&#x77E5;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x4F55;&#x73A9;&#x5BB6;&#x5728;&#x64AD;&#x653E;&#x8FD9;&#x4E00;&#x5E27;&#x52A8;&#x753B;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5F97;&#x7B49;&#x5230;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x73A9;&#x5BB6;&#x7684;&#x5173;&#x952E;&#x6309;&#x952E;&#x4FE1;&#x606F;&#x90FD;&#x88AB;&#x63A5;&#x6536;&#x5230;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x53BB;&#x6A21;&#x62DF;&#x64AD;&#x653E;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x8F6C;&#x8EAB;&#xFF08;&#x8F6C;&#x6362;&#xFF09;&#xFF0C;&#x79FB;&#x52A8;&#x6216;&#x8005;&#x5C04;&#x51FB;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x5EF6;&#x8FDF;&#x6700;&#x5927;&#x7684;&#x732B;&#xFF08;&#x8C03;&#x5236;&#x8C03;&#x89E3;&#x5668;&#xFF09;&#x73A9;&#x5BB6;&#x7684;&#x8F93;&#x5165;&#x3002;&#x53EA;&#x662F;&#x60F3;&#x60F3;&#x4E0A;&#x8FF0;&#x90A3;&#x4E2A;&#x4EBA;&#x6240;&#x5199;&#x7684;&#x201C;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x65B9;&#x5F0F;&#x53EA;&#x662F;&#x8FB9;&#x9645;&#x6548;&#x7528;&#x201D;&#x5C31;&#x4F1A;&#x8BA9;&#x4EBA;&#x54AC;&#x7259;&#x5207;&#x9F7F;&#x548C;&#x6CAE;&#x4E27;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6539;&#x53D8;&#x8FD9;&#x79CD;&#x73B0;&#x72B6;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x5C40;&#x57DF;&#x7F51;&#x4EE5;&#x53CA;&#x5927;&#x5B66;&#x7F51;&#x7EDC;&#x548C;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x8FDE;&#x63A5;&#x800C;&#x8FDB;&#x884C;&#x6E38;&#x620F;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x6539;&#x53D8;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x4E86;&#x3002;&#x5728;1996&#x5E74;&#xFF0C;&#x8FD9;&#x53D8;&#x6210;&#x4E86;&#x73B0;&#x5B9E;&#x5E76;&#x88AB;&#x5B9E;&#x73B0;&#x4E86;&#xFF0C;John Carmack&#x5F53;&#x65F6; &#x53D1;&#x5E03;&#x96F7;&#x795E;&#x4E4B;&#x9524;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#xFF08;C/S&#xFF09;&#x67B6;&#x6784;&#x4EE3;&#x66FF;&#x4E86;P2P&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5982;&#x4ECA;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x518D;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x53CA;&#x76F4;&#x63A5;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#xFF0C;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x7684;&#x673A;&#x5668;&#x662F;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5BA2;&#x6237;&#x7AEF;&#x201D;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x901A;&#x8FC7;&#x4E00;&#x53F0;&#x53EB;&#x505A;&#x201C;&#x670D;&#x52A1;&#x5668;&#x201D;&#x7684;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4EA4;&#x4E92;&#x3002;&#x6E38;&#x620F;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x786E;&#x5B9A;&#x4E0D;&#x518D;&#x4F9D;&#x8D56;&#x4E8E;&#x6BCF;&#x53F0;&#x5BA2;&#x6237;&#x7AEF;&#x673A;&#x5668;&#x6765;&#x5171;&#x540C;&#x786E;&#x8BA4;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x670D;&#x52A1;&#x5668;&#x6765;&#x786E;&#x5B9A;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x3002;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5982;&#x540C;&#x4E00;&#x4E2A;&#x54D1;&#x7EC8;&#x7AEF;&#xFF0C;&#x7528;&#x6765;&#x5C55;&#x793A;&#x4E00;&#x4E2A;&#x8FD1;&#x4F3C;&#x503C;&#x7684;&#x8868;&#x6F14;&#xFF0C;&#x771F;&#x662F;&#x7684;&#x6E38;&#x620F;&#x72B6;&#x6001;&#x662F;&#x8FD0;&#x884C;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x4E0A;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7EAF;&#x7CB9;&#x7684;c/s&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x5728;&#x672C;&#x5730;&#x8FD0;&#x884C;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x4E00;&#x4E9B;&#x4F8B;&#x5982;&#x6309;&#x952E;&#x3001;&#x9F20;&#x6807;&#x79FB;&#x52A8;&#xFF0C;&#x70B9;&#x51FB;&#x7B49;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x5728;&#x6E38;&#x620F;&#x4E16;&#x754C;&#x4E2D;&#x66F4;&#x65B0;&#x4F60;&#x7684;&#x73A9;&#x5BB6;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5C01;&#x5305;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4F60;&#x89D2;&#x8272;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x4E34;&#x8FD1;&#x73A9;&#x5BB6;&#x6570;&#x636E;&#x7684;&#x5305;&#x56DE;&#x590D;&#x7ED9;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x6BCF;&#x4E2A;&#x6D88;&#x606F;&#x66F4;&#x65B0;&#x7684;&#x95F4;&#x9699;&#x505A;&#x4E00;&#x4E2A;&#x63D2;&#x503C;&#x9884;&#x6D4B;&#xFF0C;&#x4EE5;&#x6539;&#x5584;&#x5728;&#x6BCF;&#x4E2A;&#x72B6;&#x6001;&#x66F4;&#x65B0;&#x671F;&#x95F4;&#xFF0C;&#x7269;&#x4F53;&#x53EF;&#x4EE5;&#x5E73;&#x6ED1;&#x7684;&#x79FB;&#x52A8;&#xFF0C;&#x5982;&#x6B64;&#xFF0C;&#x4F60;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8054;&#x7F51;&#x7684;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x7684;&#x6E38;&#x620F;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x5411;&#x524D;&#x8FC8;&#x51FA;&#x4E86;&#x6781;&#x5927;&#x7684;&#x4E00;&#x6B65;&#x3002;&#x6E38;&#x620F;&#x7684;&#x4F53;&#x9A8C;&#x4F9D;&#x8D56;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6E38;&#x620F;&#x4E2D;&#x5EF6;&#x8FDF;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#x73A9;&#x5BB6;&#x3002;&#x5982;&#x6B64;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x73A9;&#x5BB6;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x81EA;&#x7531;&#x7684;&#x8FDB;&#x5165;&#x548C;&#x9000;&#x51FA;&#xFF0C;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#x964D;&#x4F4E;&#x4E86;&#x5E73;&#x5747;&#x6BCF;&#x4F4D;&#x73A9;&#x5BB6;&#x7684;&#x5E26;&#x5BBD;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5728;&#x7EBF;&#x73A9;&#x5BB6;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x4ECD;&#x7136;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x5B58;&#x5728;&#x4E8E; c/s &#x67B6;&#x6784;&#x4E2D;:</p>
<blockquote>
<p>&#x6211;&#x8BB0;&#x5F97;&#x6211;&#x4EA4;&#x4EE3;&#x4E86;&#x6240;&#x6709;&#x4ECE;DOO&#x5230;Quake&#x4E2D;&#x5173;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x4F46;&#x662F;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6211;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x9519;&#x8BEF;&#x7684;&#x5047;&#x8BBE;&#x6765;&#x505A;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#x3002;&#x6211;&#x539F;&#x5148;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&lt;200&#xFF4D;s&#x3002;&#x4EBA;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7F51;&#x7EDC;&#x4F9B;&#x5E94;&#x5546;&#x8FDE;&#x63A5;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x6E38;&#x620F;&#x4F53;&#x9A8C;&#x3002;&#x4F46;&#x4E8B;&#x4E0E;&#x613F;&#x8FDD;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;99%&#x7684;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x732B;(&#x8C03;&#x5236;&#x8C03;&#x89E3;&#x5668;)&#x901A;&#x8FC7; slip&#x6216;&#x8005;ppp &#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#xFF0C;&#x800C;&#x4ED6;&#x4EEC;&#x5E38;&#x5E38;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x69FD;&#x7CD5;&#x800C;&#x53C8;&#x62E5;&#x6324;&#x7684;ISP&#x3002;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x6700;&#x4F4E;300+ms &#x7684; &#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x3002;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x8981;&#x7ECF;&#x8FC7;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&gt;&#x7528;&#x6237;&#x732B;&gt;ISP&#x732B;&gt;&#x670D;&#x52A1;&#x5668;&gt;ISP&#x732B;&gt;&#x7528;&#x6237;&#x732B;&gt;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x4E0A;&#x5E1D;&#xFF0C;&#x8FD9;&#x592A;&#x900A;&#x4E86;&#x3002;</p>
<p>OK,&#x6211;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x8BBE;&#x5B9A;&#x3002;&#x6211;&#x5728;&#x5BB6;&#x91CC;&#x4F7F;&#x7528;T1 &#x5BBD;&#x5E26;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x53EA;&#x662F;&#x4E0D;&#x4E86;&#x89E3;&#x5728;PPP&#x7F51;&#x7EDC;&#x4E0B;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x6211;&#x73B0;&#x5728;&#x5C31;&#x89E3;&#x51B3;&#x5B83;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F53;&#x7136;&#x662F;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;John&#x5728;&#x4ED6;&#x53D1;&#x5E03;QuakeWorld&#x7684;&#x65F6;&#x5019;&#x5C06;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#xFF08;Client-Side-Prediction&#xFF09;"><a href="#&#x4E09;&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#xFF08;Client-Side-Prediction&#xFF09;" class="headerlink" title="&#x4E09;&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#xFF08;Client-Side Prediction&#xFF09;"></a>&#x4E09;&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#xFF08;Client-Side Prediction&#xFF09;</h2><p>&#x5728;&#x539F;&#x6765;&#x7684;Quake&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x611F;&#x89C9;&#x5230;&#x7535;&#x8111;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x6309;&#x952E;&#x5411;&#x524D;&#x79FB;&#x52A8;&#xFF0C;&#x5728;&#x4F60;&#x771F;&#x6B63;&#x79FB;&#x52A8;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7B49;&#x5230;&#x6570;&#x636E;&#x5305;&#x53D1;&#x9001;&#x670D;&#x52A1;&#x5668;&#x7136;&#x540E;&#x518D;&#x56DE;&#x590D;&#x5230;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4F60;&#x624D;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x7684;&#x79FB;&#x52A8;&#x3002;&#x6309;&#x952E;&#x5F00;&#x706B;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x5C04;&#x51FB;&#x4E4B;&#x524D;&#x540C;&#x6837;&#x9700;&#x8981;&#x76F8;&#x540C;&#x7684;&#x7B49;&#x5F85;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x73A9;&#x8FC7;&#x4EFB;&#x4F55;FPS&#x6E38;&#x620F;&#xFF0C;&#x6BD4;&#x5982;:Modern Warfar,&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x5EF6;&#x8FDF;&#x53D1;&#x751F;&#x3002;&#x90A3;&#x4E48;fps&#x6E38;&#x620F;&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x5728;&#x591A;&#x4EBA;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x7684;&#x52A8;&#x4F5C;&#x770B;&#x8D77;&#x6765;&#x5E76;&#x6CA1;&#x6709;&#x5EF6;&#x8FDF;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x88AB;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x79FB;&#x52A8;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x4E8B;John Carmack &#x4E3A; QuakeWorld&#x6E38;&#x620F;&#x591A;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x88AB;&#x5408;&#x5E76;&#x5230;&#x4E86;Tim Sweeney&#x7684;&#x865A;&#x5E7B;&#x7F51;&#x7EDC;&#x6A21;&#x5757;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x5EF6;&#x8FDF;&#x8865;&#x507F;&#xFF0C;&#x5B83;&#x662F;&#x6709;Valve&#x516C;&#x53F8;&#x7684;Yahn Bernier&#x5728;Counterstrike&#x6240;&#x5F00;&#x53D1;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x7AE0;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7126;&#x70B9;&#x653E;&#x5728;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x2014;&#x2014;&#x9690;&#x85CF;&#x7528;&#x6237;&#x79FB;&#x52A8;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x5F53;&#x5199;&#x5230;&#x5173;&#x4E8E;&#x4ED6;&#x5373;&#x5C06;&#x53D1;&#x5E03;&#x7684;QuakeWorld&#x8BA1;&#x5212;&#x7684;&#x65F6;&#x5019;&#xFF0C;John Carmack &#x8BB2;&#x5230;:</p>
<blockquote>
<p>&#x6211;&#x73B0;&#x5728;&#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x7528;&#x6237;&#x7684;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6743;&#x5A01;&#x4FE1;&#x606F;&#x56DE;&#x590D;&#x4E4B;&#x524D;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x7ED3;&#x6784;&#x53D8;&#x66F4;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x786C;&#x5EA6;&#x3001;&#x6469;&#x64E6;&#x529B;&#x3001;&#x91CD;&#x529B;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x57FA;&#x7840;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x5F88;&#x4F24;&#x5FC3;&#x7684;&#x770B;&#x5230;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4EC5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;&#x5B58;&#x5728;&#x5C06;&#x4F1A;&#x79BB;&#x5F00;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8D85;&#x8D8A;&#x8FD9;&#x79CD;&#x7406;&#x60F3;&#x60C5;&#x6000;&#x3002;</p>
</blockquote>
<p>&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x6D88;&#x9664;&#x5EF6;&#x8FDF;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5B83;&#x73B0;&#x5728;&#x4E0D;&#x518D;&#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x628A;&#x8F93;&#x5165;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x7136;&#x540E;&#x518D;&#x628A;&#x8FD4;&#x56DE;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x7684;&#x54D1;&#x7EC8;&#x7AEF;&#x3002;&#x73B0;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x90E8;&#x5206;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x9884;&#x6D4B;&#x4F60;&#x7684;&#x89D2;&#x8272;&#x79FB;&#x52A8;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5373;&#x65F6;&#x54CD;&#x5E94;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5F53;&#x4F60;&#x5373;&#x523B;&#x6309;&#x952E;&#x5411;&#x524D;&#xFF0C;&#x4F60;&#x7684;&#x6E38;&#x620F;&#x4F1A;&#x7ACB;&#x523B;&#x5411;&#x524D;&#x79FB;&#x52A8;&#xFF0C;&#x4E0D;&#x4F1A;&#x518D;&#x53BB;&#x7B49;&#x5F85;&#x6570;&#x636E;&#x5F80;&#x8FD4;&#x4E00;&#x6B21;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x624D;&#x6765;&#x56DE;&#x5E94;&#x4F60;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x96BE;&#x70B9;&#x4E0D;&#x5728;&#x4E8E;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x79CD;&#x9884;&#x6D4B;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x50CF;&#x6B63;&#x5E38;&#x7684;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#x4E00;&#x6837; &#x2014;&#x2014; &#x6839;&#x636E;&#x73A9;&#x5BB6;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x53CA;&#x65F6;&#x5730;&#x66F4;&#x65B0;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x7684;&#x72B6;&#x6001;&#x3002;&#x800C;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x5BF9;&#x4E8E;&#x73A9;&#x5BB6;&#x89D2;&#x8272;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF08;&#x52A8;&#x4F5C;&#xFF09;&#x6838;&#x68C0;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5982;&#x4F55;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x66F4;&#x6B63;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x4F1A;&#x60F3;&#xFF0C;hey&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x2014;&#x2014;&#x4E3A;&#x4F55;&#x4E0D;&#x4EE5;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4FE1;&#x606F;&#x4E3A;&#x51C6;&#xFF1F;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x7684;&#x4E3A;&#x89D2;&#x8272;&#x6A21;&#x62DF;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x6B21;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#x65F6;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x544A;&#x8BC9;&#x670D;&#x52A1;&#x5668;&#x201C;&#x8FD9;&#x662F;&#x6211;&#x73B0;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x5E26;&#x6765;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x5E76;&#x63A7;&#x5236;&#xFF0C;&#x8FD9;&#x6837;&#x5728;RPG&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x5F0A;&#x4FBF;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x8EB2;&#x907F;&#x5BF9;&#x65B9;&#x6280;&#x80FD;&#x51FB;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x4F60;&#x5C04;&#x51FB;&#x7684;&#x65F6;&#x5019;&#x77AC;&#x95F4;&#x79FB;&#x52A8;&#x5230;&#x4F60;&#x7684;&#x8EAB;&#x540E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;FPS&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x5C3D;&#x5FEB;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x89D2;&#x8272;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x7684;&#x89D2;&#x8272;&#x72B6;&#x6001;&#x7EDD;&#x5BF9;&#x4EE5;&#x670D;&#x52A1;&#x5668;&#x4E3A;&#x51C6;&#x3002;&#x5C31;&#x50CF;Tim Sweeney &#x5728;&#x6240;&#x5199;&#x7684;&#x6587;&#x7AE0;<a href="/external_links/bd41199706c5d602ab5918a1ee81e0d9.html" target="blank" rel="noopener">The Unreal Networking Architecture</a>&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x6837;&#xFF1A;&#x201C;&#x670D;&#x52A1;&#x5668;&#x624D;&#x662F;&#x4E3B;&#x4EBA;&#x201D;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6709;&#x8DA3;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4EA7;&#x751F;&#x4E86;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4FE1;&#x606F;&#x4E3A;&#x51C6;&#x5E76;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#x6709;&#x5EF6;&#x8FDF;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4FEE;&#x6B63;&#x5FC5;&#x7136;&#x662F;&#x8FC7;&#x53BB;&#x7684;&#x52A8;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4FE1;&#x606F;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8017;&#x65F6;100ms&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x53C8;&#x8017;&#x65F6;100ms&#xFF0C;&#x90A3;&#x4E48;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7684;&#x4FEE;&#x6B63;&#x90FD;&#x662F;&#x5BA2;&#x6237;&#x7AEF;200ms&#x4E4B;&#x524D;&#x7684;&#x884C;&#x4E3A;&#x52A8;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6B63;&#x597D;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#x89D2;&#x8272;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x6BCF;&#x4E2A;&#x52A8;&#x4F5C;&#x90FD;&#x4F1A;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x4FEE;&#x6B63;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C06;&#x4F1A;&#x770B;&#x5BA2;&#x6237;&#x7AEF;&#x88AB;&#x62C9;&#x56DE;&#x4E86;&#x539F;&#x5148;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x6B64;&#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x505A;&#x4E0D;&#x4E86;&#x4EFB;&#x4F55;&#x9884;&#x5148;&#x9884;&#x6D4B;&#x7684;&#x8FD0;&#x7B97;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x524D;&#x9884;&#x6D4B;&#xFF1F;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;buffer&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6765;&#x5FAA;&#x73AF;&#x4FDD;&#x6301;&#x89D2;&#x8272;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x672C;&#x6765;&#x73A9;&#x5BB6;&#x7684;&#x8F93;&#x5165;&#x3002;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x6536;&#x5230;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x7684;&#x66F4;&#x6B63;&#x4FE1;&#x606F;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x4E22;&#x5F03;&#x6389;buffer&#x91CC;&#x9762;&#x6BD4;&#xFF08;&#x670D;&#x52A1;&#x5668;&#x56DE;&#x590D;&#x7684;&#xFF09;&#x66F4;&#x6B63;&#x72B6;&#x6001;&#x8981;&#x8001;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#xFF08;&#x66F4;&#x6B63;&#x7684;&#xFF09;&#x6B63;&#x786E;&#x7684;&#x72B6;&#x6001;&#x91CD;&#x653E;&#x5B58;&#x50A8;&#x5728;buffer&#x91CC;&#x9762;&#x7684;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#xFF0C;&#x91CD;&#x53D1;&#x7684;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x7684;&#x8303;&#x56F4;&#x662F;&#x4ECE;&#x6B63;&#x786E;&#x72B6;&#x6001;&#x5230;&#x5F53;&#x524D;&#x9884;&#x6D4B;&#x65F6;&#x95F4;&#x4E4B;&#x95F4;&#x3002;&#x5982;&#x6B64;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x53EA;&#x662F;&#x770B;&#x4F3C;&#x65E0;&#x5F62;&#x4E2D;&#x201C;&#x5012;&#x5E26;&#x548C;&#x91CD;&#x653E;&#x201D;&#x5F53;&#x5730;&#x73A9;&#x5BB6;&#x89D2;&#x8272;&#x8FD0;&#x52A8;&#x7684;&#x6700;&#x540E;n&#x5E27;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x4E16;&#x754C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8BA9;&#x73A9;&#x5BB6;&#x611F;&#x89C9;&#x5728;&#x63A7;&#x5236;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x5EF6;&#x8FDF;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6539;&#x5584;&#x4E86;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x2014;&#x2014;&#x5728;&#x540C;&#x7B49;&#x8F93;&#x5165;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4FEE;&#x6B63;&#x7684;&#x60C5;&#x51B5;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#xFF0C;Tim Sweeney &#x5982;&#x6B64;&#x63CF;&#x8FF0;:</p>
<blockquote>
<p>&#x2026;&#x5BF9;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x6700;&#x597D;&#x7684;&#x662F;&#xFF1A;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x662F;&#x6743;&#x5A01;&#x7684;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x62DF;&#x7684;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E00;&#x81F4;&#xFF0C;&#x6240;&#x4EE5;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4F4D;&#x7F6E;&#x5F88;&#x5C11;&#x88AB;&#x4FEE;&#x6B63;&#x3002;&#x53EA;&#x6709;&#x7684;&#x5C11;&#x6570;&#x7F55;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x88AB;&#x706B;&#x7BAD;&#x51FB;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x548C;&#x4E00;&#x4E2A;&#x654C;&#x4EBA;&#xFF08;&#x602A;&#x7269;&#xFF09;&#x78B0;&#x649E;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x5BA2;&#x6237;&#x7AEF;&#x672C;&#x5730;&#x7684;&#x60C5;&#x51B5;&#x6709;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x88AB;&#x4FEE;&#x6B63;&#x3002;</p>
</blockquote>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x73A9;&#x5BB6;&#x7684;&#x89D2;&#x8272;&#x88AB;&#x4E00;&#x4E9B;&#x5916;&#x90E8;&#x4E8B;&#x4EF6;&#x5F71;&#x54CD;&#x73A9;&#x5BB6;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x4E0D;&#x80FD;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x6D4B;&#x65F6;&#xFF0C;&#x73A9;&#x5BB6;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x884C;&#x4E3A;&#xFF09;&#x9700;&#x8981;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x4FEE;&#x6B63;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x73A9;&#x5BB6;&#x8BD5;&#x56FE;&#x4F5C;&#x5F0A;&#xFF0C;&#x5FC5;&#x7136;&#x4F1A;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x4FEE;&#x6B63;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x7FFB;&#x8BD1;&#x6587;&#x7AE0;&#xFF0C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x6E38;&#x620F;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x8BA1;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x90FD;&#x6709;&#x8BB2;&#x89E3;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x82F1;&#x6587;&#x66F4;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x6587;&#x7AE0;&#x5C3E;&#x90E8;&#x94FE;&#x63A5;&#xFF0C;&#x4F60;&#x82E5;&#x662F;&#x89C9;&#x5F97;&#x6709;&#x7FFB;&#x8BD1;&#x4E0D;&#x59A5;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6B22;&#x8FCE;&#x7559;&#x8A00;&#x6307;&#x6B63;&#x3002;&#x539F;&#x6587;&#x5730;&#x5740;:<a href="/external_links/b7e6ced560d0f1a9fc55995ac6e517f8.html" target="blank" rel="noopener">&#x70B9;&#x6B64;&#x770B;&#x539F;&#x6587;</a></p>
</blockquote>
<hr>
<p>&#x66F4;&#x65B0;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x4E13;&#x9898;&#x8BF7;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x516C;&#x4F17;&#x53F7;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/bf2d1873995fe333273fc690a85293911de237286a87e33fc9377df3d2090899" alt></p>
<p>&#x5927;&#x7801;&#x5019;&#xFF0C;&#x5173;&#x6CE8;&#x4E2A;&#x4EBA;&#x6210;&#x957F;&#x548C;&#x6E38;&#x620F;&#x7814;&#x53D1;&#xFF0C;&#x81F4;&#x529B;&#x4E8E;&#x63A8;&#x8FDB;&#x56FD;&#x5185;&#x6E38;&#x620F;&#x6280;&#x672F;&#x793E;&#x533A;&#x7684;&#x8FDB;&#x6B65;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/58cdb7637513622f5d92dabeb95a7977.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/游戏-神经网络/" rel="tag"># 游戏,神经网络</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903519367987214.html" rel="next" title="如何处理Express异常？">
                <i class="fa fa-chevron-left"></i> 如何处理Express异常？
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903519393153038.html" rel="prev" title="中小型研发团队架构实践：任务调度Job">
                中小型研发团队架构实践：任务调度Job <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#一、Peer-to-Peer-帧同步"><span class="nav-number">1.</span> <span class="nav-text">一、Peer-to-Peer 帧同步</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#二、客户端-服务器（c-s架构）"><span class="nav-number">2.</span> <span class="nav-text">二、客户端/服务器（c/s架构）</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#三、客户端预测（Client-Side-Prediction）"><span class="nav-number">3.</span> <span class="nav-text">三、客户端预测（Client-Side Prediction）</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
