<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="Google,设计,服务器,API,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x6982;&amp;#x8FF0;&amp;#x5F53;&amp;#x4EE3;&amp;#x7684;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x670D;&amp;#x52A1;&amp;#xFF0C;&amp;#x901A;&amp;#x5E38;&amp;#x90FD;&amp;#x662F;&amp;#x7528;&amp;#x590D;&amp;#x6742;&amp;#x7684;&amp;#x3001;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x5206;">
<meta name="keywords" content="Google,设计,服务器,API">
<meta property="og:type" content="article">
<meta property="og:title" content="Dapper，大规模分布式系统的跟踪系统">
<meta property="og:url" content="https://dev.newban.cn/6844903511948263432.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x6982;&amp;#x8FF0;&amp;#x5F53;&amp;#x4EE3;&amp;#x7684;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x670D;&amp;#x52A1;&amp;#xFF0C;&amp;#x901A;&amp;#x5E38;&amp;#x90FD;&amp;#x662F;&amp;#x7528;&amp;#x590D;&amp;#x6742;&amp;#x7684;&amp;#x3001;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x5206;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/febc025f5553536cbd8daf71a5b4eeab67db524a1823b0ad35d31146f633026d">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5fc9e347e027902f09c1488aaba2f63757dccb6378beaa241367fb8b513e07e5">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/684789cdfc6637476119f9174715f6bc3bcbeeb792f1d9a1ad57cf4bcf10bfc9">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/9781a3d7333389b02d733973aeb859ac02143f94a25aa7677a9c76e337dcf5ff">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/c2c9523198450649e8d7f93445a87c314004f76c26b711919b090814d1a03ef7">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/d1a5bd8951b6daa36b80e81dc0289b78ebfb2bcac72db97bf428b920907e09b4">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/33ddb5e57348f6b9cc4df9ef8e78b752be0271737b41bf05db7bd02c04690051">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/b41f70334c63d7764d52713e71c0283b177041bc3188df7f80593b06a12ef09c">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/2778619cec249147376e1af27fdd4f6a5807445294e4b8ff40adf61d52b69d0d">
<meta property="og:updated_time" content="2024-04-28T05:28:25.563Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Dapper，大规模分布式系统的跟踪系统">
<meta name="twitter:description" content="&amp;#x6982;&amp;#x8FF0;&amp;#x5F53;&amp;#x4EE3;&amp;#x7684;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x670D;&amp;#x52A1;&amp;#xFF0C;&amp;#x901A;&amp;#x5E38;&amp;#x90FD;&amp;#x662F;&amp;#x7528;&amp;#x590D;&amp;#x6742;&amp;#x7684;&amp;#x3001;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x5206;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/febc025f5553536cbd8daf71a5b4eeab67db524a1823b0ad35d31146f633026d">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903511948263432.html">





  <title>Dapper，大规模分布式系统的跟踪系统 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">Dapper，大规模分布式系统的跟踪系统</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-11-20T14:12:20+08:00">
                2017-11-20
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="&#x6982;&#x8FF0;"><a href="#&#x6982;&#x8FF0;" class="headerlink" title="&#x6982;&#x8FF0;"></a>&#x6982;&#x8FF0;</h3><p>&#x5F53;&#x4EE3;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x7528;&#x590D;&#x6742;&#x7684;&#x3001;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x96C6;&#x7FA4;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x6784;&#x5EFA;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x6A21;&#x5757;&#x96C6;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x6A21;&#x5757;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x3001;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x5B9E;&#x73B0;&#x3001;&#x6709;&#x53EF;&#x80FD;&#x5E03;&#x5728;&#x4E86;&#x51E0;&#x5343;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6A2A;&#x8DE8;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x3001;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>Dapper&#x2013;Google&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#x7684;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x6EE1;&#x8DB3;&#x4E00;&#x4E2A;&#x4F4E;&#x635F;&#x8017;&#x3001;&#x5E94;&#x7528;&#x900F;&#x660E;&#x7684;&#x3001;&#x5927;&#x8303;&#x56F4;&#x90E8;&#x7F72;&#x8FD9;&#x4E09;&#x4E2A;&#x9700;&#x6C42;&#x7684;&#x3002;&#x5F53;&#x7136;Dapper&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#xFF0C;&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x5C24;&#x5176;&#x662F;Magpie&#x548C;X-Trace&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x6210;&#x529F;&#x5E94;&#x7528;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0A;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x753B;&#x9F99;&#x70B9;&#x775B;&#x4E4B;&#x7B14;&#xFF0C;&#x4F8B;&#x5982;&#x91C7;&#x6837;&#x7387;&#x7684;&#x4F7F;&#x7528;&#x4EE5;&#x53CA;&#x628A;&#x4EE3;&#x7801;&#x690D;&#x5165;&#x9650;&#x5236;&#x5728;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x516C;&#x5171;&#x5E93;&#x7684;&#x6539;&#x9020;&#x4E0A;&#x3002;</p>
<p>&#x81EA;&#x4ECE;Dapper&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x4E00;&#x6D41;&#x7684;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#xFF0C;&#x7ED9;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x8FD0;&#x7EF4;&#x56E2;&#x961F;&#x5E2E;&#x4E86;&#x5927;&#x5FD9;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x624D;&#x53D1;&#x8868;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x6765;&#x6C47;&#x62A5;&#x4E00;&#x4E0B;&#x8FD9;&#x4E24;&#x5E74;&#x6765;&#xFF0C;Dapper&#x662F;&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x7684;&#x3002;Dapper&#x6700;&#x521D;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x81EA;&#x7ED9;&#x81EA;&#x8DB3;&#x7684;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#x8D77;&#x6B65;&#x7684;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x8FDB;&#x5316;&#x6210;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x4E2A;&#x76D1;&#x63A7;&#x5E73;&#x53F0;&#x4FC3;&#x751F;&#x51FA;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x7531;Dapper&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x7684;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;Dapper&#x642D;&#x5EFA;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x5728;google&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x5C55;&#x73B0;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x6700;&#x540E;&#x4F1A;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x4ECE;Dapper&#x6536;&#x83B7;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;</p>
<h3 id="1-&#x4ECB;&#x7ECD;"><a href="#1-&#x4ECB;&#x7ECD;" class="headerlink" title="1. &#x4ECB;&#x7ECD;"></a>1. &#x4ECB;&#x7ECD;</h3><p>&#x6211;&#x4EEC;&#x5F00;&#x53D1;Dapper&#x662F;&#x4E3A;&#x4E86;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x590D;&#x6742;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x5448;&#x73B0;&#x7ED9;Google&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E9B;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x4F4E;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x7ECF;&#x6D4E;&#x5212;&#x7B97;&#x7684;&#x5E73;&#x53F0;&#x3002;&#x60F3;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7406;&#x89E3;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x90A3;&#x4E9B;&#x6A2A;&#x8DE8;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x3001;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x52A8;&#x4F5C;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4E3E;&#x4E00;&#x4E2A;&#x8DDF;&#x641C;&#x7D22;&#x76F8;&#x5173;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x9610;&#x8FF0;&#x4E86;Dapper&#x53EF;&#x4EE5;&#x5E94;&#x5BF9;&#x54EA;&#x4E9B;&#x6311;&#x6218;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x524D;&#x6BB5;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x5BF9;&#x4E0A;&#x767E;&#x53F0;&#x67E5;&#x8BE2;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;&#x4E86;&#x4E00;&#x4E2A;Web&#x67E5;&#x8BE2;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;Index&#x3002;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x591A;&#x4E2A;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B50;&#x7CFB;&#x7EDF;&#x5206;&#x522B;&#x7528;&#x6765;&#x5904;&#x7406;&#x5E7F;&#x544A;&#x3001;&#x8FDB;&#x884C;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#x6216;&#x662F;&#x67E5;&#x627E;&#x4E00;&#x4E9B;&#x50CF;&#x56FE;&#x7247;&#x3001;&#x89C6;&#x9891;&#x6216;&#x65B0;&#x95FB;&#x8FD9;&#x6837;&#x7684;&#x7279;&#x6B8A;&#x7ED3;&#x679C;&#x3002;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x7B5B;&#x9009;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x540E;&#x6C47;&#x603B;&#x5230;&#x9875;&#x9762;&#x4E0A;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x641C;&#x7D22;&#x6A21;&#x578B;&#x79F0;&#x4E3A;&#x201C;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x201D;&#xFF08;universal search&#xFF09;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x6709;&#x53EF;&#x80FD;&#x8C03;&#x7528;&#x4E0A;&#x5343;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6D89;&#x53CA;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x7528;&#x6237;&#x5BF9;&#x641C;&#x7D22;&#x7684;&#x8017;&#x65F6;&#x662F;&#x5F88;&#x654F;&#x611F;&#x7684;&#xFF0C;&#x800C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x4F4E;&#x6548;&#x90FD;&#x5BFC;&#x81F4;&#x5BFC;&#x81F4;&#x6700;&#x7EC8;&#x7684;&#x641C;&#x7D22;&#x8017;&#x65F6;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x53EA;&#x80FD;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x8017;&#x65F6;&#x4E0D;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x65E0;&#x4ECE;&#x77E5;&#x6653;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5230;&#x5E95;&#x662F;&#x7531;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x6027;&#x80FD;&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x51C6;&#x786E;&#x7684;&#x5B9A;&#x4F4D;&#x5230;&#x8FD9;&#x6B21;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x662F;&#x8C03;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x3001;&#x4E43;&#x81F3;&#x670D;&#x52A1;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x7247;&#x6BB5;&#xFF0C;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x4E0A;&#x8FC7;&#x7EBF;&#x6216;&#x4FEE;&#x6539;&#x8FC7;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x9762;&#x5411;&#x7528;&#x6237;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E9B;&#x4F8B;&#x5982;&#x9488;&#x5BF9;&#x6027;&#x80FD;&#x6216;&#x5B89;&#x5168;&#x8BA4;&#x8BC1;&#x65B9;&#x9762;&#x7684;&#x529F;&#x80FD;&#x6539;&#x8FDB;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x82DB;&#x6C42;&#x8FD9;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8FD9;&#x6B21;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x7684;&#x670D;&#x52A1;&#x90FD;&#x4E86;&#x5982;&#x6307;&#x638C;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x6216;&#x7EF4;&#x62A4;&#x7684;&#x3002;&#x518D;&#x6B21;&#xFF0C;&#x8FD9;&#x4E9B;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x7684;&#x670D;&#x52A1;&#x6216;&#x670D;&#x52A1;&#x5668;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x8FD8;&#x88AB;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x7740;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6B21;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x751A;&#x81F3;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x9020;&#x6210;&#x7684;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x8981;&#x5E94;&#x4ED8;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;Bigtable&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x6B63;&#x88AB;&#x53CD;&#x590D;&#x8BFB;&#x5199;&#x7740;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x9762;&#x8DD1;&#x7740;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5BF9;Dapper&#x6211;&#x4EEC;&#x53EA;&#x6709;&#x4E24;&#x70B9;&#x8981;&#x6C42;&#xFF1A;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x7684;&#x90E8;&#x7F72;&#xFF0C;&#x6301;&#x7EED;&#x7684;&#x76D1;&#x63A7;&#x3002;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E0D;&#x8A00;&#x800C;&#x55BB;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4F7F;&#x7528;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x7684;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#x65F6;&#xFF0C;&#x5373;&#x4FBF;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x6CA1;&#x88AB;&#x76D1;&#x63A7;&#x5230;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x4E0D;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x4EFB;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x8D28;&#x7591;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x76D1;&#x63A7;&#x5E94;&#x8BE5;&#x662F;7x24&#x5C0F;&#x65F6;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#xFF0C;&#x7CFB;&#x7EDF;&#x5F02;&#x5E38;&#x6216;&#x662F;&#x90A3;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8FC7;&#x4E00;&#x6B21;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x751A;&#x81F3;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x91CD;&#x73B0;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E24;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x63A8;&#x51FA;&#x4E09;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF1A;</p>
<p>1.&#x4F4E;&#x6D88;&#x8017;&#xFF1A;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x5BF9;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x7684;&#x5F71;&#x54CD;&#x5E94;&#x8BE5;&#x505A;&#x5230;&#x8DB3;&#x591F;&#x5C0F;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x8FC7;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5373;&#x4F7F;&#x4E00;&#x70B9;&#x70B9;&#x635F;&#x8017;&#x4E5F;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x5BDF;&#x89C9;&#x5230;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x53EF;&#x80FD;&#x8FEB;&#x4F7F;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x7684;&#x90E8;&#x7F72;&#x56E2;&#x961F;&#x4E0D;&#x5F97;&#x4E0D;&#x5C06;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x5173;&#x505C;&#x3002;</p>
<p>2.&#x5E94;&#x7528;&#x7EA7;&#x7684;&#x900F;&#x660E;&#xFF1A;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6709;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x8FD9;&#x56DE;&#x4E8B;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x60F3;&#x751F;&#x6548;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E3B;&#x52A8;&#x914D;&#x5408;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x4E5F;&#x592A;&#x8106;&#x5F31;&#x4E86;&#xFF0C;&#x5F80;&#x5F80;&#x7531;&#x4E8E;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x690D;&#x5165;&#x4EE3;&#x7801;&#x7684;bug&#x6216;&#x758F;&#x5FFD;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x662F;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x5BF9;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x7684;&#x90E8;&#x7F72;&#x201D;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x3002;&#x9762;&#x5BF9;&#x5F53;&#x4E0B;&#x60F3;Google&#x8FD9;&#x6837;&#x7684;&#x5FEB;&#x8282;&#x594F;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x6765;&#x8BF4;&#xFF0C;&#x5C24;&#x5176;&#x91CD;&#x8981;&#x3002;</p>
<p>3.&#x5EF6;&#x5C55;&#x6027;&#xFF1A;Google&#x81F3;&#x5C11;&#x5728;&#x672A;&#x6765;&#x51E0;&#x5E74;&#x7684;&#x670D;&#x52A1;&#x548C;&#x96C6;&#x7FA4;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x90FD;&#x5E94;&#x8BE5;&#x80FD;&#x5B8C;&#x5168;&#x628A;&#x63A7;&#x4F4F;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x4E3A;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x4E4B;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x7684;&#x901F;&#x5EA6;&#x8981;&#x5FEB;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x662F;&#x6570;&#x636E;&#x5B58;&#x5165;&#x8DDF;&#x8E2A;&#x4ED3;&#x5E93;&#x540E;&#x4E00;&#x5206;&#x949F;&#x5185;&#x5C31;&#x80FD;&#x7EDF;&#x8BA1;&#x51FA;&#x6765;&#x3002;&#x5C3D;&#x7BA1;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E00;&#x5C0F;&#x65F6;&#x524D;&#x7684;&#x65E7;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDF;&#x8BA1;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x6709;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x80FD;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x4FE1;&#x606F;&#x53CD;&#x9988;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x5F02;&#x5E38;&#x72B6;&#x51B5;&#x505A;&#x51FA;&#x5FEB;&#x901F;&#x53CD;&#x5E94;&#x3002;</p>
<p>&#x505A;&#x5230;&#x771F;&#x6B63;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x522B;&#x7684;&#x900F;&#x660E;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x5F53;&#x4E0B;&#x9762;&#x4E34;&#x7684;&#x6700;&#x6311;&#x6218;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6838;&#x5FC3;&#x8DDF;&#x8E2A;&#x4EE3;&#x7801;&#x505A;&#x7684;&#x5F88;&#x8F7B;&#x5DE7;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x690D;&#x5165;&#x5230;&#x90A3;&#x4E9B;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x7684;&#x516C;&#x5171;&#x7EC4;&#x4EF6;&#x79CD;&#xFF0C;&#x6BD4;&#x5982;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x4EE5;&#x53CA;RPC&#x5E93;&#x3002;&#x4F7F;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x91C7;&#x6837;&#x7387;&#x53EF;&#x4EE5;&#x4F7F;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x53EF;&#x4F38;&#x7F29;&#xFF0C;&#x5E76;&#x964D;&#x4F4E;&#x6027;&#x80FD;&#x635F;&#x8017;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5C06;&#x5728;&#x7B2C;4.4&#x8282;&#x4E2D;&#x63D0;&#x53CA;&#x3002;&#x7ED3;&#x679C;&#x5C55;&#x793A;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x7EDF;&#x4E5F;&#x9700;&#x8981;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x7528;&#x6765;&#x6536;&#x96C6;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7528;&#x6765;&#x56FE;&#x5F62;&#x5316;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x6765;&#x5206;&#x6790;&#x5927;&#x89C4;&#x6A21;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x5E93;&#x548C;API&#x3002;&#x867D;&#x7136;&#x5355;&#x72EC;&#x4F7F;&#x7528;Dapper&#x6709;&#x65F6;&#x5C31;&#x8DB3;&#x591F;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x67E5;&#x660E;&#x5F02;&#x5E38;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x4F46;&#x662F;Dapper&#x7684;&#x521D;&#x8877;&#x4E0D;&#x662F;&#x8981;&#x53D6;&#x4EE3;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x76D1;&#x63A7;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;Dapper&#x7684;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x4FA7;&#x91CD;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x8C03;&#x67E5;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x4ED6;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#x4E5F;&#x6709;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x7528;&#x5904;&#x3002;</p>
<h2 id="1-1-&#x6587;&#x732E;&#x7684;&#x603B;&#x7ED3;"><a href="#1-1-&#x6587;&#x732E;&#x7684;&#x603B;&#x7ED3;" class="headerlink" title="1.1 &#x6587;&#x732E;&#x7684;&#x603B;&#x7ED3;"></a>1.1 &#x6587;&#x732E;&#x7684;&#x603B;&#x7ED3;</h2><p>&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x8DDF;&#x8E2A;&#x5DE5;&#x5177;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x5DF2;&#x7ECF;&#x88AB;&#x4E00;&#x4E9B;&#x4F18;&#x79C0;&#x6587;&#x7AE0;&#x63A2;&#x7D22;&#x8FC7;&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x7684;Pinpoint[9]&#x3001;Magpie[3]&#x548C;X-Trace[12]&#x548C;Dapper&#x6700;&#x4E3A;&#x76F8;&#x8FD1;&#x3002;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x5728;&#x5176;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x7684;&#x65E9;&#x671F;&#x503E;&#x5411;&#x4E8E;&#x5199;&#x5165;&#x7814;&#x7A76;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x5373;&#x4FBF;&#x4ED6;&#x4EEC;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x6E05;&#x695A;&#x5730;&#x8BC4;&#x4F30;&#x7CFB;&#x7EDF;&#x5F53;&#x4E2D;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;Dapper&#x5DF2;&#x7ECF;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x4E86;&#x591A;&#x5E74;&#xFF0C;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E48;&#x591A;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x9A8C;&#x8BC1;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x6700;&#x9002;&#x5408;&#x91CD;&#x70B9;&#x9610;&#x8FF0;&#x5728;&#x90E8;&#x7F72;Dapper&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x6709;&#x90A3;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x662F;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x5B83;&#x624D;&#x4F1A;&#x6700;&#x6709;&#x7528;&#x3002;Dappe&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x627F;&#x8F7D;&#x57FA;&#x4E8E;Dapper&#x5F00;&#x53D1;&#x7684;&#x6027;&#x80FD;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;Dapper&#x81EA;&#x8EAB;&#x7684;&#x76D1;&#x6D4B;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x7684;&#x4EF7;&#x503C;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x56DE;&#x987E;&#x8BC4;&#x4F30;&#x4E2D;&#x627E;&#x51FA;&#x4E00;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x867D;&#x7136;Dapper&#x5728;&#x8BB8;&#x591A;&#x9AD8;&#x9636;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x4E0A;&#x5438;&#x53D6;&#x4E86;Pinpoint&#x548C;Magpie&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#xFF0C;&#x4F46;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;Dapper&#x7684;&#x5B9E;&#x73B0;&#x5305;&#x542B;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x8D21;&#x732E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x5B9E;&#x73B0;&#x4F4E;&#x635F;&#x8017;&#x7684;&#x8BDD;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x800C;&#x4E14;&#x8D8B;&#x4E8E;&#x6781;&#x7AEF;&#x5EF6;&#x8FDF;&#x654F;&#x611F;&#x7684;Web&#x670D;&#x52A1;&#x4E2D;&#xFF0C;&#x91C7;&#x6837;&#x7387;&#x662F;&#x5F88;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x6216;&#x8BB8;&#x66F4;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5373;&#x4FBF;&#x662F;1/1000&#x7684;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x5BF9;&#x4E8E;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x901A;&#x7528;&#x4F7F;&#x7528;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x7684;&#x900F;&#x660E;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x7EC4;&#x4EF6;&#x5BF9;&#x5E94;&#x7528;&#x7684;&#x4FB5;&#x5165;&#x88AB;&#x5148;&#x9650;&#x5236;&#x5728;&#x8DB3;&#x591F;&#x4F4E;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x60F3;Google&#x7F51;&#x9875;&#x641C;&#x7D22;&#x8FD9;&#x4E48;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x800C;&#x65E0;&#x9700;&#x52A0;&#x5165;&#x989D;&#x5916;&#x7684;&#x6807;&#x6CE8;(Annotation)&#x3002;&#x867D;&#x7136;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x7CFB;&#x7EDF;&#x6709;&#x5E78;&#x662F;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x540C;&#x8D28;&#x5316;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x505A;&#x5230;&#x5BF9;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x900F;&#x660E;&#x8FD9;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x662F;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x900F;&#x660E;&#x6027;&#x7684;&#x5145;&#x5206;&#x6761;&#x4EF6;&#x3002;</p>
<ol start="2">
<li>Dapper&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;</li>
</ol>
<hr>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/febc025f5553536cbd8daf71a5b4eeab67db524a1823b0ad35d31146f633026d" alt><br>&#x56FE;1&#xFF1A;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x7531;&#x7528;&#x6237;&#x7684;X&#x8BF7;&#x6C42;&#x53D1;&#x8D77;&#xFF0C;&#x7A7F;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x670D;&#x52A1;&#x7CFB;&#x7EDF;&#x3002;&#x7528;&#x5B57;&#x6BCD;&#x6807;&#x8BC6;&#x7684;&#x8282;&#x70B9;&#x4EE3;&#x8868;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x7684;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x5728;&#x4E00;&#x6B21;&#x7279;&#x5B9A;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x56FE;1&#x5C55;&#x73B0;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x548C;5&#x53F0;&#x670D;&#x52A1;&#x5668;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x524D;&#x7AEF;&#xFF08;A&#xFF09;&#xFF0C;&#x4E24;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#xFF08;B&#x548C;C&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x4E24;&#x4E2A;&#x540E;&#x7AEF;&#xFF08;D&#x548C;E&#xFF09;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF08;&#x8FD9;&#x4E2A;&#x7528;&#x4F8B;&#x7684;&#x53D1;&#x8D77;&#x4EBA;&#xFF09;&#x53D1;&#x8D77;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x5230;&#x8FBE;&#x524D;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x9001;&#x4E24;&#x4E2A;RPC&#x5230;&#x670D;&#x52A1;&#x5668;B&#x548C;C&#x3002;B&#x4F1A;&#x9A6C;&#x4E0A;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x4F46;&#x662F;C&#x9700;&#x8981;&#x548C;&#x540E;&#x7AEF;&#x7684;D&#x548C;E&#x4EA4;&#x4E92;&#x4E4B;&#x540E;&#x518D;&#x8FD4;&#x8FD8;&#x7ED9;A&#xFF0C;&#x7531;A&#x6765;&#x54CD;&#x5E94;&#x6700;&#x521D;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x7B80;&#x5355;&#x5B9E;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6BCF;&#x4E00;&#x6B21;&#x4F60;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x52A8;&#x4F5C;&#x6765;&#x6536;&#x96C6;&#x8DDF;&#x8E2A;&#x6807;&#x8BC6;&#x7B26;(message identifiers)&#x548C;&#x65F6;&#x95F4;&#x6233;(timestamped<br> events)&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C06;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x6761;&#x76EE;&#x4E0E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x53D1;&#x8D77;&#x8005;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56FE;1&#x4E2D;&#x7684;RequestX&#xFF09;&#x5173;&#x8054;&#x4E0A;&#x5E76;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x9ED1;&#x76D2;(black-box)&#x548C;&#x57FA;&#x4E8E;&#x6807;&#x6CE8;(annotation-based)&#x7684;&#x76D1;&#x63A7;&#x65B9;&#x6848;&#x3002;&#x9ED1;&#x76D2;&#x65B9;&#x6848;[1&#xFF0C;15&#xFF0C;2]&#x5047;&#x5B9A;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x7684;&#x9664;&#x4E86;&#x4E0A;&#x8FF0;&#x4FE1;&#x606F;&#x4E4B;&#x5916;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x7EDF;&#x8BA1;&#x56DE;&#x5F52;&#x6280;&#x672F;&#x6765;&#x63A8;&#x65AD;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x57FA;&#x4E8E;&#x6807;&#x6CE8;&#x7684;&#x65B9;&#x6848;[3&#xFF0C;12&#xFF0C;9&#xFF0C;16]&#x4F9D;&#x8D56;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x4E2D;&#x95F4;&#x4EF6;&#x660E;&#x786E;&#x5730;&#x6807;&#x8BB0;&#x4E00;&#x4E2A;&#x5168;&#x5C40;ID&#xFF0C;&#x4ECE;&#x800C;&#x8FDE;&#x63A5;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x548C;&#x53D1;&#x8D77;&#x8005;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x867D;&#x7136;&#x9ED1;&#x76D2;&#x65B9;&#x6848;&#x6BD4;&#x6807;&#x6CE8;&#x65B9;&#x6848;&#x66F4;&#x8F7B;&#x4FBF;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x8DB3;&#x591F;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4F9D;&#x8D56;&#x4E8E;&#x7EDF;&#x8BA1;&#x63A8;&#x8BBA;&#x3002;&#x57FA;&#x4E8E;&#x6807;&#x6CE8;&#x7684;&#x65B9;&#x6848;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x9700;&#x8981;&#x4EE3;&#x7801;&#x690D;&#x5165;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x63A7;&#x5236;&#x6D41;&#x548C;RPC&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x4EE3;&#x7801;&#x690D;&#x5165;&#x9650;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x901A;&#x7528;&#x7EC4;&#x4EF6;&#x5E93;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E86;&#x76D1;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x5E94;&#x7528;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x6709;&#x6548;&#x5730;&#x900F;&#x660E;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x8BA4;&#x4E3A;&#xFF0C;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x67B6;&#x6784;&#x50CF;&#x662F;&#x5185;&#x5D4C;&#x5728;RPC&#x8C03;&#x7528;&#x7684;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E0D;&#x53EA;&#x5C40;&#x9650;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5B9A;&#x7684;RPC&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x80FD;&#x8DDF;&#x8E2A;&#x5176;&#x4ED6;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;Gmail&#x7684;SMTP&#x4F1A;&#x8BDD;&#xFF0C;&#x5916;&#x754C;&#x7684;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x548C;&#x5916;&#x90E8;&#x5BF9;SQL&#x670D;&#x52A1;&#x5668;&#x7684;&#x67E5;&#x8BE2;&#x7B49;&#x3002;&#x4ECE;&#x5F62;&#x5F0F;&#x4E0A;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;Dapper&#x8DDF;&#x8E2A;&#x6A21;&#x578B;&#x4F7F;&#x7528;&#x7684;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#xFF0C;Span&#x4EE5;&#x53CA;Annotation&#x3002;</p>
<h2 id="2-1-&#x8DDF;&#x8E2A;&#x6811;&#x548C;span"><a href="#2-1-&#x8DDF;&#x8E2A;&#x6811;&#x548C;span" class="headerlink" title="2.1 &#x8DDF;&#x8E2A;&#x6811;&#x548C;span"></a>2.1 &#x8DDF;&#x8E2A;&#x6811;&#x548C;span</h2><p>&#x5728;Dapper&#x8DDF;&#x8E2A;&#x6811;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x6811;&#x8282;&#x70B9;&#x662F;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53C8;&#x662F;&#x5BF9;span&#x7684;&#x5F15;&#x7528;&#x3002;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x7EBF;&#x8868;&#x793A;&#x7684;span&#x548C;&#x5B83;&#x7684;&#x7236;span&#x76F4;&#x63A5;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x867D;&#x7136;span&#x5728;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x8868;span&#x7684;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x6574;&#x4E2A;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x4E2D;&#x5374;&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;RPC&#x76F8;&#x5173;&#x7684;&#x65F6;&#x95F4;&#x6570;&#x636E;&#x3001;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;Annotation&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x4F1A;&#x5728;2.3&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5fc9e347e027902f09c1488aaba2f63757dccb6378beaa241367fb8b513e07e5" alt><br>&#x56FE;2&#xFF1A;5&#x4E2A;span&#x5728;Dapper&#x8DDF;&#x8E2A;&#x6811;&#x79CD;&#x77ED;&#x6682;&#x7684;&#x5173;&#x8054;&#x5173;&#x7CFB;</p>
<p>&#x5728;&#x56FE;2&#x4E2D;&#x8BF4;&#x660E;&#x4E86;span&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8DDF;&#x8E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;Dapper&#x8BB0;&#x5F55;&#x4E86;span&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;span&#x7684;ID&#x548C;&#x7236;ID&#xFF0C;&#x4EE5;&#x91CD;&#x5EFA;&#x5728;&#x4E00;&#x6B21;&#x8FFD;&#x8E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x540C;span&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;span&#x6CA1;&#x6709;&#x7236;ID&#x88AB;&#x79F0;&#x4E3A;root span&#x3002;&#x6240;&#x6709;span&#x90FD;&#x6302;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8DDF;&#x8E2A;&#x4E0A;&#xFF0C;&#x4E5F;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;id&#xFF08;&#x5728;&#x56FE;&#x4E2D;&#x672A;&#x793A;&#x51FA;&#xFF09;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;ID&#x7528;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x7684;64&#x4F4D;&#x6574;&#x6570;&#x6807;&#x793A;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;Dapper&#x8DDF;&#x8E2A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;RPC&#x5BF9;&#x5E94;&#x5230;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;span&#x4E0A;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x7EC4;&#x4EF6;&#x5C42;&#x90FD;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;&#x6811;&#x578B;&#x7ED3;&#x6784;&#x7684;&#x5C42;&#x7EA7;&#x3002;</p>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/684789cdfc6637476119f9174715f6bc3bcbeeb792f1d9a1ad57cf4bcf10bfc9" alt><br>&#x56FE;3&#xFF1A;&#x5728;&#x56FE;2&#x4E2D;&#x6240;&#x793A;&#x7684;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;span&#x7684;&#x7EC6;&#x8282;&#x56FE;</p>
<p>&#x56FE;3&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x5178;&#x578B;&#x7684;Dapper&#x8DDF;&#x8E2A;span&#x7684;&#x8BB0;&#x5F55;&#x70B9;&#x7684;&#x89C6;&#x56FE;&#x3002;&#x5728;&#x56FE;2&#x4E2D;&#x8FD9;&#x79CD;&#x67D0;&#x4E2A;span&#x8868;&#x8FF0;&#x4E86;&#x4E24;&#x4E2A;&#x201C;Helper.Call&#x201D;&#x7684;RPC(&#x5206;&#x522B;&#x4E3A;server&#x7AEF;&#x548C;client&#x7AEF;)&#x3002;span&#x7684;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;RPC&#x7684;&#x65F6;&#x95F4;&#x4FE1;&#x606F;&#x90FD;&#x901A;&#x8FC7;Dapper&#x5728;RPC&#x7EC4;&#x4EF6;&#x5E93;&#x7684;&#x690D;&#x5165;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x8005;&#x9009;&#x62E9;&#x5728;&#x8DDF;&#x8E2A;&#x4E2D;&#x589E;&#x52A0;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6CE8;&#x91CA;&#xFF08;&#x5982;&#x56FE;&#x4E2D;&#x201C;foo&#x201D;&#x7684;&#x6CE8;&#x91CA;&#xFF09;(&#x4E1A;&#x52A1;&#x6570;&#x636E;)&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4E5F;&#x4F1A;&#x548C;&#x5176;&#x4ED6;span&#x4FE1;&#x606F;&#x4E00;&#x6837;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x8BB0;&#x4F4F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;span&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x673A;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x8981;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;RPC span&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x4F7F;&#x5F97;&#x94FE;&#x63A5;&#x4E24;&#x4E2A;&#x4E3B;&#x673A;&#x7684;span&#x4F1A;&#x6210;&#x4E3A;&#x6A21;&#x578B;&#x4E2D;&#x6240;&#x8BF4;&#x7684;span&#x3002;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x5230;&#x65F6;&#x95F4;&#x504F;&#x5DEE;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;RPC&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x624D;&#x80FD;&#x63A5;&#x6536;&#x5230;&#xFF0C;&#x5BF9;&#x4E8E;&#x54CD;&#x5E94;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF08;&#x670D;&#x52A1;&#x5668;&#x5148;&#x54CD;&#x5E94;&#xFF0C;&#x7136;&#x540E;&#x5BA2;&#x6237;&#x7AEF;&#x624D;&#x80FD;&#x63A5;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;RPC&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x4E00;&#x4E2A;&#x4E0A;&#x9650;&#x548C;&#x4E0B;&#x9650;&#x3002;</p>
<h2 id="2-2-&#x690D;&#x5165;&#x70B9;"><a href="#2-2-&#x690D;&#x5165;&#x70B9;" class="headerlink" title="2.2 &#x690D;&#x5165;&#x70B9;"></a>2.2 &#x690D;&#x5165;&#x70B9;</h2><p>Dapper&#x53EF;&#x4EE5;&#x4EE5;&#x5BF9;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8005;&#x8FD1;&#x4E4E;&#x96F6;&#x6D78;&#x5165;&#x7684;&#x6210;&#x672C;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x57FA;&#x4E8E;&#x5C11;&#x91CF;&#x901A;&#x7528;&#x7EC4;&#x4EF6;&#x5E93;&#x7684;&#x6539;&#x9020;&#x3002;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x5904;&#x7406;&#x8DDF;&#x8E2A;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Dapper&#x628A;&#x8FD9;&#x6B21;&#x8DDF;&#x8E2A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5728;ThreadLocal&#x4E2D;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x3002;&#x8FFD;&#x8E2A;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x590D;&#x5236;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x5176;&#x4E2D;&#x627F;&#x8F7D;&#x4E86;Scan&#x7684;&#x5C5E;&#x6027;&#x6BD4;&#x5982;&#x8DDF;&#x8E2A;ID&#x548C;span ID&#x3002;</li>
<li>&#x5F53;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x5EF6;&#x8FDF;&#x8C03;&#x7528;&#x7684;&#x6216;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x5927;&#x591A;&#x6570;Google&#x5F00;&#x53D1;&#x8005;&#x901A;&#x8FC7;&#x7EBF;&#x7A0B;&#x6C60;&#x6216;&#x5176;&#x4ED6;&#x6267;&#x884C;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x5E93;&#x6765;&#x56DE;&#x8C03;&#x3002;Dapper&#x786E;&#x4FDD;&#x6240;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x56DE;&#x8C03;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x8FD9;&#x6B21;&#x8DDF;&#x8E2A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x800C;&#x5F53;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x88AB;&#x89E6;&#x53D1;&#x65F6;&#xFF0C;&#x8FD9;&#x6B21;&#x8DDF;&#x8E2A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4F1A;&#x4E0E;&#x9002;&#x5F53;&#x7684;&#x7EBF;&#x7A0B;&#x5173;&#x8054;&#x4E0A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;Dapper&#x53EF;&#x4EE5;&#x4F7F;&#x7528;trace ID&#x548C;span ID&#x6765;&#x8F85;&#x52A9;&#x6784;&#x5EFA;&#x5F02;&#x6B65;&#x8C03;&#x7528;&#x7684;&#x8DEF;&#x5F84;&#x3002;</li>
<li>&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;Google&#x7684;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4E00;&#x4E2A;&#x7528;C++&#x548C;Java&#x5F00;&#x53D1;&#x7684;RPC&#x6846;&#x67B6;&#x4E0A;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8DDF;&#x8E2A;&#x690D;&#x5165;&#x8BE5;&#x6846;&#x67B6;&#x6765;&#x5B9A;&#x4E49;RPC&#x4E2D;&#x6240;&#x6709;&#x7684;span&#x3002;span&#x7684;ID&#x548C;&#x8DDF;&#x8E2A;&#x7684;ID&#x4F1A;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x7AEF;&#x3002;&#x50CF;&#x90A3;&#x6837;&#x7684;&#x57FA;&#x4E8E;RPC&#x7684;&#x7CFB;&#x7EDF;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x5728;Google&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x690D;&#x5165;&#x70B9;&#x3002;&#x5F53;&#x90A3;&#x4E9B;&#x975E;RPC&#x901A;&#x4FE1;&#x6846;&#x67B6;&#x53D1;&#x5C55;&#x6210;&#x719F;&#x5E76;&#x627E;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BA1;&#x5212;&#x5BF9;RPC&#x901A;&#x4FE1;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x690D;&#x5165;&#x3002;</li>
</ul>
<p>Dapper&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x662F;&#x72EC;&#x7ACB;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x8DDF;&#x8E2A;&#x7ED3;&#x5408;&#x4E86;&#x7528;C++&#x548C;Java&#x5199;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;3.2&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x900F;&#x660E;&#x5EA6;&#x65F6;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x7684;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x8DF5;&#x7684;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;</p>
<h2 id="2-3-Annotation"><a href="#2-3-Annotation" class="headerlink" title="2.3 Annotation"></a>2.3 Annotation</h2><p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/9781a3d7333389b02d733973aeb859ac02143f94a25aa7677a9c76e337dcf5ff" alt><br>&#x4E0A;&#x8FF0;&#x690D;&#x5165;&#x70B9;&#x8DB3;&#x591F;&#x63A8;&#x5BFC;&#x51FA;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x8DDF;&#x8E2A;&#x7EC6;&#x8282;&#xFF0C;&#x4F7F;&#x5F97;Dapper&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x5728;&#x4E0D;&#x6539;&#x52A8;Google&#x5E94;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;Dapper&#x8FD8;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;Dapper&#x8DDF;&#x8E2A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x76D1;&#x63A7;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#xFF0C;&#x6216;&#x5E2E;&#x52A9;&#x8C03;&#x8BD5;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;API&#x5B9A;&#x4E49;&#x5E26;&#x65F6;&#x95F4;&#x6233;&#x7684;Annotation&#xFF0C;&#x6838;&#x5FC3;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5165;&#x56FE;4&#x6240;&#x793A;&#x3002;&#x8FD9;&#x4E9B;Annotation&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x5185;&#x5BB9;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x62A4;Dapper&#x7684;&#x7528;&#x6237;&#x610F;&#x5916;&#x7684;&#x8FC7;&#x5206;&#x70ED;&#x8877;&#x4E8E;&#x65E5;&#x5FD7;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;span&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x603B;Annotation&#x91CF;&#x7684;&#x4E0A;&#x9650;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x7684;Annotation&#x662F;&#x4E0D;&#x80FD;&#x66FF;&#x4EE3;&#x7528;&#x4E8E;&#x8868;&#x793A;span&#x7ED3;&#x6784;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x8BB0;&#x5F55;&#x7740;RPC&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x6587;&#x672C;Annotation&#xFF0C;Dapper&#x4E5F;&#x652F;&#x6301;&#x7684;key-value&#x6620;&#x5C04;&#x7684; Annotation&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x5F3A;&#x7684;&#x8DDF;&#x8E2A;&#x80FD;&#x529B;&#xFF0C;&#x5982;&#x6301;&#x7EED;&#x7684;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4E8C;&#x8FDB;&#x5236;&#x6D88;&#x606F;&#x8BB0;&#x5F55;&#x548C;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0A;&#x8DD1;&#x7740;&#x7684;&#x4EFB;&#x610F;&#x7684;&#x7528;&#x6237;&#x6570;&#x636E;&#x3002;&#x952E;&#x503C;&#x5BF9;&#x7684;Annotation&#x65B9;&#x5F0F;&#x7528;&#x6765;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x8FFD;&#x8E2A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5B9A;&#x4E49;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76F8;&#x5173;&#x7C7B;&#x578B;&#x3002;</p>
<h2 id="2-4-&#x91C7;&#x6837;&#x7387;"><a href="#2-4-&#x91C7;&#x6837;&#x7387;" class="headerlink" title="2.4 &#x91C7;&#x6837;&#x7387;"></a>2.4 &#x91C7;&#x6837;&#x7387;</h2><p>&#x4F4E;&#x635F;&#x8017;&#x7684;&#x662F;Dapper&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x4EF7;&#x503C;&#x672A;&#x88AB;&#x8BC1;&#x5B9E;&#x4F46;&#x53C8;&#x5BF9;&#x6027;&#x80FD;&#x6709;&#x5F71;&#x54CD;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x670D;&#x52A1;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x613F;&#x610F;&#x90E8;&#x7F72;&#x5B83;&#x3002;&#x51B5;&#x4E14;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;Annotation&#x7684;API&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x53D1;&#x73B0;&#xFF0C;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;Web&#x670D;&#x52A1;&#x5BF9;&#x690D;&#x5165;&#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x654F;&#x611F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9664;&#x4E86;&#x628A;Dapper&#x7684;&#x6536;&#x96C6;&#x5DE5;&#x4F5C;&#x5BF9;&#x57FA;&#x672C;&#x7EC4;&#x4EF6;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x9650;&#x5236;&#x7684;&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x8FDB;&#x4E00;&#x6B65;&#x63A7;&#x5236;&#x635F;&#x8017;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x9047;&#x5230;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x65F6;&#x53EA;&#x8BB0;&#x5F55;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;4.4&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x8DDF;&#x8E2A;&#x7684;&#x91C7;&#x6837;&#x7387;&#x65B9;&#x6848;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/c2c9523198450649e8d7f93445a87c314004f76c26b711919b090814d1a03ef7" alt><br>&#x56FE;5&#xFF1A;Dapper&#x6536;&#x96C6;&#x7BA1;&#x9053;&#x7684;&#x603B;&#x89C8;</p>
<h2 id="2-5-&#x8DDF;&#x8E2A;&#x7684;&#x6536;&#x96C6;"><a href="#2-5-&#x8DDF;&#x8E2A;&#x7684;&#x6536;&#x96C6;" class="headerlink" title="2.5 &#x8DDF;&#x8E2A;&#x7684;&#x6536;&#x96C6;"></a>2.5 &#x8DDF;&#x8E2A;&#x7684;&#x6536;&#x96C6;</h2><p>Dapper&#x7684;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x548C;&#x6536;&#x96C6;&#x7BA1;&#x9053;&#x7684;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF08;&#x53C2;&#x89C1;&#x56FE;5&#xFF09;&#x3002;&#x9996;&#x5148;&#xFF0C;span&#x6570;&#x636E;&#x5199;&#x5165;&#xFF08;1&#xFF09;&#x672C;&#x5730;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x7136;&#x540E;Dapper&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x548C;&#x6536;&#x96C6;&#x7EC4;&#x4EF6;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4ECE;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x4E3B;&#x673A;&#x4E2D;&#x62C9;&#x51FA;&#x6765;&#xFF08;2&#xFF09;&#xFF0C;&#x6700;&#x7EC8;&#x5199;&#x5230;&#xFF08;3&#xFF09;Dapper&#x7684;Bigtable&#x4ED3;&#x5E93;&#x4E2D;&#x3002;&#x4E00;&#x6B21;&#x8DDF;&#x8E2A;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;Bigtable&#x4E2D;&#x7684;&#x4E00;&#x884C;&#xFF0C;&#x6BCF;&#x4E00;&#x5217;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;span&#x3002;Bigtable&#x7684;&#x652F;&#x6301;&#x7A00;&#x758F;&#x8868;&#x683C;&#x5E03;&#x5C40;&#x6B63;&#x9002;&#x5408;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x6B21;&#x8DDF;&#x8E2A;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x610F;&#x591A;&#x4E2A;span&#x3002;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x6536;&#x96C6;&#xFF08;&#x5373;&#x4ECE;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x7684;&#x5EF6;&#x8FDF;&#x4E2D;&#x4F4D;&#x6570;&#x5C11;&#x4E8E;15&#x79D2;&#x3002;&#x7B2C;98&#x767E;&#x5206;&#x4F4D;&#x7684;&#x5EF6;&#x8FDF;(The<br> 98th percentile latency)&#x5F80;&#x5F80;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x5448;&#x73B0;&#x53CC;&#x5CF0;&#x578B;;&#x5927;&#x7EA6;75%&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C;98&#x767E;&#x5206;&#x4F4D;&#x7684;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;2&#x5206;&#x949F;&#xFF0C;&#x4F46;&#x662F;&#x53E6;&#x5916;&#x5927;&#x7EA6;25%&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x589E;&#x6DA8;&#x5230;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x3002;</p>
<p>Dapper&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;API&#x6765;&#x7B80;&#x5316;&#x8BBF;&#x95EE;&#x6211;&#x4EEC;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x3002; Google&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7528;&#x8FD9;&#x4E2A;API&#xFF0C;&#x4EE5;&#x6784;&#x5EFA;&#x901A;&#x7528;&#x548C;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x3002;&#x7B2C;5.1&#x8282;&#x5305;&#x542B;&#x66F4;&#x591A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="2-5-1-&#x5E26;&#x5916;&#x6570;&#x636E;&#x8DDF;&#x8E2A;&#x6536;&#x96C6;"><a href="#2-5-1-&#x5E26;&#x5916;&#x6570;&#x636E;&#x8DDF;&#x8E2A;&#x6536;&#x96C6;" class="headerlink" title="2.5.1 &#x5E26;&#x5916;&#x6570;&#x636E;&#x8DDF;&#x8E2A;&#x6536;&#x96C6;"></a>2.5.1 &#x5E26;&#x5916;&#x6570;&#x636E;&#x8DDF;&#x8E2A;&#x6536;&#x96C6;</h2><p>tip1:&#x5E26;&#x5916;&#x6570;&#x636E;:&#x4F20;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x4F7F;&#x7528;&#x5E26;&#x5916;&#x6570;&#x636E;(out-of-band&#xFF0C;OOB)&#x6765;&#x53D1;&#x9001;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;,&#x5982;&#x679C;&#x901A;&#x4FE1;&#x4E00;&#x65B9;&#x6709;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#x9700;&#x8981;&#x901A;&#x77E5;&#x5BF9;&#x65B9;&#x65F6;,&#x534F;&#x8BAE;&#x80FD;&#x591F;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5FEB;&#x901F;&#x5730;&#x53D1;&#x9001;&#x5230;&#x5BF9;&#x65B9;&#x3002;&#x4E3A;&#x4E86;&#x53D1;&#x9001;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x534F;&#x8BAE;&#x4E00;&#x822C;&#x4E0D;&#x4F7F;&#x7528;&#x4E0E;&#x666E;&#x901A;&#x6570;&#x636E;&#x76F8;&#x540C;&#x7684;&#x901A;&#x9053;,&#x800C;&#x662F;&#x4F7F;&#x7528;&#x53E6;&#x5916;&#x7684;&#x901A;&#x9053;&#x3002;</p>
<p>tip2:&#x8FD9;&#x91CC;&#x6307;&#x7684;in-band&#x7B56;&#x7565;&#x662F;&#x628A;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x968F;&#x7740;&#x8C03;&#x7528;&#x94FE;&#x8FDB;&#x884C;&#x4F20;&#x9001;&#xFF0C;out-of-band&#x662F;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x7684;&#x94FE;&#x8DEF;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x6536;&#x96C6;&#xFF0C;Dapper&#x7684;&#x5199;&#x65E5;&#x5FD7;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x65E5;&#x5FD7;&#x91C7;&#x96C6;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x5C5E;&#x4E8E;out-of-band&#x7B56;&#x7565;</p>
<p>Dapper&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x6811;&#x6811;&#x81EA;&#x8EAB;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x548C;&#x6536;&#x96C6;&#x5E26;&#x5916;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E3A;&#x4E24;&#x4E2A;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x539F;&#x56E0;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5E26;&#x5185;&#x6536;&#x96C6;&#x65B9;&#x6848;&#x2013;&#x8FD9;&#x91CC;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4F1A;&#x4EE5;RPC&#x54CD;&#x5E94;&#x5934;&#x7684;&#x5F62;&#x5F0F;&#x88AB;&#x8FD4;&#x56DE;&#x2013;&#x4F1A;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F51;&#x7EDC;&#x52A8;&#x6001;&#x3002;&#x5728;Google&#x91CC;&#x7684;&#x8BB8;&#x591A;&#x89C4;&#x6A21;&#x8F83;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E00;&#x6B21;&#x8DDF;&#x8E2A;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;span&#x5E76;&#x4E0D;&#x5C11;&#x89C1;&#x3002;&#x7136;&#x800C;&#xFF0C;RPC&#x56DE;&#x5E94;&#x5927;&#x5C0F;&#x2013;&#x751A;&#x81F3;&#x662F;&#x63A5;&#x8FD1;&#x5927;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x8DDF;&#x8E2A;&#x7684;&#x6839;&#x8282;&#x70B9;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x2013; &#x4ECD;&#x7136;&#x662F;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#xFF1A;&#x901A;&#x5E38;&#x5C0F;&#x4E8E;10K&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E26;&#x5185;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4F1A;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6570;&#x636E;&#x548C;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x540E;&#x7EED;&#x5206;&#x6790;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x636E;&#x91CF;&#x76F8;&#x5F62;&#x89C1;&#x7ECC;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5E26;&#x5185;&#x6536;&#x96C6;&#x65B9;&#x6848;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x7684;RPC&#x662F;&#x5B8C;&#x7F8E;&#x5D4C;&#x5957;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7684;&#x540E;&#x7AEF;&#x7684;&#x7CFB;&#x7EDF;&#x8FD4;&#x56DE;&#x7684;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x4E2D;&#x95F4;&#x4EF6;&#x4F1A;&#x628A;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x8C03;&#x7528;&#x8005;&#x3002;&#x5E26;&#x5185;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x662F;&#x65E0;&#x6CD5;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x975E;&#x5D4C;&#x5957;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#x7684;&#x3002;</p>
<h2 id="2-6-&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x8003;&#x8651;"><a href="#2-6-&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x8003;&#x8651;" class="headerlink" title="2.6 &#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x8003;&#x8651;"></a>2.6 &#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x8003;&#x8651;</h2><p>&#x8BB0;&#x5F55;&#x4E00;&#x5B9A;&#x91CF;&#x7684;RPC&#x6709;&#x6548;&#x8D1F;&#x8F7D;&#x4FE1;&#x606F;&#x5C06;&#x4E30;&#x5BCC;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x80FD;&#x591F;&#x5728;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x6570;&#x636E;&#xFF08;&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x7684;&#x53C2;&#x6570;&#xFF09;&#x4E2D;&#x627E;&#x5230;&#x76F8;&#x5173;&#x7684;&#x6837;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6837;&#x4F8B;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x88AB;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x7684;&#x4E3A;&#x4F55;&#x8868;&#x73B0;&#x5F02;&#x5E38;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x5E94;&#x8BE5;&#x900F;&#x9732;&#x7ED9;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7528;&#x6237;(&#x5305;&#x62EC;&#x6B63;&#x5728;debug&#x7684;&#x5DE5;&#x7A0B;&#x5E08;)&#x7684;&#x5185;&#x90E8;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x53EF;&#x5FFD;&#x7565;&#x7684;&#xFF0C;dapper&#x4E2D;&#x7684;&#x867D;&#x7136;&#x5B58;&#x50A8;RPC&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4E0D;&#x8BB0;&#x5F55;&#x4EFB;&#x4F55;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x6570;&#x636E;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x522B;&#x7684;Annotation&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x53EF;&#x9009;&#x673A;&#x5236;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728;span&#x4E2D;&#x9009;&#x62E9;&#x5173;&#x8054;&#x90A3;&#x4E9B;&#x4E3A;&#x4EE5;&#x540E;&#x5206;&#x6790;&#x63D0;&#x4F9B;&#x4EF7;&#x503C;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>Dapper&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x5B89;&#x5168;&#x4E0A;&#x7684;&#x4FBF;&#x5229;&#xFF0C;&#x662F;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4E8B;&#x5148;&#x6CA1;&#x6709;&#x9884;&#x6599;&#x5230;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x8DDF;&#x8E2A;&#x516C;&#x5F00;&#x7684;&#x5B89;&#x5168;&#x534F;&#x8BAE;&#x53C2;&#x6570;&#xFF0C;Dapper&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F8;&#x5E94;&#x7EA7;&#x522B;&#x7684;&#x8BA4;&#x8BC1;&#x6216;&#x52A0;&#x5BC6;&#xFF0C;&#x6765;&#x76D1;&#x89C6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x5B89;&#x5168;&#x7B56;&#x7565;&#x3002;&#x4F8B;&#x5982;&#x3002;Dapper&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x57FA;&#x4E8E;&#x7B56;&#x7565;&#x7684;&#x7684;&#x9694;&#x79BB;&#x7CFB;&#x7EDF;&#x6309;&#x9884;&#x671F;&#x6267;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#x652F;&#x6491;&#x654F;&#x611F;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x4E0E;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;&#x7CFB;&#x7EDF;&#x7EC4;&#x4EF6;&#x8FDB;&#x884C;&#x4E86;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6D4B;&#x7B97;&#x63D0;&#x4F9B;&#x4E86;&#x6BD4;&#x6E90;&#x7801;&#x5BA1;&#x6838;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x4FDD;&#x969C;&#x3002;</p>
<ol start="3">
<li>Dapper&#x90E8;&#x7F72;&#x72B6;&#x51B5;</li>
</ol>
<hr>
<p>Dapper&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E24;&#x5E74;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6C47;&#x62A5;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#xFF0C;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;Dapper&#x5982;&#x4F55;&#x6EE1;&#x8DB3;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x2014;&#x2014;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x7684;&#x90E8;&#x7F72;&#x548C;&#x5E94;&#x7528;&#x7EA7;&#x7684;&#x900F;&#x660E;&#x3002;</p>
<h2 id="3-1-Dapper&#x8FD0;&#x884C;&#x5E93;"><a href="#3-1-Dapper&#x8FD0;&#x884C;&#x5E93;" class="headerlink" title="3.1 Dapper&#x8FD0;&#x884C;&#x5E93;"></a>3.1 Dapper&#x8FD0;&#x884C;&#x5E93;</h2><p>&#x4E5F;&#x8BB8;Dapper&#x4EE3;&#x7801;&#x4E2D;&#x4E2D;&#x6700;&#x5173;&#x952E;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x57FA;&#x7840;RPC&#x3001;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;&#x548C;&#x6D41;&#x7A0B;&#x63A7;&#x5236;&#x7684;&#x7EC4;&#x4EF6;&#x5E93;&#x7684;&#x690D;&#x5165;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;span&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x91C7;&#x6837;&#x7387;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x4EE5;&#x53CA;&#x628A;&#x65E5;&#x5FD7;&#x5199;&#x5165;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x3002;&#x9664;&#x4E86;&#x505A;&#x5230;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x690D;&#x5165;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x9700;&#x8981;&#x7A33;&#x5B9A;&#x548C;&#x5065;&#x58EE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x6D77;&#x91CF;&#x7684;&#x5E94;&#x7528;&#x5BF9;&#x63A5;&#xFF0C;&#x7EF4;&#x62A4;&#x548C;bug&#x4FEE;&#x590D;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;&#x690D;&#x5165;&#x7684;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x662F;&#x7531;&#x672A;&#x8D85;&#x8FC7;1000&#x884C;&#x7684;C++&#x548C;&#x4E0D;&#x8D85;&#x8FC7;800&#x884C;Java&#x4EE3;&#x7801;&#x7EC4;&#x6210;&#x3002;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x952E;&#x503C;&#x5BF9;&#x7684;Annotation&#x8FD8;&#x6DFB;&#x52A0;&#x4E86;&#x989D;&#x5916;&#x7684;500&#x884C;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="3-2-&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6DB5;&#x76D6;&#x9762;"><a href="#3-2-&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6DB5;&#x76D6;&#x9762;" class="headerlink" title="3.2 &#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6DB5;&#x76D6;&#x9762;"></a>3.2 &#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6DB5;&#x76D6;&#x9762;</h2><p>Dapper&#x7684;&#x6E17;&#x900F;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E3A;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;Dapper&#x8DDF;&#x8E2A;&#x7684;&#x8FC7;&#x7A0B;(&#x4E0E;Dapper&#x690D;&#x5165;&#x7684;&#x7EC4;&#x4EF6;&#x5E93;&#x76F8;&#x5173;)&#xFF0C;&#x548C;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5728;&#x8FD0;&#x884C;Dapper&#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;Dapper&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x5206;&#x5E03;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7B80;&#x5355;&#x7684;&#x62D3;&#x6251;&#x56FE;&#xFF0C;&#x5B83;&#x5B58;&#x5728;&#x4E8E;Google&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x7CBE;&#x786E;&#x7684;Dapper-ready&#x8FDB;&#x7A0B;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x7A0B;&#x5373;&#x4FBF;&#x4E0D;&#x4EA7;&#x751F;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;Dapper&#x4E5F;&#x662F;&#x65E0;&#x4ECE;&#x77E5;&#x6653;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x65E0;&#x5904;&#x4E0D;&#x5728;Dapper&#x7EC4;&#x4EF6;&#x7684;&#x690D;&#x5165;&#x5E93;&#xFF0C;&#x6211;&#x4EEC;&#x4F30;&#x8BA1;&#x51E0;&#x4E4E;&#x6BCF;&#x4E00;&#x4E2A;Google&#x7684;&#x751F;&#x4EA7;&#x8FDB;&#x7A0B;&#x90FD;&#x662F;&#x652F;&#x6301;&#x8DDF;&#x8E2A;&#x7684;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;Dapper&#x7684;&#x662F;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x7684;&#x8DDF;&#x8E2A;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x901A;&#x5E38;&#x6E90;&#x4E8E;&#x4F7F;&#x7528;&#x975E;&#x6807;&#x51C6;&#x7684;&#x63A7;&#x5236;&#x6D41;&#xFF0C;&#x6216;&#x662F;Dapper&#x7684;&#x9519;&#x8BEF;&#x7684;&#x628A;&#x8DEF;&#x5F84;&#x5173;&#x8054;&#x5F52;&#x5230;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x4EF6;&#x4E0A;&#x3002;Dapper&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5E93;&#x6765;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x8005;&#x624B;&#x52A8;&#x63A7;&#x5236;&#x8DDF;&#x8E2A;&#x4F20;&#x64AD;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x53D8;&#x901A;&#x65B9;&#x6CD5;&#x3002;&#x76EE;&#x524D;&#x6709;40&#x4E2A;C++&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;33&#x4E2A;Java&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x624B;&#x52A8;&#x63A7;&#x5236;&#x7684;&#x8FFD;&#x8E2A;&#x4F20;&#x64AD;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x53EA;&#x662F;&#x4E0A;&#x5343;&#x4E2A;&#x7684;&#x8DDF;&#x8E2A;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x4E5F;&#x6709;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x975E;&#x7EC4;&#x4EF6;&#x6027;&#x8D28;&#x7684;&#x901A;&#x4FE1;&#x5E93;&#xFF08;&#x6BD4;&#x5982;&#x539F;&#x751F;&#x7684;TCP Socket&#x6216;SOAP RPC&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x652F;&#x6301;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x63A5;&#x5165;&#x5230;Dapper&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x5B89;&#x5168;&#xFF0C;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x4E5F;&#x53EF;&#x4EE5;&#x5173;&#x95ED;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x5728;&#x90E8;&#x7F72;&#x7684;&#x65E9;&#x8D77;&#x5C31;&#x662F;&#x9ED8;&#x8BA4;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x76F4;&#x5230;&#x6211;&#x4EEC;&#x5BF9;Dapper&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x4F4E;&#x635F;&#x8017;&#x6709;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x5FC3;&#x4E4B;&#x540E;&#x624D;&#x628A;&#x5B83;&#x5F00;&#x542F;&#x3002;Dapper&#x7684;&#x56E2;&#x961F;&#x5076;&#x5C14;&#x4F1A;&#x6267;&#x884C;&#x5BA1;&#x67E5;&#x5BFB;&#x627E;&#x8DDF;&#x8E2A;&#x914D;&#x7F6E;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x90A3;&#x4E9B;&#x670D;&#x52A1;&#x5173;&#x95ED;&#x4E86;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x591A;&#x89C1;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x5E38;&#x662F;&#x6E90;&#x4E8E;&#x5BF9;&#x76D1;&#x63A7;&#x5BF9;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x7684;&#x62C5;&#x5FE7;&#x3002;&#x7ECF;&#x8FC7;&#x4E86;&#x5BF9;&#x5B9E;&#x9645;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x8C03;&#x67E5;&#x548C;&#x6D4B;&#x91CF;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5173;&#x95ED;Dapper&#x8DDF;&#x8E2A;&#x90FD;&#x5DF2;&#x7ECF;&#x6062;&#x590D;&#x5F00;&#x542F;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x4E0D;&#x91CD;&#x8981;&#x4E86;&#x3002;</p>
<h2 id="3-3-&#x8DDF;&#x8E2A;Annotation&#x7684;&#x4F7F;&#x7528;"><a href="#3-3-&#x8DDF;&#x8E2A;Annotation&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="3.3 &#x8DDF;&#x8E2A;Annotation&#x7684;&#x4F7F;&#x7528;"></a>3.3 &#x8DDF;&#x8E2A;Annotation&#x7684;&#x4F7F;&#x7528;</h2><p>&#x7A0B;&#x5E8F;&#x5458;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;Annotation&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x8C03;&#x8BD5;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x5BF9;&#x8DDF;&#x8E2A;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6240;&#x6709;&#x7684;Bigtable&#x7684;&#x8BF7;&#x6C42;&#x4F1A;&#x628A;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x8868;&#x540D;&#x4E5F;&#x8BB0;&#x5F55;&#x5230;Annotation&#x4E2D;&#x3002;&#x76EE;&#x524D;&#xFF0C;70&#xFF05;&#x7684;Dapper span&#x548C;90&#xFF05;&#x7684;&#x6240;&#x6709;Dapper&#x8DDF;&#x8E2A;&#x90FD;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x5E94;&#x7528;&#x7684;Annotation&#x3002;</p>
<p>41&#x4E2A;Java&#x5E94;&#x7528;&#x548C;68&#x4E2A;C++&#x5E94;&#x7528;&#x4E2D;&#x90FD;&#x6DFB;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x7684;Annotation&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;span&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x7684;Java&#x5F00;&#x53D1;&#x8005;&#x6BD4;C++&#x5F00;&#x53D1;&#x8005;&#x66F4;&#x591A;&#x7684;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;span&#x4E0A;&#x91C7;&#x7528;Annotation&#x7684;API&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;Java&#x5E94;&#x7528;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5F80;&#x5F80;&#x662F;&#x66F4;&#x63A5;&#x8FD1;&#x6700;&#x7EC8;&#x7528;&#x6237;(C++&#x504F;&#x5E95;&#x5C42;);&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x5904;&#x7406;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x8BF7;&#x6C42;&#x7EC4;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x5177;&#x6709;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x3002;</p>
<ol start="4">
<li>&#x5904;&#x7406;&#x8DDF;&#x8E2A;&#x635F;&#x8017;</li>
</ol>
<hr>
<p>&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x672C;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;1.&#x6B63;&#x5728;&#x88AB;&#x76D1;&#x63A7;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x751F;&#x6210;&#x8FFD;&#x8E2A;&#x548C;&#x6536;&#x96C6;&#x8FFD;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x6D88;&#x8017;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#xFF0C;2&#x3002;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x90E8;&#x5206;&#x8D44;&#x6E90;&#x6765;&#x5B58;&#x50A8;&#x548C;&#x5206;&#x6790;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x3002;&#x867D;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x4E2A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x4EF6;&#x690D;&#x5165;&#x8DDF;&#x8E2A;&#x5E26;&#x6765;&#x4E00;&#x90E8;&#x5206;&#x6027;&#x80FD;&#x635F;&#x8017;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x5982;&#x679C;&#x57FA;&#x672C;&#x635F;&#x8017;&#x80FD;&#x8FBE;&#x5230;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x6700;&#x521D;&#x7684;&#x63A8;&#x5E7F;&#x4F1A;&#x6709;&#x6781;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5C55;&#x73B0;&#x4E00;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;Dapper&#x7EC4;&#x4EF6;&#x64CD;&#x4F5C;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x4EE5;&#x53CA;Dapper&#x5BF9;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8D1F;&#x8F7D;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;Dapper&#x53EF;&#x8C03;&#x8282;&#x7684;&#x91C7;&#x6837;&#x7387;&#x673A;&#x5236;&#x5982;&#x4F55;&#x5E2E;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x4F4E;&#x635F;&#x8017;&#x548C;&#x8DDF;&#x8E2A;&#x4EE3;&#x8868;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x8861;&#x548C;&#x53D6;&#x820D;&#x3002;</p>
<h2 id="4-1-&#x751F;&#x6210;&#x8DDF;&#x8E2A;&#x7684;&#x635F;&#x8017;"><a href="#4-1-&#x751F;&#x6210;&#x8DDF;&#x8E2A;&#x7684;&#x635F;&#x8017;" class="headerlink" title="4.1 &#x751F;&#x6210;&#x8DDF;&#x8E2A;&#x7684;&#x635F;&#x8017;"></a>4.1 &#x751F;&#x6210;&#x8DDF;&#x8E2A;&#x7684;&#x635F;&#x8017;</h2><p>&#x751F;&#x6210;&#x8DDF;&#x8E2A;&#x7684;&#x5F00;&#x9500;&#x662F;Dapper&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x4E2D;&#x6700;&#x5173;&#x952E;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x6536;&#x96C6;&#x548C;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x5728;&#x7D27;&#x6025;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x5173;&#x95ED;&#x3002;Dapper&#x8FD0;&#x884C;&#x5E93;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8DDF;&#x8E2A;&#x751F;&#x6210;&#x6D88;&#x8017;&#x5728;&#x4E8E;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;span&#x548C;annotation&#xFF0C;&#x5E76;&#x8BB0;&#x5F55;&#x5230;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x4F9B;&#x540E;&#x7EED;&#x7684;&#x6536;&#x96C6;&#x3002;&#x6839;span&#x7684;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x9700;&#x8981;&#x635F;&#x8017;&#x5E73;&#x5747;204&#x7EB3;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x5728;&#x5176;&#x4ED6;span&#x4E0A;&#x9700;&#x8981;&#x6D88;&#x8017;176&#x7EB3;&#x79D2;&#x3002;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x5DEE;&#x522B;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#x9700;&#x8981;&#x5728;&#x8DDF;span&#x4E0A;&#x7ED9;&#x8FD9;&#x6B21;&#x8DDF;&#x8E2A;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x7684;ID&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;span&#x6CA1;&#x6709;&#x88AB;&#x91C7;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x989D;&#x5916;&#x7684;span&#x4E0B;&#x521B;&#x5EFA;annotation&#x7684;&#x6210;&#x672C;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#xFF0C;&#x4ED6;&#x7531;&#x5728;Dapper&#x8FD0;&#x884C;&#x671F;&#x5BF9;ThreadLocal&#x67E5;&#x627E;&#x64CD;&#x4F5C;&#x6784;&#x6210;&#xFF0C;&#x8FD9;&#x5E73;&#x5747;&#x53EA;&#x6D88;&#x8017;9&#x7EB3;&#x79D2;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;span&#x88AB;&#x8BA1;&#x5165;&#x91C7;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x7528;&#x4E00;&#x4E2A;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x6807;&#x6CE8;&#x2013;&#x5728;&#x56FE;4&#x4E2D;&#x6709;&#x5C55;&#x73B0;&#x2013;&#x5E73;&#x5747;&#x9700;&#x8981;&#x6D88;&#x8017;40&#x7EB3;&#x79D2;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x90FD;&#x662F;&#x5728;2.2GHz&#x7684;x86&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x91C7;&#x96C6;&#x7684;&#x3002;</p>
<p>&#x5728;Dapper&#x8FD0;&#x884C;&#x671F;&#x5199;&#x5165;&#x5230;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x662F;&#x6700;&#x6602;&#x8D35;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x53EF;&#x89C1;&#x635F;&#x8017;&#x5927;&#x5927;&#x51CF;&#x5C11;&#xFF0C;&#x56E0;&#x4E3A;&#x5199;&#x5165;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x76F8;&#x5BF9;&#x4E8E;&#x88AB;&#x8DDF;&#x8E2A;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x65E5;&#x5FD7;&#x5199;&#x5165;&#x7684;&#x64CD;&#x4F5C;&#x5982;&#x679C;&#x5728;&#x5927;&#x6D41;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x90FD;&#x88AB;&#x8DDF;&#x8E2A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x53EF;&#x4EE5;&#x5BDF;&#x89C9;&#x5230;&#x3002;&#x6211;&#x4EEC;&#x8BB0;&#x5F55;&#x4E86;&#x5728;4.3&#x8282;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x6B21;Web&#x641C;&#x7D22;&#x7684;&#x8D1F;&#x8F7D;&#x4E0B;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x3002;</p>
<h2 id="4-2-&#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x7684;&#x6D88;&#x8017;"><a href="#4-2-&#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x7684;&#x6D88;&#x8017;" class="headerlink" title="4.2 &#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x7684;&#x6D88;&#x8017;"></a>4.2 &#x8DDF;&#x8E2A;&#x6536;&#x96C6;&#x7684;&#x6D88;&#x8017;</h2><p>&#x8BFB;&#x51FA;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4E5F;&#x4F1A;&#x5BF9;&#x6B63;&#x5728;&#x88AB;&#x76D1;&#x63A7;&#x7684;&#x8D1F;&#x8F7D;&#x4EA7;&#x751F;&#x5E72;&#x6270;&#x3002;&#x8868;1&#x5C55;&#x793A;&#x7684;&#x662F;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Dapper&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5728;&#x9AD8;&#x4E8E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x7684;&#x8D1F;&#x8F7D;&#x57FA;&#x51C6;&#x4E0B;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x65F6;&#x7684;cpu&#x4F7F;&#x7528;&#x7387;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x8D85;&#x8FC7;0.3%&#x7684;&#x5355;&#x6838;cpu&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x6709;&#x5F88;&#x5C11;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#xFF08;&#x4EE5;&#x53CA;&#x5806;&#x788E;&#x7247;&#x7684;&#x566A;&#x97F3;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9650;&#x5236;&#x4E86;Dapper&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4E3A;&#x5185;&#x6838;scheduler&#x6700;&#x4F4E;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4EE5;&#x9632;&#x5728;&#x4E00;&#x53F0;&#x9AD8;&#x8D1F;&#x8F7D;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x53D1;&#x751F;cpu&#x7ADE;&#x4E89;&#x3002;</p>
<p>Dapper&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x5BBD;&#x8D44;&#x6E90;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;span&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4ED3;&#x5E93;&#x4E2D;&#x4F20;&#x8F93;&#x53EA;&#x5360;&#x7528;&#x4E86;&#x5E73;&#x5747;426&#x7684;byte&#x3002;&#x4F5C;&#x4E3A;&#x7F51;&#x7EDC;&#x884C;&#x4E3A;&#x4E2D;&#x7684;&#x6781;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;Dapper&#x7684;&#x6570;&#x636E;&#x6536;&#x96C6;&#x5728;Google&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53EA;&#x5360;&#x7528;&#x4E86;0.01%&#x7684;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x3002;</p>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/d1a5bd8951b6daa36b80e81dc0289b78ebfb2bcac72db97bf428b920907e09b4" alt><br>&#x8868;1&#xFF1A;Dapper&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5728;&#x8D1F;&#x8F7D;&#x6D4B;&#x8BD5;&#x65F6;&#x7684;CPU&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x7387;</p>
<h2 id="4-3-&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x8D1F;&#x8F7D;&#x7684;&#x5F71;&#x54CD;"><a href="#4-3-&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x8D1F;&#x8F7D;&#x7684;&#x5F71;&#x54CD;" class="headerlink" title="4.3 &#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x8D1F;&#x8F7D;&#x7684;&#x5F71;&#x54CD;"></a>4.3 &#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x8D1F;&#x8F7D;&#x7684;&#x5F71;&#x54CD;</h2><p>&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x90FD;&#x4F1A;&#x5229;&#x7528;&#x5230;&#x5927;&#x91CF;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x7EBF;&#x4E0A;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x6709;&#x6548;&#x8DDF;&#x8E2A;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x9700;&#x6C42;&#x4E4B;&#x4E00;&#xFF1B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x751F;&#x6210;&#x5927;&#x91CF;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x662F;&#x6700;&#x654F;&#x611F;&#x7684;&#x3002;&#x5728;&#x8868;2&#x4E2D;&#x6211;&#x4EEC;&#x7528;&#x96C6;&#x7FA4;&#x4E0B;&#x7684;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x670D;&#x52A1;&#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x6765;&#x8861;&#x91CF;Dapper&#x5728;&#x5EF6;&#x8FDF;&#x548C;&#x541E;&#x5410;&#x91CF;&#x65B9;&#x9762;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/33ddb5e57348f6b9cc4df9ef8e78b752be0271737b41bf05db7bd02c04690051" alt><br>&#x8868;2&#xFF1A;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x91C7;&#x6837;&#x7387;&#x5BF9;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x548C;&#x541E;&#x5410;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5EF6;&#x8FDF;&#x548C;&#x541E;&#x5410;&#x7684;&#x5B9E;&#x9A8C;&#x8BEF;&#x5DEE;&#x5206;&#x522B;&#x662F;2.5%&#x548C;0.15%&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x867D;&#x7136;&#x5BF9;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x660E;&#x663E;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x8DDF;&#x8E2A;&#x7684;&#x91C7;&#x6837;&#x8FD8;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5EF6;&#x8FDF;&#x548C;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5E26;&#x6765;&#x7684;&#x635F;&#x5931;&#x5728;&#x628A;&#x91C7;&#x6837;&#x7387;&#x8C03;&#x6574;&#x5230;&#x5C0F;&#x4E8E;1/16&#x4E4B;&#x540E;&#x5C31;&#x5168;&#x90E8;&#x5728;&#x5B9E;&#x9A8C;&#x8BEF;&#x5DEE;&#x8303;&#x56F4;&#x5185;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5373;&#x4FBF;&#x91C7;&#x6837;&#x7387;&#x8C03;&#x6574;&#x5230;1/1024&#x4ECD;&#x7136;&#x662F;&#x6709;&#x8DB3;&#x591F;&#x91CF;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x7528;&#x6765;&#x8DDF;&#x8E2A;&#x5927;&#x91CF;&#x7684;&#x670D;&#x52A1;&#x3002;&#x4FDD;&#x6301;Dapper&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x57FA;&#x7EBF;&#x5728;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4F4E;&#x7684;&#x6C34;&#x5E73;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3A;&#x90A3;&#x4E9B;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5BBD;&#x677E;&#x7684;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#x5B8C;&#x6574;&#x7684;Annotation API&#x800C;&#x65E0;&#x60E7;&#x6027;&#x80FD;&#x635F;&#x5931;&#x3002;&#x4F7F;&#x7528;&#x8F83;&#x4F4E;&#x7684;&#x91C7;&#x6837;&#x7387;&#x8FD8;&#x6709;&#x989D;&#x5916;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6301;&#x4E45;&#x5316;&#x5230;&#x786C;&#x76D8;&#x4E2D;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x5904;&#x7406;&#x4E4B;&#x524D;&#x4FDD;&#x7559;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x4E3A;Dapper&#x7684;&#x6536;&#x96C6;&#x7EC4;&#x4EF6;&#x7ED9;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<h2 id="4-4-&#x53EF;&#x53D8;&#x91C7;&#x6837;"><a href="#4-4-&#x53EF;&#x53D8;&#x91C7;&#x6837;" class="headerlink" title="4.4 &#x53EF;&#x53D8;&#x91C7;&#x6837;"></a>4.4 &#x53EF;&#x53D8;&#x91C7;&#x6837;</h2><p>&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x8FDB;&#x7A0B;&#x7684;Dapper&#x7684;&#x6D88;&#x8017;&#x548C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x7684;&#x8DDF;&#x8E2A;&#x7684;&#x91C7;&#x6837;&#x7387;&#x6210;&#x6B63;&#x6BD4;&#x3002;Dapper&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x7248;&#x672C;&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x4E0A;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x4E3A;1/1024&#x3002;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#x662F;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x7EBF;&#x4E0A;&#x670D;&#x52A1;&#x6765;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E9B;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x4EF6;(&#x5728;&#x5927;&#x541E;&#x5410;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;)&#x4ECD;&#x7136;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x8DB3;&#x4EE5;&#x88AB;&#x6355;&#x6349;&#x5230;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8F83;&#x4F4E;&#x7684;&#x91C7;&#x6837;&#x7387;&#x548C;&#x8F83;&#x4F4E;&#x7684;&#x4F20;&#x8F93;&#x8D1F;&#x8F7D;&#x4E0B;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8FC7;&#x91CD;&#x8981;&#x4E8B;&#x4EF6;&#xFF0C;&#x800C;&#x60F3;&#x7528;&#x8F83;&#x9AD8;&#x7684;&#x91C7;&#x6837;&#x7387;&#x5C31;&#x9700;&#x8981;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x8986;&#x76D6;&#x9ED8;&#x8BA4;&#x7684;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5E72;&#x9884;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x5728;dapper&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x90E8;&#x7F72;&#x53EF;&#x53D8;&#x91C7;&#x6837;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53C2;&#x6570;&#x5316;&#x914D;&#x7F6E;&#x91C7;&#x6837;&#x7387;&#x65F6;&#xFF0C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x91C7;&#x6837;&#x65B9;&#x6848;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x91C7;&#x6837;&#x671F;&#x671B;&#x7387;&#x6765;&#x6807;&#x8BC6;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x91C7;&#x6837;&#x7684;&#x8FFD;&#x8E2A;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4F4E;&#x6D41;&#x91CF;&#x4F4E;&#x8D1F;&#x8F7D;&#x81EA;&#x52A8;&#x63D0;&#x9AD8;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x800C;&#x5728;&#x9AD8;&#x6D41;&#x91CF;&#x9AD8;&#x8D1F;&#x8F7D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x964D;&#x4F4E;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x4F7F;&#x635F;&#x8017;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x5728;&#x63A7;&#x5236;&#x4E4B;&#x4E0B;&#x3002;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x91C7;&#x6837;&#x7387;&#x4F1A;&#x968F;&#x7740;&#x8DDF;&#x8E2A;&#x672C;&#x8EAB;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x6709;&#x5229;&#x4E8E;&#x4ECE;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4E2D;&#x51C6;&#x786E;&#x7684;&#x5206;&#x6790;&#x3002;</p>
<h2 id="4-5-&#x5E94;&#x5BF9;&#x79EF;&#x6781;&#x91C7;&#x6837;-Coping-with-aggressive-sampling"><a href="#4-5-&#x5E94;&#x5BF9;&#x79EF;&#x6781;&#x91C7;&#x6837;-Coping-with-aggressive-sampling" class="headerlink" title="4.5 &#x5E94;&#x5BF9;&#x79EF;&#x6781;&#x91C7;&#x6837;(Coping with aggressive sampling)"></a>4.5 &#x5E94;&#x5BF9;&#x79EF;&#x6781;&#x91C7;&#x6837;(Coping with aggressive sampling)</h2><p>&#x65B0;&#x7684;Dapper&#x7528;&#x6237;&#x5F80;&#x5F80;&#x89C9;&#x5F97;&#x4F4E;&#x91C7;&#x6837;&#x7387;&#x2013;&#x5728;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x670D;&#x52A1;&#x4E0B;&#x7ECF;&#x5E38;&#x4F4E;&#x81F3;0.01&#xFF05;&#x2013;&#x5C06;&#x4F1A;&#x4E0D;&#x5229;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x5206;&#x6790;&#x3002;&#x6211;&#x4EEC;&#x5728;Google&#x7684;&#x7ECF;&#x9A8C;&#x4F7F;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#xFF0C;&#x5BF9;&#x4E8E;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x670D;&#x52A1;&#xFF0C;&#x79EF;&#x6781;&#x91C7;&#x6837;(aggressive sampling)&#x5E76;&#x4E0D;&#x59A8;&#x788D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5206;&#x6790;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x663E;&#x7740;&#x7684;&#x64CD;&#x4F5C;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E0A;&#x5343;&#x6B21;&#x3002;&#x4F4E;&#x541E;&#x5410;&#x91CF;&#x7684;&#x670D;&#x52A1;&#x2013;&#x4E5F;&#x8BB8;&#x662F;&#x6BCF;&#x79D2;&#x8BF7;&#x6C42;&#x51E0;&#x5341;&#x6B21;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x51E0;&#x5341;&#x4E07;&#x2013;&#x53EF;&#x4EE5;&#x8D1F;&#x62C5;&#x5F97;&#x8D77;&#x8DDF;&#x8E2A;&#x6BCF;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x662F;&#x4FC3;&#x4F7F;&#x6211;&#x4EEC;&#x4E0B;&#x51B3;&#x5FC3;&#x4F7F;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x91C7;&#x6837;&#x7387;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h2 id="4-6-&#x5728;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4E2D;&#x989D;&#x5916;&#x7684;&#x91C7;&#x6837;"><a href="#4-6-&#x5728;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4E2D;&#x989D;&#x5916;&#x7684;&#x91C7;&#x6837;" class="headerlink" title="4.6 &#x5728;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4E2D;&#x989D;&#x5916;&#x7684;&#x91C7;&#x6837;"></a>4.6 &#x5728;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4E2D;&#x989D;&#x5916;&#x7684;&#x91C7;&#x6837;</h2><p>&#x4E0A;&#x8FF0;&#x91C7;&#x6837;&#x673A;&#x5236;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4E0E;Dapper&#x8FD0;&#x884C;&#x5E93;&#x534F;&#x4F5C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x660E;&#x663E;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x3002;Dapper&#x7684;&#x56E2;&#x961F;&#x8FD8;&#x9700;&#x8981;&#x63A7;&#x5236;&#x5199;&#x5165;&#x4E2D;&#x592E;&#x8D44;&#x6599;&#x5E93;&#x7684;&#x6570;&#x636E;&#x7684;&#x603B;&#x89C4;&#x6A21;&#xFF0C;&#x56E0;&#x6B64;&#x4E3A;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7ED3;&#x5408;&#x4E86;&#x4E8C;&#x7EA7;&#x91C7;&#x6837;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x4EA7;&#x96C6;&#x7FA4;&#x6BCF;&#x5929;&#x4EA7;&#x751F;&#x8D85;&#x8FC7;1TB&#x7684;&#x91C7;&#x6837;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x3002;Dapper&#x7684;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4ECE;&#x88AB;&#x8BB0;&#x5F55;&#x4E4B;&#x540E;&#x80FD;&#x4FDD;&#x5B58;&#x81F3;&#x5C11;&#x4E24;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x9010;&#x6E10;&#x589E;&#x957F;&#x7684;&#x8FFD;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x5BC6;&#x5EA6;&#x5FC5;&#x987B;&#x548C;Dapper&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x6240;&#x6D88;&#x8017;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53CA;&#x786C;&#x76D8;&#x5B58;&#x50A8;&#x8FDB;&#x884C;&#x6743;&#x8861;&#x3002;&#x5BF9;&#x8BF7;&#x6C42;&#x7684;&#x9AD8;&#x91C7;&#x6837;&#x7387;&#x8FD8;&#x4F7F;&#x5F97;Dapper&#x6536;&#x96C6;&#x5668;&#x63A5;&#x8FD1;&#x5199;&#x5165;&#x541E;&#x5410;&#x91CF;&#x7684;&#x4E0A;&#x9650;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7EF4;&#x6301;&#x7269;&#x8D28;&#x8D44;&#x6E90;&#x7684;&#x9700;&#x6C42;&#x548C;&#x6E10;&#x589E;&#x7684;Bigtable&#x7684;&#x541E;&#x5410;&#x4E4B;&#x95F4;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x81EA;&#x8EAB;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x989D;&#x5916;&#x7684;&#x91C7;&#x6837;&#x7387;&#x7684;&#x652F;&#x6301;&#x3002;&#x6211;&#x4EEC;&#x5145;&#x5206;&#x5229;&#x7528;&#x6240;&#x6709;span&#x90FD;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8DDF;&#x8E2A;&#x5E76;&#x5206;&#x4EAB;&#x540C;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;ID&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x4E9B;span&#x6709;&#x53EF;&#x80FD;&#x6A2A;&#x8DE8;&#x4E86;&#x6570;&#x5343;&#x4E2A;&#x4E3B;&#x673A;&#x3002;&#x5BF9;&#x4E8E;&#x5728;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;span&#xFF0C;&#x6211;&#x4EEC;&#x7528;hash&#x7B97;&#x6CD5;&#x628A;&#x8DDF;&#x8E2A;ID&#x8F6C;&#x6210;&#x4E00;&#x4E2A;&#x6807;&#x91CF;Z&#xFF0C;&#x8FD9;&#x91CC;0&lt;=Z&lt;=1&#x3002;&#x5982;&#x679C;Z&#x6BD4;&#x6211;&#x4EEC;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x7CFB;&#x6570;&#x4F4E;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4FDD;&#x7559;&#x8FD9;&#x4E2A;span&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x5199;&#x5165;&#x5230;Bigtable&#x4E2D;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x629B;&#x5F03;&#x4ED6;&#x3002;&#x901A;&#x8FC7;&#x5728;&#x91C7;&#x6837;&#x51B3;&#x7B56;&#x4E2D;&#x7684;&#x8DDF;&#x8E2A;ID&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4E48;&#x4FDD;&#x5B58;&#x3001;&#x8981;&#x4E48;&#x629B;&#x5F03;&#x6574;&#x4E2A;&#x8DDF;&#x8E2A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x72EC;&#x5904;&#x7406;&#x8DDF;&#x8E2A;&#x5185;&#x7684;span&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x4F7F;&#x7BA1;&#x7406;&#x6211;&#x4EEC;&#x7684;&#x6536;&#x96C6;&#x7BA1;&#x9053;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x8C03;&#x6574;&#x6211;&#x4EEC;&#x7684;&#x5168;&#x5C40;&#x5199;&#x5165;&#x7387;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6574;&#x4E2A;&#x8DDF;&#x8E2A;&#x8FC7;&#x7A0B;&#x548C;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x91C7;&#x6837;&#x7387;&#x53C2;&#x6570;&#x786E;&#x5B9E;&#x4F1A;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5C31;&#x4E0D;&#x80FD;&#x5E94;&#x5BF9;&#x5FEB;&#x901F;&#x8C03;&#x6574;&#x5728;&#x6240;&#x6709;&#x90E8;&#x7F72;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x91C7;&#x6837;&#x7387;&#x914D;&#x7F6E;&#x7684;&#x8FD9;&#x4E2A;&#x8981;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x8FD0;&#x884C;&#x671F;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4F18;&#x96C5;&#x7684;&#x53BB;&#x6389;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5199;&#x5165;&#x5230;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x591A;&#x4F59;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x8282;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E8C;&#x7EA7;&#x91C7;&#x6837;&#x7387;&#x7CFB;&#x6570;&#x6765;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x8FD0;&#x884C;&#x671F;&#x91C7;&#x6837;&#x7387;&#x3002;Dapper&#x7684;&#x7BA1;&#x9053;&#x7EF4;&#x62A4;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x6211;&#x4EEC;&#x7684;&#x4E8C;&#x7EA7;&#x91C7;&#x6837;&#x7387;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x76F4;&#x63A5;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x5C11;&#x6211;&#x4EEC;&#x7684;&#x5168;&#x5C40;&#x8986;&#x76D6;&#x7387;&#x548C;&#x5199;&#x5165;&#x901F;&#x5EA6;&#x3002;</p>
<ol start="5">
<li>&#x901A;&#x7528;&#x7684;Dapper&#x5DE5;&#x5177;</li>
</ol>
<hr>
<p>&#x51E0;&#x5E74;&#x524D;&#xFF0C;&#x5F53;Dapper&#x8FD8;&#x53EA;&#x662F;&#x4E2A;&#x539F;&#x578B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5728;Dapper&#x5F00;&#x53D1;&#x8005;&#x8010;&#x5FC3;&#x7684;&#x652F;&#x6301;&#x4E0B;&#x4F7F;&#x7528;&#x3002;&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#xFF0C;&#x6211;&#x4EEC;&#x9010;&#x6E10;&#x8FED;&#x4EE3;&#x7684;&#x5EFA;&#x7ACB;&#x4E86;&#x6536;&#x96C6;&#x7EC4;&#x4EF6;&#xFF0C;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#xFF0C;&#x548C;&#x57FA;&#x4E8E;Web&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF0C;&#x5E2E;&#x52A9;Dapper&#x7684;&#x7528;&#x6237;&#x72EC;&#x7ACB;&#x89E3;&#x51B3;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x54EA;&#x4E9B;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x7528;&#xFF0C;&#x54EA;&#x4E9B;&#x7528;&#x5904;&#x4E0D;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x63D0;&#x4F9B;&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x7684;&#x57FA;&#x672C;&#x7684;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="5-1-Dapper-Depot-API"><a href="#5-1-Dapper-Depot-API" class="headerlink" title="5.1 Dapper Depot API"></a>5.1 Dapper Depot API</h2><p>Dapper&#x7684;&#x201C;Depot API&#x201D;&#x6216;&#x79F0;&#x4F5C;DAPI&#xFF0C;&#x63D0;&#x4F9B;&#x5728;Dapper&#x7684;&#x533A;&#x57DF;&#x4ED3;&#x5E93;&#x4E2D;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x4E00;&#x4E2A;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x3002;DAPI&#x548C;Dapper&#x8DDF;&#x8E2A;&#x4ED3;&#x5E93;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x4E32;&#x8054;&#x7684;&#xFF0C;&#x800C;&#x4E14;DAPI&#x610F;&#x5473;&#x7740;&#x5BF9;Dapper&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x5143;&#x6570;&#x636E;&#x66B4;&#x9732;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x548C;&#x76F4;&#x89C2;&#x7684;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4EE5;&#x4E0B;&#x63A8;&#x8350;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x53BB;&#x66B4;&#x9732;&#x8FD9;&#x6837;&#x7684;&#x63A5;&#x53E3;&#xFF1A;</p>
<ul>
<li>&#x901A;&#x8FC7;&#x8DDF;&#x8E2A;ID&#x6765;&#x8BBF;&#x95EE;&#xFF1A;DAPI&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4ED6;&#x7684;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x7684;&#x8DDF;&#x8E2A;ID&#x8BFB;&#x53D6;&#x4EFB;&#x4F55;&#x4E00;&#x6B21;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x6279;&#x91CF;&#x8BBF;&#x95EE;&#xFF1A;DAPI&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;MapReduce&#x63D0;&#x4F9B;&#x5BF9;&#x4E0A;&#x4EBF;&#x6761;Dapper&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x5E76;&#x884C;&#x8BFB;&#x53D6;&#x3002;&#x7528;&#x6237;&#x91CD;&#x5199;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x4F5C;&#x4E3A;&#x5176;&#x552F;&#x4E00;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8BE5;&#x6846;&#x67B6;&#x5C06;&#x5728;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x4E2D;&#x8C03;&#x7528;&#x6BCF;&#x4E00;&#x6B21;&#x6536;&#x96C6;&#x5230;&#x7684;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x7D22;&#x5F15;&#x8BBF;&#x95EE;&#xFF1A;Dapper&#x7684;&#x4ED3;&#x5E93;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x901A;&#x7528;&#x8C03;&#x7528;&#x6A21;&#x677F;&#x7684;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002;&#x8BE5;&#x7D22;&#x5F15;&#x6839;&#x636E;&#x901A;&#x7528;&#x8BF7;&#x6C42;&#x8DDF;&#x8E2A;&#x7279;&#x6027;(commonly-requested trace features)&#x8FDB;&#x884C;&#x7ED8;&#x5236;&#x6765;&#x8BC6;&#x522B;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x3002;&#x56E0;&#x4E3A;&#x8DDF;&#x8E2A;ID&#x662F;&#x6839;&#x636E;&#x4F2A;&#x968F;&#x673A;&#x7684;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x53BB;&#x8BBF;&#x95EE;&#x8DDF;&#x67D0;&#x4E2A;&#x670D;&#x52A1;&#x6216;&#x4E3B;&#x673A;&#x76F8;&#x5173;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x3002;</li>
</ul>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E09;&#x79CD;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x628A;&#x7528;&#x6237;&#x6307;&#x5411;&#x4E0D;&#x540C;&#x7684;Dapper&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x3002;&#x6B63;&#x5982;&#x7B2C;2.1&#x8282;&#x6240;&#x8FF0;&#x7684;&#xFF0C;Dapper&#x7684;&#x7531;span&#x7EC4;&#x6210;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x662F;&#x7528;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x5EFA;&#x6A21;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7531;span&#x7EC4;&#x6210;&#x904D;&#x5386;&#x6811;&#x3002;Span&#x5C31;&#x76F8;&#x5F53;&#x4E8E;RPC&#x8C03;&#x7528;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;RPC&#x7684;&#x65F6;&#x95F4;&#x4FE1;&#x606F;&#x662F;&#x53EF;&#x7528;&#x7684;&#x3002;&#x5E26;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x7279;&#x6B8A;&#x7684;&#x5E94;&#x7528;&#x6807;&#x6CE8;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;span&#x7ED3;&#x6784;&#x6765;&#x8BBF;&#x95EE;&#x7684;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7D22;&#x5F15;&#x662F;DAPI&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x5177;&#x6311;&#x6218;&#x6027;&#x7684;&#x90E8;&#x5206;&#x3002;&#x538B;&#x7F29;&#x5B58;&#x50A8;&#x8981;&#x6C42;&#x5728;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x79CD;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7684;&#x60C5;&#x51B5;&#x53EA;&#x6BD4;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x5C0F;26%&#xFF0C;&#x6240;&#x4EE5;&#x6D88;&#x8017;&#x662F;&#x5DE8;&#x5927;&#x7684;&#x3002;&#x6700;&#x521D;&#xFF0C;&#x6211;&#x4EEC;&#x90E8;&#x7F72;&#x4E86;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x4E3B;&#x673A;&#x7D22;&#x5F15;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x670D;&#x52A1;&#x540D;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x4E3B;&#x673A;&#x7D22;&#x5F15;&#x548C;&#x5B58;&#x50A8;&#x6210;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x5229;&#x5BB3;&#x5173;&#x7CFB;&#x3002;&#x5F53;&#x7528;&#x6237;&#x5BF9;&#x6BCF;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4F1A;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x628A;&#x4E24;&#x8005;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4EE5;&#x670D;&#x52A1;&#x540D;&#x79F0;&#xFF0C;&#x4E3B;&#x673A;&#xFF0C;&#x548C;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x67E5;&#x627E;&#x3002;</p>
<h2 id="5-1-1-DAPI&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x4F7F;&#x7528;"><a href="#5-1-1-DAPI&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="5.1.1 DAPI&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x4F7F;&#x7528;"></a>5.1.1 DAPI&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x4F7F;&#x7528;</h2><p>DAPI&#x5728;&#x8C37;&#x6B4C;&#x7684;&#x4F7F;&#x7528;&#x6709;&#x4E09;&#x7C7B;&#xFF1A;&#x4F7F;&#x5229;&#x7528;DAPI&#x7684;&#x6301;&#x7EED;&#x7684;&#x7EBF;&#x4E0A;Web&#x5E94;&#x7528;&#xFF0C;&#x7EF4;&#x62A4;&#x826F;&#x597D;&#x7684;&#x53EF;&#x4EE5;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x4E0A;&#x8C03;&#x7528;&#x7684;&#x57FA;&#x4E8E;DAPI&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x5199;&#x5165;&#xFF0C;&#x8FD0;&#x884C;&#x3001;&#x4E0D;&#x8FC7;&#x5927;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x88AB;&#x5FD8;&#x8BB0;&#x4E86;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7684;&#x6709;3&#x4E2A;&#x6301;&#x4E45;&#x6027;&#x7684;&#x57FA;&#x4E8E;DAPI&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;8&#x4E2A;&#x989D;&#x5916;&#x7684;&#x6309;&#x9700;&#x5B9A;&#x5236;&#x7684;&#x57FA;&#x4E8E;DAPI&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;DAPI&#x6846;&#x67B6;&#x6784;&#x5EFA;&#x7684;&#x7EA6;15~20&#x4E00;&#x6B21;&#x6027;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x3002;&#x5728;&#x8FD9;&#x4E4B;&#x540E;&#x7684;&#x5DE5;&#x5177;&#x5C31;&#x8FD9;&#x662F;&#x5F88;&#x96BE;&#x8BF4;&#x660E;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x3001;&#x8FD0;&#x884C;&#x548C;&#x4E22;&#x5F03;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;Dapper&#x56E2;&#x961F;&#x7684;&#x6280;&#x672F;&#x652F;&#x6301;&#x3002;</p>
<h2 id="5-2-Dapper&#x7684;&#x7528;&#x6237;&#x63A5;&#x53E3;"><a href="#5-2-Dapper&#x7684;&#x7528;&#x6237;&#x63A5;&#x53E3;" class="headerlink" title="5.2 Dapper&#x7684;&#x7528;&#x6237;&#x63A5;&#x53E3;"></a>5.2 Dapper&#x7684;&#x7528;&#x6237;&#x63A5;&#x53E3;</h2><p>&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x53D1;&#x751F;&#x5728;&#x57FA;&#x4E8E;web&#x7684;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x63A5;&#x53E3;&#x3002;&#x7BC7;&#x5E45;&#x6709;&#x9650;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5217;&#x51FA;&#x6BCF;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x800C;&#x53EA;&#x80FD;&#x628A;&#x5178;&#x578B;&#x7684;&#x7528;&#x6237;&#x5DE5;&#x4F5C;&#x6D41;&#x5728;&#x56FE;6&#x4E2D;&#x5C55;&#x793A;&#x3002;</p>
<p> <img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/b41f70334c63d7764d52713e71c0283b177041bc3188df7f80593b06a12ef09c" alt><br>&#x56FE;6</p>
<ol>
<li>&#x7528;&#x6237;&#x63CF;&#x8FF0;&#x7684;&#x4ED6;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x670D;&#x52A1;&#x548C;&#x65F6;&#x95F4;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x533A;&#x5206;&#x8DDF;&#x8E2A;&#x6A21;&#x677F;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;span&#x7684;&#x540D;&#x79F0;&#xFF09;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x641C;&#x7D22;&#x6700;&#x76F8;&#x5173;&#x7684;&#x6210;&#x672C;&#x5EA6;&#x91CF;(cost metric)(&#x6BD4;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x54CD;&#x5E94;&#x65F6;&#x95F4;)&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x6027;&#x80FD;&#x6982;&#x8981;&#x7684;&#x5927;&#x8868;&#x683C;&#xFF0C;&#x5BF9;&#x5E94;&#x786E;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x5173;&#x8054;&#x7684;&#x6240;&#x6709;&#x5206;&#x5E03;&#x5F0F;&#x5904;&#x7406;&#x56FE;&#x8868;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E9B;&#x6267;&#x884C;&#x56FE;&#x6807;&#x6392;&#x5E8F;&#x6210;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x5E76;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x76F4;&#x65B9;&#x56FE;&#x53BB;&#x5C55;&#x73B0;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#x3002;</li>
<li>&#x4E00;&#x65E6;&#x67D0;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;&#x90E8;&#x5206;&#x88AB;&#x9009;&#x4E2D;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x80FD;&#x770B;&#x5230;&#x5173;&#x4E8E;&#x6267;&#x884C;&#x90E8;&#x5206;&#x7684;&#x7684;&#x56FE;&#x5F62;&#x5316;&#x63CF;&#x8FF0;&#x3002;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x88AB;&#x9AD8;&#x4EAE;&#x5C55;&#x793A;&#x5728;&#x8BE5;&#x56FE;&#x7684;&#x4E2D;&#x5FC3;&#x3002;</li>
<li>&#x5728;&#x751F;&#x6210;&#x4E0E;&#x6B65;&#x9AA4;1&#x4E2D;&#x9009;&#x4E2D;&#x7684;&#x6210;&#x672C;&#x5EA6;&#x91CF;(cost metric)&#x7EF4;&#x5EA6;&#x76F8;&#x5173;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x4E4B;&#x540E;&#xFF0C;Dapper&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x4F1A;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x76F4;&#x65B9;&#x56FE;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x6240;&#x9009;&#x4E2D;&#x90E8;&#x5206;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5206;&#x5E03;&#x56FE;&#x3002;&#x7528;&#x6237;&#x8FD8;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5C55;&#x73B0;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x5728;&#x76F4;&#x65B9;&#x56FE;&#x4E2D;&#x88AB;&#x5212;&#x5206;&#x4E3A;&#x7684;&#x4E0D;&#x540C;&#x533A;&#x57DF;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x5217;&#x8868;&#x79CD;&#x7B2C;&#x4E8C;&#x4E2A;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x5B9E;&#x4F8B;&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x4E0B;&#x65B9;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x7684;&#x8BE6;&#x7EC6;&#x89C6;&#x56FE;(&#x6B65;&#x9AA4;5)&#x3002;</li>
<li>&#x7EDD;&#x5927;&#x591A;&#x6570;Dapper&#x7684;&#x4F7F;&#x7528;&#x8005;&#x6700;&#x7EC8;&#x7684;&#x4F1A;&#x68C0;&#x67E5;&#x67D0;&#x4E2A;&#x8DDF;&#x8E2A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x6536;&#x96C6;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x53BB;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x7684;&#x6839;&#x6E90;&#x6240;&#x5728;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x505A;&#x8DDF;&#x8E2A;&#x89C6;&#x56FE;&#x7684;&#x5BA1;&#x67E5;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7531;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x65F6;&#x95F4;&#x8F74;&#xFF08;&#x5728;&#x4E0A;&#x65B9;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF09;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x5C55;&#x5F00;&#x548C;&#x6298;&#x53E0;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E5F;&#x5F88;&#x6709;&#x7279;&#x70B9;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x6811;&#x7684;&#x8FDE;&#x7EED;&#x5C42;&#x7528;&#x5185;&#x5D4C;&#x7684;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x77E9;&#x5F62;&#x8868;&#x793A;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;RPC&#x7684;span&#x88AB;&#x4ECE;&#x65F6;&#x95F4;&#x4E0A;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6D88;&#x8017;&#xFF08;&#x7EFF;&#x8272;&#x90E8;&#x5206;&#xFF09;&#x548C;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x6D88;&#x8017;&#xFF08;&#x84DD;&#x8272;&#x90E8;&#x5206;&#xFF09;&#x3002;&#x7528;&#x6237;Annotation&#x6CA1;&#x6709;&#x663E;&#x793A;&#x5728;&#x8FD9;&#x4E2A;&#x622A;&#x56FE;&#x4E2D;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x7684;&#x4EE5;span&#x7684;&#x5F62;&#x5F0F;&#x5305;&#x542B;&#x5728;&#x5168;&#x5C40;&#x65F6;&#x95F4;&#x8F74;&#x4E0A;&#x3002;</li>
</ol>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x7528;&#x6237;&#x67E5;&#x8BE2;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#xFF0C;Dapper&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x4E0E;Dapper&#x6BCF;&#x4E00;&#x53F0;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x5728;&#x8BE5;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x6307;&#x671B;&#x80FD;&#x770B;&#x5230;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x56FE;&#x8868;&#x5C55;&#x793A;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x57FA;&#x4E8E;&#x6027;&#x80FD;&#x548C;&#x7F51;&#x7EDC;&#x7279;&#x6027;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8DDF;&#x8E2A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x53EF;&#x5728;&#x51E0;&#x79D2;&#x949F;&#x5185;&#x67E5;&#x5230;&#x5B9E;&#x65F6;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6839;&#x636E;&#x6211;&#x4EEC;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5927;&#x7EA6;&#x6709;200&#x4E2A;&#x4E0D;&#x540C;&#x7684;Google&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x4E00;&#x5929;&#x5185;&#x4F7F;&#x7528;&#x7684;Dapper&#x7684;UI;&#x5728;&#x4E00;&#x5468;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5927;&#x7EA6;&#x6709;750-1000&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x3002;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x6570;&#xFF0C;&#x5728;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x5185;&#x90E8;&#x901A;&#x544A;&#x4E0A;&#xFF0C;&#x662F;&#x6309;&#x6708;&#x8FDE;&#x7EED;&#x7684;&#x3002;&#x901A;&#x5E38;&#x7528;&#x6237;&#x4F1A;&#x53D1;&#x9001;&#x7279;&#x5B9A;&#x8DDF;&#x8E2A;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x5C06;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x5728;&#x67E5;&#x8BE2;&#x8DDF;&#x8E2A;&#x60C5;&#x51B5;&#x65F6;&#x4E2D;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x4E00;&#x6B21;&#x6027;&#x7684;&#xFF0C;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8F83;&#x77ED;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<ol start="6">
<li>&#x7ECF;&#x9A8C;</li>
</ol>
<hr>
<p>Dapper&#x5728;Google&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x76F4;&#x63A5;&#x901A;&#x8FC7;Dapper&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x95F4;&#x63A5;&#x5730;&#x901A;&#x8FC7;&#x5BF9;Dapper API&#x7684;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x6216;&#x8005;&#x5EFA;&#x7ACB;&#x5728;&#x57FA;&#x4E8E;api&#x7684;&#x5E94;&#x7528;&#x4E0A;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x7F57;&#x5217;&#x51FA;&#x6BCF;&#x4E00;&#x79CD;&#x5DF2;&#x77E5;&#x7684;Dapper&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x8BD5;&#x56FE;&#x8986;&#x76D6;Dapper&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x7684;&#x201C;&#x57FA;&#x672C;&#x5411;&#x91CF;&#x201D;&#xFF0C;&#x5E76;&#x52AA;&#x529B;&#x6765;&#x8BF4;&#x660E;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5E94;&#x7528;&#x662F;&#x6700;&#x6210;&#x529F;&#x7684;&#x3002;</p>
<h2 id="6-1-&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;Dapper"><a href="#6-1-&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;Dapper" class="headerlink" title="6.1 &#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;Dapper"></a>6.1 &#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;Dapper</h2><p>Google AdWords&#x7CFB;&#x7EDF;&#x662F;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x5B9A;&#x4F4D;&#x51C6;&#x5219;&#x548C;&#x76F8;&#x5173;&#x6587;&#x5B57;&#x5E7F;&#x544A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x642D;&#x5EFA;&#x7684;&#x3002;&#x5F53;&#x65B0;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6216;&#x5E7F;&#x544A;&#x88AB;&#x63D2;&#x5165;&#x6216;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7B56;&#x7565;&#x672F;&#x8BED;&#x7684;&#x68C0;&#x67E5;&#xFF08;&#x5982;&#x68C0;&#x67E5;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x590D;&#x67E5;&#x7CFB;&#x7EDF;&#x6765;&#x505A;&#x7684;&#x8BDD;&#x4F1A;&#x66F4;&#x52A0;&#x6709;&#x6548;&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x8F6E;&#x5230;&#x4ECE;&#x5934;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x8FED;&#x4EE3;&#x7684;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x539F;&#x578B;&#x5F00;&#x59CB;&#x4F7F;&#x7528;Dapper&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x6700;&#x7EC8;&#x7528;Dapper&#x4E00;&#x76F4;&#x7EF4;&#x62A4;&#x7740;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x3002;Dapper&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x4ECE;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x6539;&#x8FDB;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#xFF1A;</p>
<ul>
<li>&#x6027;&#x80FD;&#xFF1A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9488;&#x5BF9;&#x8BF7;&#x6C42;&#x5EF6;&#x8FDF;&#x7684;&#x76EE;&#x6807;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x5E76;&#x5BF9;&#x5BB9;&#x6613;&#x4F18;&#x5316;&#x7684;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x5B9A;&#x4F4D;&#x3002;Dapper&#x4E5F;&#x88AB;&#x7528;&#x6765;&#x786E;&#x5B9A;&#x5728;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E0A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E32;&#x884C;&#x8BF7;&#x6C42;&#x2013;&#x901A;&#x5E38;&#x6765;&#x6E90;&#x4E8E;&#x4E0D;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x2013;&#x5E76;&#x4FC3;&#x4F7F;&#x56E2;&#x961F;&#x6301;&#x7EED;&#x4FEE;&#x590D;&#x4ED6;&#x4EEC;&#x3002;</li>
<li>&#x6B63;&#x786E;&#x6027;&#xFF1A;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x670D;&#x52A1;&#x56F4;&#x7ED5;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x642D;&#x5EFA;&#x3002;&#x7CFB;&#x7EDF;&#x540C;&#x65F6;&#x5177;&#x6709;&#x53EA;&#x8BFB;&#x526F;&#x672C;&#x7B56;&#x7565;&#xFF08;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5EC9;&#x4EF7;&#xFF09;&#x548C;&#x8BFB;&#x5199;&#x7684;&#x4E3B;&#x7B56;&#x7565;&#xFF08;&#x8BBF;&#x95EE;&#x4EE3;&#x4EF7;&#x9AD8;&#xFF09;&#x3002;Dapper&#x88AB;&#x7528;&#x6765;&#x5728;&#x5F88;&#x591A;&#x79CD;&#x60C5;&#x51B5;&#x4E2D;&#x786E;&#x5B9A;&#xFF0C;&#x54EA;&#x4E9B;&#x67E5;&#x8BE2;&#x662F;&#x65E0;&#x9700;&#x901A;&#x8FC7;&#x4E3B;&#x7B56;&#x7565;&#x8BBF;&#x95EE;&#x800C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x526F;&#x672C;&#x7B56;&#x7565;&#x8BBF;&#x95EE;&#x3002;Dapper&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8D1F;&#x8D23;&#x76D1;&#x63A7;&#x54EA;&#x4E9B;&#x4E3B;&#x7B56;&#x7565;&#x88AB;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#xFF0C;&#x5E76;&#x5BF9;&#x91CD;&#x8981;&#x7684;&#x7CFB;&#x7EDF;&#x5E38;&#x91CF;&#x8FDB;&#x884C;&#x4FDD;&#x969C;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x6027;&#xFF1A;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x67E5;&#x8BE2;&#x8DE8;&#x8D8A;&#x4E86;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5305;&#x62EC;BigTable&#x2014;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x591A;&#x7EF4;&#x7D22;&#x5F15;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x5404;&#x79CD;C++&#x548C;Java&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x3002;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x7528;&#x6765;&#x8BC4;&#x4F30;&#x603B;&#x67E5;&#x8BE2;&#x6210;&#x672C;&#xFF0C;&#x4FC3;&#x8FDB;&#x91CD;&#x65B0;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x7528;&#x4EE5;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x4E0A;&#x51CF;&#x5C11;&#x8D1F;&#x8F7D;&#x3002;</li>
<li>&#x6D4B;&#x8BD5;&#xFF1A;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x7248;&#x672C;&#x4F1A;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;Dapper&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x7684;QA&#x8FC7;&#x7A0B;&#xFF0C;&#x7528;&#x6765;&#x9A8C;&#x8BC1;&#x6B63;&#x786E;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x548C;&#x6027;&#x80FD;&#x3002;&#x5728;&#x8DD1;&#x6D4B;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x80FD;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x6765;&#x81EA;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x7CFB;&#x7EDF;&#x81EA;&#x8EAB;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x662F;&#x4ED6;&#x7684;&#x4F9D;&#x8D56;&#x5305;&#x3002;</li>
</ul>
<p>&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x56E2;&#x961F;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E86;Dapper Annotation API&#x3002;Guice[13]&#x5F00;&#x6E90;&#x7684;AOP&#x6846;&#x67B6;&#x7528;&#x6765;&#x5728;&#x91CD;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#x7EC4;&#x4EF6;&#x4E0A;&#x6807;&#x6CE8;&#x201C;@Traced&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x88AB;&#x6807;&#x6CE8;&#xFF0C;&#x5305;&#x542B;&#xFF1A;&#x91CD;&#x8981;&#x5B50;&#x8DEF;&#x5F84;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x3001;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#x3001;&#x5176;&#x4ED6;&#x8C03;&#x8BD5;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5C06;&#x4F1A;&#x989D;&#x5916;&#x53D1;&#x9001;&#x5230;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x5C0F;&#x7EC4;&#x5728;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4ED6;&#x4EEC;&#x60F3;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x6240;&#x6709;&#x8DDF;&#x8E2A;&#x7684;Annotation&#x4FE1;&#x606F;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x4EA4;&#x4E92;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x8FDB;&#x884C;&#x641C;&#x7D22;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x5C31;&#x5FC5;&#x987B;&#x8DD1;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;MapReduce&#x6216;&#x8FDB;&#x884C;&#x6BCF;&#x4E00;&#x4E2A;&#x8DDF;&#x8E2A;&#x7684;&#x624B;&#x52A8;&#x68C0;&#x67E5;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;Google&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x4E5F;&#x4ECE;&#x901A;&#x7528;&#x8C03;&#x8BD5;&#x65E5;&#x5FD7;&#x4E2D;&#x6536;&#x96C6;&#x548C;&#x96C6;&#x4E2D;&#x4FE1;&#x606F;&#xFF0C;&#x628A;&#x90A3;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x548C;Dapper&#x4ED3;&#x5E93;&#x6574;&#x5408;&#x4E5F;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x56E2;&#x961F;&#x4ECD;&#x7136;&#x5BF9;Dapper&#x7684;&#x4F5C;&#x7528;&#x8FDB;&#x884C;&#x4E86;&#x4EE5;&#x4E0B;&#x8BC4;&#x4F30;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5EF6;&#x8FDF;&#x6027;&#x5DF2;&#x7ECF;&#x4F18;&#x5316;&#x4E86;&#x4E24;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;</p>
<h2 id="6-1-1-&#x4E0E;&#x5F02;&#x5E38;&#x76D1;&#x63A7;&#x7684;&#x96C6;&#x6210;"><a href="#6-1-1-&#x4E0E;&#x5F02;&#x5E38;&#x76D1;&#x63A7;&#x7684;&#x96C6;&#x6210;" class="headerlink" title="6.1.1 &#x4E0E;&#x5F02;&#x5E38;&#x76D1;&#x63A7;&#x7684;&#x96C6;&#x6210;"></a>6.1.1 &#x4E0E;&#x5F02;&#x5E38;&#x76D1;&#x63A7;&#x7684;&#x96C6;&#x6210;</h2><p>Google&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x4ECE;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E0D;&#x65AD;&#x6536;&#x96C6;&#x5E76;&#x96C6;&#x4E2D;&#x5F02;&#x5E38;&#x4FE1;&#x606F;&#x62A5;&#x544A;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x5728;Dapper&#x8DDF;&#x8E2A;&#x91C7;&#x6837;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x76F8;&#x5E94;&#x7684;&#x8DDF;&#x8E2A;ID&#x548C;span&#x7684;ID&#x4E5F;&#x4F1A;&#x4F5C;&#x4E3A;&#x5143;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x5728;&#x5F02;&#x5E38;&#x62A5;&#x544A;&#x4E2D;&#x3002;&#x5F02;&#x5E38;&#x76D1;&#x6D4B;&#x670D;&#x52A1;&#x7684;&#x524D;&#x7AEF;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#xFF0C;&#x4ECE;&#x7279;&#x5B9A;&#x7684;&#x5F02;&#x5E38;&#x4FE1;&#x606F;&#x7684;&#x62A5;&#x544A;&#x76F4;&#x63A5;&#x5BFC;&#x5411;&#x5230;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x3002;&#x5E7F;&#x544A;&#x5BA1;&#x67E5;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;bug&#x53D1;&#x751F;&#x7684;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x901A;&#x8FC7;&#x66B4;&#x9732;&#x57FA;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x552F;&#x4E00;ID&#x6784;&#x5EFA;&#x7684;&#x63A5;&#x53E3;&#xFF0C;Dapper&#x5E73;&#x53F0;&#x88AB;&#x96C6;&#x6210;&#x5230;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x76D1;&#x6D4B;&#x7CFB;&#x7EDF;&#x4F1A;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x3002;</p>
<h2 id="6-2-&#x89E3;&#x51B3;&#x5EF6;&#x8FDF;&#x7684;&#x957F;&#x5C3E;&#x6548;&#x5E94;"><a href="#6-2-&#x89E3;&#x51B3;&#x5EF6;&#x8FDF;&#x7684;&#x957F;&#x5C3E;&#x6548;&#x5E94;" class="headerlink" title="6.2 &#x89E3;&#x51B3;&#x5EF6;&#x8FDF;&#x7684;&#x957F;&#x5C3E;&#x6548;&#x5E94;"></a>6.2 &#x89E3;&#x51B3;&#x5EF6;&#x8FDF;&#x7684;&#x957F;&#x5C3E;&#x6548;&#x5E94;</h2><p>&#x8003;&#x8651;&#x5230;&#x79FB;&#x52A8;&#x90E8;&#x4EF6;&#x7684;&#x6570;&#x91CF;&#x3001;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x89C4;&#x6A21;&#x3001;&#x90E8;&#x7F72;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x8C03;&#x8BD5;&#x4E00;&#x4E2A;&#x50CF;&#x5168;&#x6587;&#x641C;&#x7D22;&#x90A3;&#x6837;&#x670D;&#x52A1;&#xFF08;&#x7B2C;1&#x8282;&#x91CC;&#x63D0;&#x5230;&#x8FC7;&#xFF09;&#x662F;&#x975E;&#x5E38;&#x5177;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x4E86;&#x6211;&#x4EEC;&#x5728;&#x51CF;&#x8F7B;&#x5168;&#x6587;&#x641C;&#x7D22;&#x7684;&#x5EF6;&#x8FDF;&#x5206;&#x5E03;&#x7684;&#x957F;&#x5C3E;&#x6548;&#x5E94;&#x4E0A;&#x505A;&#x7684;&#x5404;&#x79CD;&#x52AA;&#x529B;&#x3002;Dapper&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5EF6;&#x8FDF;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x66F4;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#xFF0C;Dapper&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x5BF9;&#x4E8E;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x7684;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0D;&#x4EC5;&#x6D89;&#x53CA;&#x6570;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x662F;&#x51E0;&#x5341;&#x4E2A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7AEF;&#x5230;&#x7AEF;&#x6027;&#x80FD;&#x8F83;&#x5DEE;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x5230;&#x5E95;&#x5728;&#x54EA;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5373;&#x4F7F;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x597D;&#x7684;&#x548C;&#x6700;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x56DE;&#x7B54;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Dapper&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6025;&#x9700;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x5BF9;&#x8BB8;&#x591A;&#x91CD;&#x8981;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/2778619cec249147376e1af27fdd4f6a5807445294e4b8ff40adf61d52b69d0d" alt><br>&#x56FE;7&#xFF1A;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x7684;&#x8DDF;&#x8E2A;&#x7247;&#x6BB5;&#xFF0C;&#x5728;&#x4E0D;&#x5E38;&#x9047;&#x5230;&#x9AD8;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x6CBF;&#x7740;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#x5EF6;&#x8FDF;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>&#x5728;&#x8C03;&#x8BD5;&#x5EF6;&#x8FDF;&#x957F;&#x5C3E;&#x6548;&#x5E94;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x5E93;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x578B;&#x5E93;&#x53EF;&#x4EE5;&#x6839;&#x636E;DAPI&#x8DDF;&#x8E2A;&#x5BF9;&#x8C61;&#x6765;&#x63A8;&#x65AD;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x5C42;&#x7EA7;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x8BCA;&#x65AD;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x5168;&#x6587;&#x641C;&#x7D22;&#x63D0;&#x4F9B;&#x53EF;&#x4F18;&#x5148;&#x5904;&#x7406;&#x7684;&#x9884;&#x671F;&#x7684;&#x6027;&#x80FD;&#x6539;&#x8FDB;&#x3002;Dapper&#x7684;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x5BFC;&#x81F4;&#x4E86;&#x4E0B;&#x5217;&#x53D1;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x77ED;&#x6682;&#x7684;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x9000;&#x5316;&#x4E0D;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5EF6;&#x8FDF;&#x5F02;&#x5E38;&#x503C;&#x4EA7;&#x751F;&#x6781;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x56FE;7&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x7684;&#x7F13;&#x6162;&#x7684;&#x8DDF;&#x8E2A;&#x90FD;&#x6765;&#x6E90;&#x4E8E;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x9000;&#x5316;&#x3002;</li>
<li>&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x548C;&#x4EE3;&#x4EF7;&#x5F88;&#x9AD8;&#x7684;&#x67E5;&#x8BE2;&#x6A21;&#x5F0F;&#x6765;&#x6E90;&#x4E8E;&#x4E00;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#xFF0C;&#x5F80;&#x5F80;&#x5BB9;&#x6613;&#x7EA0;&#x6B63;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x662F;Dapper&#x51FA;&#x73B0;&#x4E4B;&#x524D;&#x60F3;&#x627E;&#x51FA;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x76F8;&#x5F53;&#x56F0;&#x96BE;&#x7684;&#x3002;</li>
<li>&#x901A;&#x7528;&#x7684;&#x67E5;&#x8BE2;&#x4ECE;Dapper&#x4E4B;&#x5916;&#x7684;&#x5B89;&#x5168;&#x65E5;&#x5FD7;&#x4ED3;&#x5E93;&#x4E2D;&#x6536;&#x53D6;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;Dapper&#x552F;&#x4E00;&#x7684;&#x8DDF;&#x8E2A;ID&#xFF0C;&#x4E0E;Dapper&#x7684;&#x4ED3;&#x5E93;&#x505A;&#x5173;&#x8054;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BE5;&#x6620;&#x5C04;&#x7528;&#x6765;&#x5EFA;&#x7ACB;&#x5173;&#x4E8E;&#x5728;&#x5168;&#x5C40;&#x641C;&#x7D22;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x5B50;&#x7CFB;&#x7EDF;&#x90FD;&#x5F88;&#x6162;&#x7684;&#x5B9E;&#x4F8B;&#x67E5;&#x8BE2;&#x7684;&#x5217;&#x8868;&#x3002;</li>
</ul>
<h2 id="6-3-&#x63A8;&#x65AD;&#x670D;&#x52A1;&#x4F9D;&#x8D56;"><a href="#6-3-&#x63A8;&#x65AD;&#x670D;&#x52A1;&#x4F9D;&#x8D56;" class="headerlink" title="6.3 &#x63A8;&#x65AD;&#x670D;&#x52A1;&#x4F9D;&#x8D56;"></a>6.3 &#x63A8;&#x65AD;&#x670D;&#x52A1;&#x4F9D;&#x8D56;</h2><p>&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#xFF0C;Google&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#x662F;&#x4E00;&#x4E2A;&#x6C47;&#x96C6;&#x4E86;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x903B;&#x8F91;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#x7684;&#x4E3B;&#x673A;&#xFF0C;&#x4E00;&#x5957;&#x7684;&#x5904;&#x7406;&#x5668;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;Google&#x7EF4;&#x62A4;&#x7740;&#x8BB8;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x4E0A;&#x8BA1;&#x7B97;&#x7740;&#x7684;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x901A;&#x5E38;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x96C6;&#x7FA4;&#x4E0A;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x7531;&#x4E8E;&#x4EFB;&#x52A1;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x662F;&#x52A8;&#x6001;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x53EF;&#x80FD;&#x4EC5;&#x4ECE;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x4E0A;&#x63A8;&#x65AD;&#x51FA;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x9664;&#x4E86;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x5916;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7684;&#x5404;&#x4E2A;&#x6D41;&#x7A0B;&#x9700;&#x8981;&#x51C6;&#x786E;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x74F6;&#x9888;&#x6240;&#x5728;&#xFF0C;&#x4EE5;&#x53CA;&#x8BA1;&#x5212;&#x670D;&#x52A1;&#x7684;&#x8FC1;&#x79FB;&#x3002;Google&#x7684;&#x53EF;&#x79F0;&#x4E3A;&#x201C;Service<br> Dependencies&#x201D;&#x7684;&#x9879;&#x76EE;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8DDF;&#x8E2A;Annotation&#x548C;DAPI MapReduce&#x63A5;&#x53E3;&#x6765;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x5316;&#x786E;&#x5B9A;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x5F52;&#x5C5E;&#x7684;&#x3002;</p>
<p>Dapper&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#x4E0E;Dapper&#x8DDF;&#x8E2A;Annotation&#x4E00;&#x5E76;&#x4F7F;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x201C;Service Dependencies&#x201D;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x63A8;&#x7B97;&#x51FA;&#x4EFB;&#x52A1;&#x5404;&#x81EA;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x52A1;&#x548C;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6240;&#x6709;&#x7684;BigTable&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x52A0;&#x4E0A;&#x4E0E;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x8868;&#x540D;&#x79F0;&#x76F8;&#x5173;&#x7684;&#x6807;&#x8BB0;&#x3002;&#x8FD0;&#x7528;Dapper&#x7684;&#x5E73;&#x53F0;&#xFF0C;Service Dependencies&#x56E2;&#x961F;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x7684;&#x63A8;&#x7B97;&#x51FA;&#x4F9D;&#x8D56;&#x4E8E;&#x547D;&#x540D;&#x7684;&#x4E0D;&#x540C;&#x8D44;&#x6E90;&#x7684;&#x670D;&#x52A1;&#x7C92;&#x5EA6;&#x3002;</p>
<h2 id="6-4-&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x7387;"><a href="#6-4-&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x7387;" class="headerlink" title="6.4 &#x4E0D;&#x540C;&#x670D;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x7387;"></a>6.4 &#x4E0D;&#x540C;&#x670D;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x7387;</h2><p>Google&#x6295;&#x5165;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4EBA;&#x529B;&#x548C;&#x7269;&#x529B;&#x8D44;&#x6E90;&#x5728;&#x4ED6;&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x4E0A;&#x3002;&#x4ECE;&#x524D;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x80FD;&#x53EA;&#x5173;&#x6CE8;&#x72EC;&#x7ACB;&#x7684;&#x786C;&#x4EF6;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x53CA;&#x4EE5;&#x53CA;&#x642D;&#x5EFA;&#x51FA;&#x7684;&#x5404;&#x79CD;&#x5168;&#x5C40;&#x7F51;&#x7EDC;&#x9E1F;&#x77B0;&#x56FE;&#x7684;dashboard&#x4E0A;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x4E00;&#x89C8;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x9047;&#x5230;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F88;&#x5C11;&#x6709;&#x80FD;&#x591F;&#x51C6;&#x786E;&#x67E5;&#x627E;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4F4D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x522B;&#x7684;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;</p>
<p>&#x867D;&#x7136;Dapper&#x4E0D;&#x662F;&#x8BBE;&#x8BA1;&#x7528;&#x6765;&#x505A;&#x94FE;&#x8DEF;&#x7EA7;&#x7684;&#x76D1;&#x63A7;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x5B83;&#x662F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x53BB;&#x505A;&#x96C6;&#x7FA4;&#x4E4B;&#x95F4;&#x7F51;&#x7EDC;&#x6D3B;&#x52A8;&#x6027;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x4EFB;&#x52A1;&#x7684;&#x5206;&#x6790;&#x3002;Google&#x80FD;&#x591F;&#x5229;&#x7528;Dapper&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x6765;&#x663E;&#x793A;&#x96C6;&#x7FA4;&#x4E4B;&#x95F4;&#x6700;&#x6D3B;&#x8DC3;&#x7684;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x7684;&#x70ED;&#x70B9;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F7F;&#x7528;Dapper&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4E3A;&#x6602;&#x8D35;&#x7684;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x63D0;&#x4F9B;&#x6307;&#x51FA;&#x7684;&#x6784;&#x6210;&#x539F;&#x56E0;&#x7684;&#x8DDF;&#x8E2A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9762;&#x5BF9;&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x800C;&#x65E0;&#x6240;&#x9002;&#x4ECE;&#x3002;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Dapper API&#x7684;dashboard&#x603B;&#x5171;&#x6CA1;&#x82B1;&#x8D85;&#x8FC7;2&#x5468;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="6-5-&#x5206;&#x5C42;&#x548C;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;"><a href="#6-5-&#x5206;&#x5C42;&#x548C;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;" class="headerlink" title="6.5 &#x5206;&#x5C42;&#x548C;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;"></a>6.5 &#x5206;&#x5C42;&#x548C;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;</h2><p>&#x5728;Google&#x7684;&#x8BB8;&#x591A;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x591A;&#x91CD;&#x72EC;&#x7ACB;&#x590D;&#x6742;&#x5C42;&#x7EA7;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x57FA;&#x7840;&#x8BBE;&#x5907;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Google&#x7684;App Engine[5]&#x5C31;&#x662F;&#x642D;&#x5EFA;&#x5728;&#x4E00;&#x4E2A;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x5B9E;&#x4F53;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x3002;&#x8BE5;&#x5B9E;&#x4F53;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x5728;&#x57FA;&#x4E8E;BigTable&#x4E0A;&#x516C;&#x5F00;&#x67D0;&#x4E9B;RDBMS&#x529F;&#x80FD;&#x3002; BigTable&#x7684;&#x540C;&#x65F6;&#x4F7F;&#x7528;Chubby[7]&#xFF08;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x7CFB;&#x7EDF;&#xFF09;&#x53CA;GFS&#x3002;&#x518D;&#x8005;&#xFF0C;&#x50CF;BigTable&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x7B80;&#x5316;&#x4E86;&#x90E8;&#x7F72;&#xFF0C;&#x5E76;&#x66F4;&#x597D;&#x7684;&#x5229;&#x7528;&#x4E86;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x5206;&#x5C42;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x786E;&#x5B9A;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8D39;&#x6A21;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;BigTable&#x5355;&#x5143;&#x683C;&#x7684;GFS&#x5927;&#x4FE1;&#x606F;&#x91CF;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6216;&#x662F;&#x7531;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x4EA7;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x5728;GFS&#x5C42;&#x9762;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x660E;&#x663E;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x662F;&#x5F88;&#x96BE;&#x754C;&#x5B9A;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x7F3A;&#x4E4F;&#x4E00;&#x4E2A;&#x50CF;Dapper&#x4E00;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9;&#x5171;&#x4EAB;&#x670D;&#x52A1;&#x7684;&#x7ADE;&#x4E89;&#x53EF;&#x80FD;&#x4F1A;&#x540C;&#x6837;&#x96BE;&#x4E8E;&#x8C03;&#x8BD5;&#x3002;</p>
<p>&#x7B2C;5.2&#x8282;&#x4E2D;&#x6240;&#x793A;&#x7684;Dapper&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x53EF;&#x4EE5;&#x805A;&#x5408;&#x90A3;&#x4E9B;&#x8C03;&#x7528;&#x4EFB;&#x610F;&#x516C;&#x5171;&#x670D;&#x52A1;&#x7684;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8DDF;&#x8E2A;&#x7684;&#x6027;&#x80FD;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x7684;&#x6E90;&#x4ECE;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x6392;&#x540D;&#x3002;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5165;&#x7AD9;&#x7684;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#xFF0C;&#x51FA;&#x7AD9;&#x7684;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#xFF0C;&#x6216;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x7684;&#x603B;&#x65F6;&#x95F4;&#xFF09;</p>
<h2 id="6-6-Dapper&#x7684;&#x6551;&#x706B;&#x80FD;&#x529B;-Firefighting"><a href="#6-6-Dapper&#x7684;&#x6551;&#x706B;&#x80FD;&#x529B;-Firefighting" class="headerlink" title="6.6 Dapper&#x7684;&#x6551;&#x706B;&#x80FD;&#x529B;(Firefighting)"></a>6.6 Dapper&#x7684;&#x6551;&#x706B;&#x80FD;&#x529B;(Firefighting)</h2><p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x201C;&#x6551;&#x706B;&#x201D;&#x4EFB;&#x52A1;&#xFF0C;Dapper&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x201C;&#x6551;&#x706B;&#x201D;&#x4EFB;&#x52A1;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x6307;&#x4E00;&#x4E9B;&#x6709;&#x98CE;&#x9669;&#x5F88;&#x9AD8;&#x7684;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Dapper&#x7528;&#x6237;&#x5F53;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x201C;&#x6551;&#x706B;&#x201D;&#x4EFB;&#x52A1;&#x65F6;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5199;&#x65B0;&#x7684;DAPI&#x4EE3;&#x7801;&#x6216;&#x7B49;&#x5F85;&#x5468;&#x671F;&#x6027;&#x7684;&#x62A5;&#x544A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x9AD8;&#x5EF6;&#x8FDF;&#xFF0C;&#x4E0D;&#xFF0C;&#x53EF;&#x80FD;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x90A3;&#x4E9B;&#x5728;&#x6B63;&#x5E38;&#x8D1F;&#x8F7D;&#x4E0B;&#x90FD;&#x4F1A;&#x54CD;&#x5E94;&#x8D85;&#x65F6;&#x7684;&#x670D;&#x52A1;&#xFF0C;Dapper&#x7528;&#x6237;&#x754C;&#x9762;&#x901A;&#x5E38;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x5EF6;&#x8FDF;&#x74F6;&#x9888;&#x7684;&#x4F4D;&#x7F6E;&#x9694;&#x79BB;&#x51FA;&#x6765;&#x3002;&#x901A;&#x8FC7;&#x4E0E;Dapper&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x76F4;&#x63A5;&#x901A;&#x4FE1;&#xFF0C;&#x90A3;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x9AD8;&#x5EF6;&#x8FDF;&#x7684;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x8F7B;&#x6613;&#x7684;&#x6536;&#x96C6;&#x5230;&#x3002;&#x5F53;&#x51FA;&#x73B0;&#x707E;&#x96BE;&#x6027;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x53BB;&#x770B;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x4EE5;&#x786E;&#x5B9A;&#x6839;&#x672C;&#x539F;&#x56E0;&#xFF0C;&#x53EA;&#x67E5;&#x770B;&#x793A;&#x4F8B;&#x8DDF;&#x8E2A;&#x5C31;&#x8DB3;&#x591F;&#x4E86;(&#x56E0;&#x4E3A;&#x524D;&#x6587;&#x63D0;&#x5230;&#x8FC7;&#x4ECE;Dapper&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4E2D;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x83B7;&#x5F97;&#x8DDF;&#x8E2A;&#x6570;&#x636E;)&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x5728;6.5&#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5171;&#x4EAB;&#x7684;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#xFF0C;&#x8981;&#x6C42;&#x5F53;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x7A81;&#x7136;&#x4E2D;&#x65AD;&#x65F6;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x7684;&#x6C47;&#x603B;&#x4FE1;&#x606F;&#x3002;&#x5BF9;&#x4E8E;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x4E4B;&#x540E;&#xFF0C;&#x5171;&#x4EAB;&#x670D;&#x52A1;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6C47;&#x603B;&#x7684;&#x7684;Dapper&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x9664;&#x975E;&#x6536;&#x96C6;&#x5230;&#x7684;Dapper&#x6570;&#x636E;&#x7684;&#x6279;&#x91CF;&#x5206;&#x6790;&#x80FD;&#x5728;&#x95EE;&#x9898;&#x51FA;&#x73B0;10&#x5206;&#x949F;&#x4E4B;&#x5185;&#x5B8C;&#x6210;&#xFF0C;&#x5426;&#x5219;Dapper&#x9762;&#x5BF9;&#x4E0E;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x201C;&#x6551;&#x706B;&#x201D;&#x4EFB;&#x52A1;&#x5C31;&#x5F88;&#x96BE;&#x6309;&#x9884;&#x60F3;&#x7684;&#x90A3;&#x822C;&#x987A;&#x5229;&#x5B8C;&#x6210;&#x3002;</p>
<ol start="7">
<li>&#x5176;&#x4ED6;&#x6536;&#x83B7;</li>
</ol>
<hr>
<p>&#x867D;&#x7136;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5728;Dapper&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#x5DF2;&#x7ECF;&#x5927;&#x81F4;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x79EF;&#x6781;&#x7684;&#x65B9;&#x9762;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5145;&#x5206;&#x9884;&#x6599;&#x5230;&#x7684;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x4E86;&#x8D85;&#x51FA;&#x9884;&#x671F;&#x7684;Dapper&#x4F7F;&#x7528;&#x7528;&#x4F8B;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5BF9;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x8C13;&#x6B22;&#x5FC3;&#x9F13;&#x821E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x9664;&#x4E86;&#x51E0;&#x4E2A;&#x7684;&#x5728;&#x7B2C;6&#x8282;&#x4F7F;&#x7528;&#x7ECF;&#x9A8C;&#x4E2D;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x4E00;&#x4E9B;&#x7528;&#x4F8B;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x8D44;&#x6E90;&#x6838;&#x7B97;&#x7CFB;&#x7EDF;&#xFF0C;&#x5BF9;&#x6307;&#x5B9A;&#x7684;&#x901A;&#x8BAF;&#x6A21;&#x5F0F;&#x654F;&#x611F;&#x7684;&#x670D;&#x52A1;&#x7684;&#x68C0;&#x67E5;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x79CD;&#x5BF9;RPC&#x538B;&#x7F29;&#x7B56;&#x7565;&#x7684;&#x5206;&#x6790;&#x5668;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x7528;&#x4F8B;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5411;&#x5F00;&#x53D1;&#x8005;&#x4EE5;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#x7684;&#x65B9;&#x5F0F;&#x5F00;&#x653E;&#x4E86;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5145;&#x5206;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x5927;&#x7684;&#x591A;&#x7684;&#x793E;&#x533A;&#x7684;&#x521B;&#x9020;&#x529B;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;Dapper&#x5BF9;&#x65E7;&#x7684;&#x8D1F;&#x8F7D;&#x7684;&#x652F;&#x6301;&#x4E5F;&#x6BD4;&#x9884;&#x671F;&#x7684;&#x8981;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x7528;&#x65B0;&#x7248;&#x672C;&#x7684;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x8FC7;&#x7684;&#x516C;&#x5171;&#x7EC4;&#x4EF6;&#x5E93;(&#x5305;&#x542B;&#x5E38;&#x89C4;&#x7684;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#xFF0C;&#x63A7;&#x5236;&#x6D41;&#x548C;RPC&#x6846;&#x67B6;)&#x5373;&#x53EF;&#x3002;</p>
<p>Dapper&#x5728;Google&#x5185;&#x90E8;&#x7684;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x8FD8;&#x4E3A;&#x6211;&#x4EEC;&#x5728;Dapper&#x7684;&#x5C40;&#x9650;&#x6027;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x5B9D;&#x8D35;&#x7684;&#x53CD;&#x9988;&#x610F;&#x89C1;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6211;&#x4EEC;&#x5DF2;&#x77E5;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;Dapper&#x7684;&#x4E0D;&#x8DB3;&#xFF1A;</p>
<ul>
<li>&#x5408;&#x5E76;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x9690;&#x542B;&#x7684;&#x524D;&#x63D0;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x5728;&#x5904;&#x7406;&#x7684;&#x90FD;&#x662F;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x4E2A;&#x88AB;&#x8DDF;&#x8E2A;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F13;&#x51B2;&#x4E00;&#x90E8;&#x5206;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x6B21;&#x6027;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x96C6;&#x4F1A;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x3002;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x4E00;&#x6B21;&#x5408;&#x5E76;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x88AB;&#x8DDF;&#x8E2A;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x770B;&#x4F3C;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x8FFD;&#x8E2A;&#x8BF7;&#x6C42;&#x88AB;&#x6536;&#x96C6;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F53;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4F1A;&#x7528;&#x6765;&#x751F;&#x6210;&#x90A3;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x8DDF;&#x8E2A;ID&#xFF0C;&#x7528;&#x6765;&#x7ED9;&#x5176;&#x4ED6;span&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x65E0;&#x6CD5;&#x8DDF;&#x8E2A;&#x4E0B;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x8003;&#x8651;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x7528;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x8BB0;&#x5F55;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x8DDF;&#x8E2A;&#x6279;&#x5904;&#x7406;&#x8D1F;&#x8F7D;&#xFF1A;Dapper&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x6700;&#x521D;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x4EA7;&#x751F;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x79BB;&#x7EBF;&#x7684;&#x5BC6;&#x96C6;&#x578B;&#x8D1F;&#x8F7D;&#xFF0C;&#x4F8B;&#x5982;&#x7B26;&#x5408;MapReduce[10]&#x6A21;&#x578B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53D7;&#x76CA;&#x4E8E;&#x6027;&#x80FD;&#x6316;&#x6F5C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8DDF;&#x8E2A;ID&#x4E0E;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x505A;&#x5173;&#x8054;&#xFF0C;&#x8BF8;&#x5982;&#x8F93;&#x5165;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x952E;&#x503C;&#xFF08;&#x6216;&#x952E;&#x503C;&#x7684;&#x8303;&#x56F4;&#xFF09;&#xFF0C;&#x6216;&#x662F;&#x4E00;&#x4E2A;MapReduce shard&#x3002;</li>
<li>&#x5BFB;&#x627E;&#x6839;&#x6E90;&#xFF1A;Dapper&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x81F4;&#x4F7F;&#x7CFB;&#x7EDF;&#x6574;&#x4E2A;&#x901F;&#x5EA6;&#x53D8;&#x6162;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x80FD;&#x591F;&#x627E;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x6839;&#x6E90;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5F88;&#x6162;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x4E8E;&#x961F;&#x5217;&#x4E2D;&#x5176;&#x4ED6;&#x6392;&#x5728;&#x5B83;&#x524D;&#x9762;&#x7684;(queued ahead of)&#x8BF7;&#x6C42;&#x8FD8;&#x6CA1;&#x5904;&#x7406;&#x5B8C;&#x3002;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7EA7;&#x7684;annotation&#x628A;&#x961F;&#x5217;&#x7684;&#x5927;&#x5C0F;&#x6216;&#x8FC7;&#x8F7D;&#x60C5;&#x51B5;&#x5199;&#x5165;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C61;&#x89C1;&#x4E0D;&#x9C9C;&#xFF0C;&#x90A3;&#x4E48;&#x5728;ProfileMe[11]&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6210;&#x5BF9;&#x7684;&#x91C7;&#x6837;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x7531;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x91CD;&#x53E0;&#x7684;&#x91C7;&#x6837;&#x7387;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x89C2;&#x5BDF;&#x5B83;&#x4EEC;&#x5728;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x76F8;&#x5BF9;&#x5EF6;&#x8FDF;&#x3002;</li>
<li>&#x8BB0;&#x5F55;&#x5185;&#x6838;&#x7EA7;&#x7684;&#x4FE1;&#x606F;&#xFF1A;&#x4E00;&#x4E9B;&#x5185;&#x6838;&#x53EF;&#x89C1;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x6709;&#x65F6;&#x5BF9;&#x786E;&#x5B9A;&#x95EE;&#x9898;&#x6839;&#x6E90;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x80FD;&#x591F;&#x8DDF;&#x8E2A;&#x6216;&#x4EE5;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x63CF;&#x8FF0;&#x5185;&#x6838;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x60F3;&#x7528;&#x901A;&#x7528;&#x7684;&#x6216;&#x662F;&#x4E0D;&#x90A3;&#x4E48;&#x7A81;&#x5140;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x5F88;&#x96BE;&#x628A;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5230;&#x6346;&#x7ED1;&#x5230;&#x7528;&#x6237;&#x7EA7;&#x522B;&#x7684;&#x8DDF;&#x8E2A;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x7814;&#x7A76;&#x4E00;&#x79CD;&#x59A5;&#x534F;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7528;&#x6237;&#x5C42;&#x9762;&#x4E0A;&#x628A;&#x4E00;&#x4E9B;&#x5185;&#x6838;&#x7EA7;&#x7684;&#x6D3B;&#x52A8;&#x53C2;&#x6570;&#x505A;&#x5FEB;&#x7167;&#xFF0C;&#x7136;&#x540E;&#x7ED1;&#x5B9A;&#x4ED6;&#x4EEC;&#x5230;&#x4E00;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;span&#x4E0A;&#x3002;</li>
</ul>
<ol start="8">
<li>&#x76F8;&#x5173;&#x4EA7;&#x54C1;</li>
</ol>
<hr>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x8DDF;&#x8E2A;&#x9886;&#x57DF;&#xFF0C;&#x6709;&#x4E00;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x4F53;&#x7CFB;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x5B9A;&#x4F4D;&#x5230;&#x6545;&#x969C;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x76EE;&#x6807;&#x662F;&#x9488;&#x5BF9;&#x6027;&#x80FD;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002; Dapper&#x786E;&#x5B9E;&#x88AB;&#x7528;&#x4E8E;&#x53D1;&#x73B0;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x66F4;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x63A2;&#x67E5;&#x6027;&#x80FD;&#x4E0D;&#x8DB3;&#xFF0C;&#x4EE5;&#x53CA;&#x63D0;&#x9AD8;&#x5168;&#x9762;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x4E0E;Dapper&#x76F8;&#x5173;&#x7684;&#x9ED1;&#x76D2;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;Project5[1]&#xFF0C;WAP5[15]&#x548C;Sherlock[2]&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x4E0D;&#x4F9D;&#x8D56;&#x8FD0;&#x884C;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9ED1;&#x76D2;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x66F4;&#x9AD8;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x900F;&#x660E;&#x3002;&#x9ED1;&#x76D2;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E0D;&#x591F;&#x7CBE;&#x786E;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5728;&#x7EDF;&#x8BA1;&#x63A8;&#x65AD;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x65F6;&#x5E26;&#x6765;&#x66F4;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x635F;&#x8017;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x76D1;&#x63A7;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x4E8E;Annotation&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x6216;&#x5E94;&#x7528;&#x81EA;&#x8EAB;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;.&#x62FF;Pip[14]&#x548C;Webmon[16]&#x7CFB;&#x7EDF;&#x4E3E;&#x4F8B;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x4F9D;&#x8D56;&#x4E8E;&#x5E94;&#x7528;&#x7EA7;&#x7684;Annotation&#xFF0C;&#x800C;X-Trace[12]&#xFF0C;Pinpoint[9]&#x548C;Magpie[3]&#x5927;&#x591A;&#x96C6;&#x4E2D;&#x5728;&#x5BF9;&#x5E93;&#x548C;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x3002;Dapper&#x66F4;&#x63A5;&#x8FD1;&#x540E;&#x8005;&#x3002;&#x50CF;Pinpoint&#xFF0C;X-Trace&#xFF0C;&#x548C;&#x65E9;&#x671F;&#x7248;&#x672C;&#x7684;Magpie&#x4E00;&#x6837;&#xFF0C;Dapper&#x91C7;&#x7528;&#x4E86;&#x5168;&#x5C40;&#x6807;&#x8BC6;&#x7B26;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5404;&#x90E8;&#x5206;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x4EF6;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x548C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x7C7B;&#x4F3C;&#xFF0C;Dapper&#x5C1D;&#x8BD5;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7EA7;Annotation&#xFF0C;&#x800C;&#x662F;&#x628A;&#x7684;&#x690D;&#x5165;&#x9690;&#x85CF;&#x5728;&#x901A;&#x7528;&#x7EC4;&#x4EF6;&#x6A21;&#x5757;&#x5185;&#x3002;Magpie&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x5168;&#x5C40;ID&#xFF0C;&#x4ECD;&#x7136;&#x8BD5;&#x56FE;&#x6B63;&#x786E;&#x7684;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;&#x7684;&#x6B63;&#x786E;&#x4F20;&#x64AD;&#xFF0C;&#x4ED6;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5404;&#x81EA;&#x5199;&#x5165;&#x7684;&#x4E8B;&#x4EF6;&#x7B56;&#x7565;&#xFF0C;&#x6700;&#x7EC8;&#x4E5F;&#x80FD;&#x7CBE;&#x786E;&#x63CF;&#x8FF0;&#x4E0D;&#x540C;&#x4E8B;&#x4EF6;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x3002;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x8FD8;&#x4E0D;&#x6E05;&#x695A;Magpie&#x5728;&#x5B9E;&#x9645;&#x73AF;&#x5883;&#x4E2D;&#x5B9E;&#x73B0;&#x900F;&#x660E;&#x6027;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5230;&#x5E95;&#x591A;&#x4E48;&#x6709;&#x6548;&#x3002;<br> X-Trace&#x7684;&#x6838;&#x5FC3;Annotation&#x6BD4;Dapper&#x66F4;&#x6709;&#x91CE;&#x5FC3;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;X-Trace&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x8DDF;&#x8E2A;&#x7684;&#x6536;&#x96C6;&#xFF0C;&#x4E0D;&#x4EC5;&#x5728;&#x8DDF;&#x8E2A;&#x8282;&#x70B9;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x4E0D;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x5C42;&#x4E5F;&#x4F1A;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x7EC4;&#x4EF6;&#x7684;&#x4F4E;&#x6027;&#x80FD;&#x635F;&#x8017;&#x7684;&#x8981;&#x6C42;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x91C7;&#x7528;X-Trace&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x662F;&#x671D;&#x7740;&#x628A;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x5B8C;&#x6574;&#x8DDF;&#x8E2A;&#x6240;&#x80FD;&#x505A;&#x5230;&#x7684;&#x6700;&#x5C0F;&#x4EE3;&#x4EF7;&#x800C;&#x52AA;&#x529B;&#x3002;&#x800C;Dapper&#x7684;&#x8DDF;&#x8E2A;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4ECE;&#x53EF;&#x9009;&#x7684;&#x5E94;&#x7528;&#x7EA7;Annotation&#x4E2D;&#x83B7;&#x76CA;&#x3002;</p>
<ol start="9">
<li>&#x603B;&#x7ED3;</li>
</ol>
<hr>
<p>&#x5728;&#x672C;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;Dapper&#x8FD9;&#x4E2A;Google&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x8DDF;&#x8E2A;&#x5E73;&#x53F0;&#xFF0C;&#x5E76;&#x6C47;&#x62A5;&#x4E86;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x548C;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#x3002; Dapper&#x51E0;&#x4E4E;&#x5728;&#x90E8;&#x7F72;&#x5728;&#x6240;&#x6709;&#x7684;Google&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7EA7;&#x4FEE;&#x6539;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x7684;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x3002;Dapper&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x8FD0;&#x7EF4;&#x56E2;&#x961F;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x7684;&#x8DDF;&#x8E2A;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E0A;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x53E6;&#x5916;&#x6211;&#x4EEC;&#x8FD8;&#x5217;&#x4E3E;&#x4E86;&#x4E00;&#x4E9B;Dapper&#x7684;&#x4F7F;&#x7528;&#x7528;&#x4F8B;&#x6765;&#x8BF4;&#x660E;Dapper&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x7528;&#x4F8B;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x90FD;&#x6CA1;&#x6709;Dapper&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x53C2;&#x4E0E;&#xFF0C;&#x800C;&#x662F;&#x88AB;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x636E;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x7BC7;&#x6C47;&#x62A5;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E0B;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x8DDF;&#x8E2A;&#x6846;&#x67B6;&#x7684;&#x8BBA;&#x6587;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x6E90;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;&#x8BBA;&#x6587;&#x4E2D;&#x56DE;&#x987E;&#x7684;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E24;&#x5E74;&#x4E4B;&#x4E45;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x7ED3;&#x5408;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x7B80;&#x5355;API&#x548C;&#x5BF9;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x6765;&#x589E;&#x5F3A;&#x8DDF;&#x8E2A;&#x7684;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#xFF0C;Dapper&#x6BD4;&#x4EE5;&#x524D;&#x7684;&#x57FA;&#x4E8E;Annotation&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x8FBE;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x5E94;&#x7528;&#x900F;&#x660E;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x53EA;&#x9700;&#x8981;&#x5C11;&#x91CF;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5F97;&#x4EE5;&#x8BC1;&#x660E;&#x3002;&#x867D;&#x7136;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F97;&#x76CA;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x540C;&#x8D28;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x672C;&#x8EAB;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x5E94;&#x7528;&#x7EA7;&#x900F;&#x660E;&#x6027;&#x7684;&#x5145;&#x5206;&#x6761;&#x4EF6;&#xFF0C;&#x5BF9;&#x6B64;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5BF9;&#x66F4;&#x9519;&#x6742;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5F00;&#x53D1;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x5F00;&#x653E;Dapper&#x8DDF;&#x8E2A;&#x4ED3;&#x5E93;&#x7ED9;&#x5185;&#x90E8;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x4FC3;&#x4F7F;&#x66F4;&#x591A;&#x7684;&#x57FA;&#x4E8E;&#x8DDF;&#x8E2A;&#x4ED3;&#x5E93;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x7531;Dapper&#x56E2;&#x961F;&#x9ED8;&#x9ED8;&#x7684;&#x5728;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x4E2D;&#x57CB;&#x5934;&#x82E6;&#x5E72;&#x7684;&#x7ED3;&#x679C;&#x8FDC;&#x8FBE;&#x4E0D;&#x5230;&#x73B0;&#x5728;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#x4FC3;&#x4F7F;&#x4E86;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x65BD;&#x7684;&#x5C55;&#x5F00;&#x3002;</p>
<h3 id="Acknowledgments"><a href="#Acknowledgments" class="headerlink" title="Acknowledgments"></a>Acknowledgments</h3><p>We thank Mahesh Palekar, Cliff Biffle, Thomas Kotzmann, Kevin Gibbs, Yonatan Zunger, Michael Kleber, and Toby Smith for their experimental data and feedback about Dapper experiences. We also thank Silvius Rus for his assistance with load testing.<br> Most importantly, though, we thank the outstanding team of engineers who have continued to develop and improve Dapper over the years; in order of appearance, Sharon Perl, Dick Sites, Rob von Behren, Tony DeWitt, Don Pazel, Ofer Zajicek, Anthony<br> Zana, Hyang-Ah Kim, Joshua MacDonald, Dan Sturman, Glenn Willen, Alex Kehlenbeck, Brian McBarron, Michael Kleber, Chris Povirk, Bradley White, Toby Smith, Todd Derr, Michael De Rosa, and Athicha Muthitacharoen. They have all done a tremendous<br> amount of work to make Dapper a day-to-day reality at Google.</p>
<h3 id="References"><a href="#References" class="headerlink" title="References"></a>References</h3><p>[1] M. K. Aguilera, J. C. Mogul, J. L. Wiener, P. Reynolds, and A. Muthitacharoen. Performance Debugging for Distributed Systems of Black Boxes. In Proceedings of the 19th ACM Symposium on Operating Systems Principles, December 2003.</p>
<p>[2] P. Bahl, R. Chandra, A. Greenberg, S. Kandula, D. A. Maltz, and M. Zhang. Towards Highly Reliable Enterprise Network Services Via Inference of Multi-level Dependencies. In Proceedings of SIGCOMM, 2007.</p>
<p>[3] P. Barham, R. Isaacs, R. Mortier, and D. Narayanan. Magpie: online modelling and performance-aware systems. In Proceedings of USENIX HotOS IX, 2003.</p>
<p>[4] L. A. Barroso, J. Dean, and U. Holzle. Web Search for a Planet: The Google Cluster Architecture. IEEE Micro, 23(2):22&#x2013;28, March/April 2003.</p>
<p>[5] T. O. G. Blog. Developers, start your engines. <a href="/external_links/ba21ae0943336e35497dcc5c646af6f9.html" target="blank" rel="noopener">http://googleblog.blogspot.com/2008/04/developers-start-your-engines.html,2007</a>.</p>
<p>[6] T. O. G. Blog. Universal search: The best answer is still the best answer. <a href="/external_links/b7f0f1ad7664b9e815a9c85a72080248.html" target="blank" rel="noopener">http://googleblog.blogspot.com/2007/05/universal-search-best-answer-is-still.html</a>, 2007.</p>
<p>[7] M. Burrows. The Chubby lock service for loosely-coupled distributed systems. In Proceedings of the 7th USENIX Symposium on Operating Systems Design and Implementation, pages 335 &#x2013; 350, 2006. </p>
<p>[8] F. Chang, J. Dean, S. Ghemawat, W. C. Hsieh, D. A. Wallach, M. Burrows, T. Chandra, A. Fikes, and R. E. Gruber. Bigtable: A Distributed Storage System for Structured Data. In Proceedings of the 7th USENIX Symposium on Operating Systems Design<br> and Implementation (OSDI&#x2019;06), November 2006.</p>
<p>[9] M. Y. Chen, E. Kiciman, E. Fratkin, A. fox, and E. Brewer. Pinpoint: Problem Determination in Large, Dynamic Internet Services. In Proceedings of ACM International Conference on Dependable Systems and Networks, 2002.</p>
<p>[10] J. Dean and S. Ghemawat. MapReduce: Simplified Data Processing on Large Clusters. In Proceedings of the 6th USENIX Symposium on Operating Systems Design and Implementation (OSDI&#x2019;04), pages 137 &#x2013; 150, December 2004.</p>
<p>[11] J. Dean, J. E. Hicks, C. A. Waldspurger, W. E. Weihl, and G. Chrysos. ProfileMe: Hardware Support for Instruction-Level Profiling on Out-of-Order Processors. In Proceedings of the IEEE/ACM International Symposium on Microarchitecture, 1997.</p>
<p>[12] R. Fonseca, G. Porter, R. H. Katz, S. Shenker, and I. Stoica. X-Trace: A Pervasive Network Tracing Framework. In Proceedings of USENIX NSDI, 2007.</p>
<p>[13] B. Lee and K. Bourrillion. The Guice Project Home Page. <a href="/external_links/34bce97fa830f9983c9672db83ff5190.html" target="blank" rel="noopener">http://code.google.com/p/google-guice/</a>, 2007. </p>
<p>[14] P. Reynolds, C. Killian, J. L. Wiener, J. C. Mogul, M. A. Shah, and A. Vahdat. Pip: Detecting the Unexpected in Distributed Systems. In Proceedings of USENIX NSDI, 2006.</p>
<p>[15] P. Reynolds, J. L. Wiener, J. C. Mogul, M. K. Aguilera, and A. Vahdat. WAP5: Black Box Performance Debugging for Wide-Area Systems. In Proceedings of the 15th International World Wide Web Conference, 2006.</p>
<p>[16] P. K. G. T. Gschwind, K. Eshghi and K. Wurster. WebMon: A Performance Profiler for Web Transactions. In E-Commerce Workshop, 2002.</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/55f743f5dc47cbe6fa7059b21eda8e4f.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/Google-设计-服务器-API/" rel="tag"># Google,设计,服务器,API</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903512019566605.html" rel="next" title="使用 Rust 构建分布式 Key-Value Store">
                <i class="fa fa-chevron-left"></i> 使用 Rust 构建分布式 Key-Value Store
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903511864410119.html" rel="prev" title="聊聊jesque的event机制">
                聊聊jesque的event机制 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#概述"><span class="nav-number">1.</span> <span class="nav-text">概述</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-介绍"><span class="nav-number">2.</span> <span class="nav-text">1. 介绍</span></a></li></ol><li class="nav-item nav-level-2"><a class="nav-link" href="#1-1-文献的总结"><span class="nav-number"></span> <span class="nav-text">1.1 文献的总结</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-1-跟踪树和span"><span class="nav-number"></span> <span class="nav-text">2.1 跟踪树和span</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-2-植入点"><span class="nav-number"></span> <span class="nav-text">2.2 植入点</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-3-Annotation"><span class="nav-number"></span> <span class="nav-text">2.3 Annotation</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-4-采样率"><span class="nav-number"></span> <span class="nav-text">2.4 采样率</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-5-跟踪的收集"><span class="nav-number"></span> <span class="nav-text">2.5 跟踪的收集</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-5-1-带外数据跟踪收集"><span class="nav-number"></span> <span class="nav-text">2.5.1 带外数据跟踪收集</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2-6-安全和隐私考虑"><span class="nav-number"></span> <span class="nav-text">2.6 安全和隐私考虑</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#3-1-Dapper运行库"><span class="nav-number"></span> <span class="nav-text">3.1 Dapper运行库</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#3-2-生产环境下的涵盖面"><span class="nav-number"></span> <span class="nav-text">3.2 生产环境下的涵盖面</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#3-3-跟踪Annotation的使用"><span class="nav-number"></span> <span class="nav-text">3.3 跟踪Annotation的使用</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-1-生成跟踪的损耗"><span class="nav-number"></span> <span class="nav-text">4.1 生成跟踪的损耗</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-2-跟踪收集的消耗"><span class="nav-number"></span> <span class="nav-text">4.2 跟踪收集的消耗</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-3-在生产环境下对负载的影响"><span class="nav-number"></span> <span class="nav-text">4.3 在生产环境下对负载的影响</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-4-可变采样"><span class="nav-number"></span> <span class="nav-text">4.4 可变采样</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-5-应对积极采样-Coping-with-aggressive-sampling"><span class="nav-number"></span> <span class="nav-text">4.5 应对积极采样(Coping with aggressive sampling)</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4-6-在收集过程中额外的采样"><span class="nav-number"></span> <span class="nav-text">4.6 在收集过程中额外的采样</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#5-1-Dapper-Depot-API"><span class="nav-number"></span> <span class="nav-text">5.1 Dapper Depot API</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#5-1-1-DAPI在Google内部的使用"><span class="nav-number"></span> <span class="nav-text">5.1.1 DAPI在Google内部的使用</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#5-2-Dapper的用户接口"><span class="nav-number"></span> <span class="nav-text">5.2 Dapper的用户接口</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-1-在开发中使用Dapper"><span class="nav-number"></span> <span class="nav-text">6.1 在开发中使用Dapper</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-1-1-与异常监控的集成"><span class="nav-number"></span> <span class="nav-text">6.1.1 与异常监控的集成</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-2-解决延迟的长尾效应"><span class="nav-number"></span> <span class="nav-text">6.2 解决延迟的长尾效应</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-3-推断服务依赖"><span class="nav-number"></span> <span class="nav-text">6.3 推断服务依赖</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-4-不同服务的网络使用率"><span class="nav-number"></span> <span class="nav-text">6.4 不同服务的网络使用率</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-5-分层和共享存储系统"><span class="nav-number"></span> <span class="nav-text">6.5 分层和共享存储系统</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6-6-Dapper的救火能力-Firefighting"><span class="nav-number"></span> <span class="nav-text">6.6 Dapper的救火能力(Firefighting)</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#Acknowledgments"><span class="nav-number">1.</span> <span class="nav-text">Acknowledgments</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#References"><span class="nav-number">2.</span> <span class="nav-text">References</span></a></li></ol></li></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
