<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,Apache,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x707E;&amp;#x96BE;&amp;#x6062;&amp;#x590D;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;&amp;#x66F4;&amp;#x7406;&amp;#x60F3;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x9632;&amp;#x707E;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;">
<meta name="keywords" content="后端,Apache">
<meta property="og:type" content="article">
<meta property="og:title" content="Apache Pulsar中的地域复制，第1篇：概念和功能">
<meta property="og:url" content="https://dev.newban.cn/6844903512690655240.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x707E;&amp;#x96BE;&amp;#x6062;&amp;#x590D;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;&amp;#x66F4;&amp;#x7406;&amp;#x60F3;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x9632;&amp;#x707E;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc53160781c42~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">
<meta property="og:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f614362~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">
<meta property="og:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f8aabfc~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">
<meta property="og:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f78739f~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">
<meta property="og:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc531e0fce0bc~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/df95143c875d716ed1abeeac6512f3e6d34b369b128fb11a3c370e12af896951">
<meta property="og:updated_time" content="2024-04-28T05:41:03.693Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Apache Pulsar中的地域复制，第1篇：概念和功能">
<meta name="twitter:description" content="&amp;#x707E;&amp;#x96BE;&amp;#x6062;&amp;#x590D;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;&amp;#x66F4;&amp;#x7406;&amp;#x60F3;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x9632;&amp;#x707E;&amp;#x89C4;&amp;#x5212;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;">
<meta name="twitter:image" content="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc53160781c42~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903512690655240.html">





  <title>Apache Pulsar中的地域复制，第1篇：概念和功能 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">Apache Pulsar中的地域复制，第1篇：概念和功能</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-11-21T10:05:28+08:00">
                2017-11-21
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x707E;&#x96BE;&#x6062;&#x590D;&#x89C4;&#x5212;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x7684;&#x9632;&#x707E;&#x89C4;&#x5212;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x91CD;&#x8981;&#x6027;&#x600E;&#x4E48;&#x5F3A;&#x8C03;&#x90FD;&#x4E0D;&#x4E3A;&#x8FC7;&#xFF0C;&#x6BCF;&#x5468;&#x90FD;&#x4F1A;&#x6709;&#x76F8;&#x5173;&#x7684;&#x5934;&#x6761;&#x65B0;&#x95FB;&#x62A5;&#x9053;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x884C;&#x4E1A;&#xFF0C;&#x5982;&#x679C;&#x906D;&#x9047;&#x65E0;&#x6CD5;&#x9884;&#x89C1;&#x7684;&#x4E8B;&#x4EF6;&#x5E76;&#x5F71;&#x54CD;&#x5230;&#x65E5;&#x5E38;&#x8FD0;&#x7EF4;&#xFF0C;&#x7EC4;&#x7EC7;&#x90FD;&#x9700;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x901F;&#x6062;&#x590D;&#x8FD0;&#x8F6C;&#xFF0C;&#x7EE7;&#x7EED;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x4ECE;&#x6570;&#x636E;&#x5B89;&#x5168;&#x5165;&#x4FB5;&#x5230;&#x81EA;&#x7136;&#x707E;&#x5BB3;&#xFF0C;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x59A5;&#x5584;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x4EE5;&#x4FBF;&#x5FEB;&#x901F;&#x7075;&#x6D3B;&#x5730;&#x5E94;&#x5BF9;&#x707E;&#x96BE;&#x6027;&#x4E8B;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5177;&#x5907;&#x884C;&#x4E4B;&#x6709;&#x6548;&#x7684;&#x707E;&#x96BE;&#x6062;&#x590D;&#x89C4;&#x5212;&#xFF0C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7EC4;&#x7EC7;&#x9762;&#x4E34;&#x5404;&#x79CD;&#x98CE;&#x9669;&#xFF0C;&#x4F8B;&#x5982;&#x906D;&#x53D7;&#x5DE8;&#x5927;&#x7ECF;&#x6D4E;&#x635F;&#x5931;&#x3001;&#x58F0;&#x8A89;&#x53D7;&#x635F;&#xFF0C;&#x751A;&#x81F3;&#x4E3A;&#x7EC4;&#x7EC7;&#x7684;&#x5BA2;&#x6237;&#x548C;&#x7528;&#x6237;&#x9020;&#x6210;&#x66F4;&#x4E25;&#x5CFB;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x5728;&#x591A;&#x9762;&#x6027;&#x7684;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9632;&#x707E;&#x7B56;&#x7565;&#x548C;&#x6062;&#x590D;&#x89C4;&#x5212;&#x9700;&#x8981;&#x90E8;&#x7F72;&#x5728;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x5206;&#x6563;&#x7684;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x3002;&#x5728;&#x6B64;&#x7C7B;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x90E8;&#x7F72;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x5730;&#x57DF;&#x590D;&#x5236;&#x673A;&#x5236;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x5197;&#x4F59;&#xFF0C;&#x4EE5;&#x9632;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x6545;&#x969C;&#x6216;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x7167;&#x5E38;&#x7EE7;&#x7EED;&#x8FD0;&#x4F5C;&#x3002;</p>
<p>&#x672C;&#x6587;&#x548C;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;Apache Pulsar&#x81EA;&#x5E26;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7EA7;&#x529F;&#x80FD;&#xFF1A;<strong>&#x5730;&#x57DF;&#x590D;&#x5236;</strong>&#x3002;Apache Pulsar&#x4F7F;&#x7528;&#x4E86;Apache BookKeeper&#x8FD9;&#x4E00;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x6D41;&#x5B58;&#x50A8;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x8DE8;&#x8D8A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x540C;&#x65F6;&#x652F;&#x6301;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF08;&#x501F;&#x52A9;Apache BookKeeper&#xFF09;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF08;&#x901A;&#x8FC7;Broker&#x7EA7;&#x522B;&#x7684;&#x914D;&#x7F6E;&#xFF09;&#x7684;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x3002;&#x9996;&#x5148;&#x672C;&#x6587;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x529F;&#x80FD;&#xFF0C;&#x4E0B;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x4FA7;&#x91CD;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x90E8;&#x7F72;&#x5B9E;&#x8DF5;&#x3002;</p>
<h2 id="&#x6982;&#x5FF5;"><a href="#&#x6982;&#x5FF5;" class="headerlink" title="&#x6982;&#x5FF5;"></a>&#x6982;&#x5FF5;</h2><p>&#x5730;&#x57DF;&#x590D;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x707E;&#x96BE;&#x6062;&#x590D;&#x673A;&#x5236;&#x3002;&#x867D;&#x7136;&#x5F88;&#x591A;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x90FD;&#x5BA3;&#x79F0;&#x652F;&#x6301;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x53EA;&#x80FD;&#x590D;&#x5236;&#x5230;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x590D;&#x5236;&#x5230;&#x66F4;&#x591A;&#x4F4D;&#x7F6E;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x4E0D;&#x5C11;&#x7684;&#x5C40;&#x9650;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x7528;&#x6237;&#x56F0;&#x60D1;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5F97;&#x4EE5;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7E41;&#x7410;&#x7684;&#x65B9;&#x5F0F;&#x8BD5;&#x7740;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x5728;&#x4ECB;&#x7ECD;Apache Pulsar&#x7684;&#x5730;&#x57DF;&#x590D;&#x5236;&#x529F;&#x80FD;&#x4E4B;&#x524D;&#xFF0C;&#x4E0B;&#x6587;&#x9996;&#x5148;&#x5C06;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x6709;&#x5173;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x6240;&#x7528;&#x7684;&#x5730;&#x57DF;&#x590D;&#x5236;&#x673A;&#x5236;&#x4E3B;&#x8981;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7C7B;&#x522B;&#xFF1A;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x3002;Apache Pulsar&#x53EF;&#x540C;&#x65F6;&#x652F;&#x6301;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#x4E0B;&#x6587;&#x56FE;1&#x5C55;&#x793A;&#x4E86;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x672C;&#x4F8B;&#x5047;&#x8BBE;&#x4E86;3&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF1A;<strong>us-west</strong>&#x3001;<strong>us-central</strong>&#x548C;<strong>us-east</strong>&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5411;<strong>us-central</strong>&#x53D1;&#x51FA;&#x5199;&#x64CD;&#x4F5C;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5411;us-central&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x5199;&#x5165;us-central&#x7684;&#x6570;&#x636E;&#x4F1A;&#x590D;&#x5236;&#x5230;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF1A;us-west&#x548C;us-east&#x3002;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x5728;&#x5927;&#x591A;&#x6570;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x786E;&#x8BA4;&#x5199;&#x64CD;&#x4F5C;&#x5DF2;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x624D;&#x4F1A;&#x83B7;&#x5F97;&#x6709;&#x5173;&#x8BE5;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x7684;&#x786E;&#x8BA4;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x81F3;&#x5C11;&#x8981;&#x6C42;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x786E;&#x8BA4;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x5DF2;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x4E5F;&#x53EB;&#x505A;&#x201C;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x4F1A;&#x4EE5;&#x540C;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x786E;&#x8BA4;&#x3002;</p>
<p><img src="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc53160781c42~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png" alt><br> &#x56FE;1&#xFF1A;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;</p>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x7684;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x56DE;&#x5E94;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x5728;us-central&#x6210;&#x529F;&#x5B8C;&#x6210;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x540E;&#x7ACB;&#x523B;&#x6536;&#x5230;&#x56DE;&#x5E94;&#x3002;&#x968F;&#x540E;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4F1A;&#x4ECE;us-central&#x590D;&#x5236;&#x5230;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF1A;us-west&#x548C;us-east&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4F1A;&#x4EE5;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x53EF;&#x63D0;&#x4F9B;&#x6700;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x6B64;&#x65F6;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x7269;&#x7406;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5C06;&#x4E3A;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5168;&#x7403;&#x5316;&#x7684;&#x903B;&#x8F91;&#x5B9E;&#x4F8B;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x5728;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x8FD8;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x66F4;&#x5F3A;&#x7684;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x6545;&#x969C;&#xFF0C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x624B;&#x5DE5;&#x64CD;&#x4F5C;&#x5373;&#x53EF;&#x4FDD;&#x969C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x7136;&#x800C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x627F;&#x53D7;&#x989D;&#x5916;&#x7684;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5EF6;&#x8FDF;&#x4F5C;&#x4E3A;&#x4EE3;&#x4EF7;&#xFF0C;&#x7F8E;&#x56FD;&#x4E1C;&#x897F;&#x6D77;&#x5CB8;&#x4E4B;&#x95F4;&#x8FD9;&#x6837;&#x7684;&#x901A;&#x4FE1;&#x5EF6;&#x8FDF;&#x901A;&#x5E38;&#x7EA6;&#x4E3A;&#x6570;&#x5341;&#x6BEB;&#x79D2;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x5EF6;&#x8FDF;&#x66F4;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x56DE;&#x5E94;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4FDD;&#x8BC1;&#x8F83;&#x5F31;&#xFF0C;&#x6BD5;&#x7ADF;&#x590D;&#x5236;&#x662F;&#x5F02;&#x6B65;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x59CB;&#x7EC8;&#x5B58;&#x5728;&#x590D;&#x5236;&#x6EDE;&#x540E;&#xFF08;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x901A;&#x5E38;&#x662F;&#x6307;&#x6570;&#x636E;&#x5C1A;&#x672A;&#x4ECE;&#x6E90;&#x590D;&#x5236;&#x5230;&#x76EE;&#x6807;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x59CB;&#x7EC8;&#x5B58;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x4ECE;&#x6E90;&#x5B8C;&#x5168;&#x590D;&#x5236;&#x5230;&#x76EE;&#x6807;&#x7684;&#x6570;&#x636E;&#x3002;&#x5F53;&#x9762;&#x4E34;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x707E;&#x96BE;&#xFF08;&#x4F8B;&#x5982;&#x6D2A;&#x6C34;&#x3001;&#x706B;&#x707E;&#x3001;&#x5730;&#x9707;&#x7B49;&#x81EA;&#x7136;&#x707E;&#x5BB3;&#xFF0C;&#x6216;&#x65AD;&#x7535;&#x65AD;&#x7F51;&#x7B49;&#x60C5;&#x51B5;&#xFF09;&#x65F6;&#xFF0C;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5C06;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x7531;&#x4E8E;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5F00;&#x53D1;&#x6216;&#x914D;&#x7F6E;&#x65F6;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8003;&#x8651;&#x6B64;&#x7C7B;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x901A;&#x5E38;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4E00;&#x81F4;&#x6027;&#x8981;&#x6C42;&#x4E0D;&#x90A3;&#x4E48;&#x9AD8;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x6216;&#x975E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>Apache Pulsar&#x4F9D;&#x8D56;Apache BookKeeper&#x5B9E;&#x73B0;&#x6301;&#x4E45;&#x7684;&#x6D88;&#x606F;&#x5B58;&#x50A8;&#xFF0C;&#x53EF;&#x540C;&#x65F6;&#x652F;&#x6301;&#x8FD9;&#x4E24;&#x79CD;&#x5730;&#x57DF;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x4ECB;&#x7ECD;&#x7EC6;&#x8282;&#x524D;&#xFF0C;&#x4E0B;&#x6587;&#x6253;&#x7B97;&#x7B80;&#x5355;&#x8C08;&#x8C08;&#x5178;&#x578B;&#x7684;Pulsar&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x89E3;&#x91CA;Apache Pulsar&#x4F55;&#x4EE5;&#x540C;&#x65F6;&#x652F;&#x6301;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x7684;&#x5730;&#x57DF;&#x590D;&#x5236;&#x3002;</p>
<p>&#x56FE;2&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x5B89;&#x88C5;&#x7684;Apache Pulsar&#x3002;Pulsar&#x96C6;&#x7FA4;&#x5305;&#x542B;&#x4E24;&#x5C42;&#xFF1A;&#x4E00;&#x4E2A;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x5C42;&#xFF08;Serving Layer&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x7528;&#x4E8E;&#x4E3A;pub/sub&#x6D41;&#x91CF;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x4E2D;&#x4ECB;&#xFF08;Broker&#xFF09;&#xFF1B;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x6709;&#x72B6;&#x6001;&#x7684;&#x6301;&#x4E45;&#x5C42;&#xFF08;Persistence layer&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x6301;&#x4E45;&#x6D88;&#x606F;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x7684;BookKeeper bookie&#x3002;</p>
<p><img src="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f614362~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png" alt><br> &#x56FE;2&#xFF1A;&#x5178;&#x578B;&#x5B89;&#x88C5;&#x7684;Apache<br> Pulsar</p>
<p>&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;&#x4E86;&#x5B58;&#x50A8;&#x4E0E;pub-sub&#x6D41;&#x91CF;&#x670D;&#x52A1;&#x7684;&#x5206;&#x79BB;&#xFF0C;&#x53EF;&#x83B7;&#x5F97;&#x591A;&#x79CD;&#x4F18;&#x52BF;&#x3002;Broker&#x53EF;&#x4EE5;&#x662F;&#x201C;&#x65E0;&#x72B6;&#x6001;&#x201D;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x4F4E;&#x6210;&#x672C;&#x5B9E;&#x73B0;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x6D41;&#x91CF;&#x8F6C;&#x79FB;&#x3002;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x5DF2;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x591A;&#x79DF;&#x6237;&#x529F;&#x80FD;&#x5F97;&#x4EE5;&#x6210;&#x529F;&#x5B9E;&#x73B0;&#x7684;&#x5173;&#x952E;&#xFF08;&#x6709;&#x5173;&#x591A;&#x79DF;&#x6237;&#x7684;&#x8BE6;&#x60C5;&#x53EF;&#x53C2;&#x9605;&#x8FD9;&#x7BC7;<a href="/external_links/52c80b8726a995031c9d92658857936e.html" target="blank" rel="noopener">&#x535A;&#x5BA2;&#x6587;&#x7AE0;</a>&#xFF09;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x4E5F;&#x662F;&#x4F7F;&#x5F97;Apache Pulsar&#x80FD;&#x591F;&#x540C;&#x65F6;&#x652F;&#x6301;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<h2 id="BookKeeper&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;"><a href="#BookKeeper&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;" class="headerlink" title="BookKeeper&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;"></a>BookKeeper&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;</h2><p>&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7531;Apache BookKeeper&#x5728;&#x5B58;&#x50A8;&#x5C42;&#x4E3A;Pulsar&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5178;&#x578B;&#x7684;Pulsar&#x5B89;&#x88C5;&#x901A;&#x5E38;&#x4F1A;&#x63D0;&#x4F9B;&#x56FE;3&#x6240;&#x793A;&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x3002;</p>
<p><img src="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f8aabfc~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png" alt><br> &#x56FE;3&#xFF1A;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;Pulsar&#x73AF;&#x5883;</p>
<p>&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;Pulsar&#x73AF;&#x5883;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;Zookeeper&#xFF08;&#x4E00;&#x6574;&#x5957;ZooKeeper&#x73AF;&#x5883;&#x5C06;&#x8DE8;&#x8D8A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x8FD0;&#x884C;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x8FD0;&#x884C;&#x7684;Bookie&#x96C6;&#x7FA4;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x540C;&#x6837;&#x5728;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x8FD0;&#x884C;&#x7684;Broker&#x96C6;&#x7FA4;&#x3002;&#x6B64;&#x5916;&#x9700;&#x8981;&#x4E3A;BookKeeper&#x914D;&#x7F6E;&#x4F7F;&#x7528;<strong>&#x533A;&#x57DF;&#x611F;&#x77E5;&#x5B89;&#x653E;&#x7B56;&#x7565;</strong>&#xFF0C;Pulsar Broker&#x5C06;&#x4F7F;&#x7528;&#x8BE5;&#x7B56;&#x7565;&#x8DE8;&#x8D8A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x4E3A;&#x5199;&#x64CD;&#x4F5C;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x6027;&#x4FDD;&#x969C;&#xFF08;&#x4F8B;&#x5982;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#x81F3;&#x5C11;&#x5199;&#x5165;&#x5230;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x3002;</p>
<p><img src="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc5315f78739f~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png" alt><br> &#x56FE;4&#xFF1A;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;Pulsar&#x73AF;&#x5883;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x6545;&#x969C;&#x540E;&#x7684;&#x5E94;&#x5BF9;&#x65B9;&#x5F0F;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x6545;&#x969C;&#xFF0C;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;Pulsar&#x73AF;&#x5883;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6B63;&#x5E38;&#x8FD0;&#x8F6C;&#x3002;&#x5176;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x53D7;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#xFF0C;&#x65E0;&#x8BBA;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x6216;&#x505C;&#x7528;&#x8001;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x505C;&#x673A;&#x589E;&#x51CF;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x6B64;&#x7C7B;&#x914D;&#x7F6E;&#x5F88;&#x9002;&#x5408;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x8F83;&#x9AD8;&#x5EF6;&#x8FDF;&#x7684;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x3002;</p>
<h2 id="Pulsar&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;"><a href="#Pulsar&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;" class="headerlink" title="Pulsar&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;"></a>Pulsar&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;</h2><p>&#x4F5C;&#x4E3A;&#x5BF9;&#x6BD4;&#xFF0C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;Pulsar&#x96C6;&#x7FA4;&#x5305;&#x542B;&#x4F4D;&#x4E8E;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x7684;&#x591A;&#x4E2A;&#x7269;&#x7406;&#x96C6;&#x7FA4;&#x73AF;&#x5883;&#x3002;Pulsar Broker&#x4F1A;&#x5728;&#x8FD9;&#x4E9B;&#x96C6;&#x7FA4;&#x4E4B;&#x95F4;&#x4EE5;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x590D;&#x5236;&#x6570;&#x636E;&#x3002;&#x56FE;5&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;Pulsar&#x73AF;&#x5883;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0E;&#x56FE;3&#x7684;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x73AF;&#x5883;&#x5BF9;&#x6BD4;&#x7740;&#x770B;&#x3002;</p>
<p><img src="https://p1-jj.byteimg.com/tos-cn-i-t2oaga2asx/gold-user-assets/2017/11/21/15fdc531e0fce0bc~tplv-t2oaga2asx-jj-mark:3024:0:0:0:q75.png" alt><br> &#x56FE;5&#xFF1A;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;Pulsar&#x73AF;&#x5883;</p>
<p>&#x5728;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x9488;&#x5BF9;&#x67D0;&#x4E2A;Pulsar&#x4E3B;&#x9898;&#x4EA7;&#x751F;&#x4E86;&#x65B0;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x6D88;&#x606F;&#x9996;&#x5148;&#x4F1A;&#x6301;&#x4E45;&#x4FDD;&#x5B58;&#x5728;&#x672C;&#x5730;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x968F;&#x540E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x5230;&#x8FDC;&#x7A0B;&#x96C6;&#x7FA4;&#x3002;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x6B63;&#x5E38;&#xFF0C;&#x6D88;&#x606F;&#x5747;&#x53EF;&#x4EE5;&#x5728;&#x4F9B;&#x672C;&#x5730;&#x6D88;&#x8017;&#x7684;&#x540C;&#x65F6;&#x7ACB;&#x523B;&#x590D;&#x5236;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x7AEF;&#x5230;&#x7AEF;&#x4EA4;&#x4ED8;&#x5EF6;&#x8FDF;&#x662F;&#x7531;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x5F80;&#x8FD4;&#x8017;&#x65F6;&#xFF08;RTT&#xFF09;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x96C6;&#x7FA4;&#x4E2D;&#x521B;&#x5EFA;&#x751F;&#x4EA7;&#x8005;&#xFF08;Producer&#xFF09;&#x548C;&#x6D88;&#x8D39;&#x8005;&#xFF08;Consumer&#xFF09;&#xFF0C;&#x54EA;&#x6015;&#x6B64;&#x65F6;&#x8FDC;&#x7A0B;&#x96C6;&#x7FA4;&#x5E76;&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#xFF08;&#x4F8B;&#x5982;&#x5728;&#x6709;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF09;&#x3002;</p>
<p>Pulsar&#x4E2D;&#xFF0C;&#x53EF;&#x5728;&#x6BCF;&#x4E2A;&#x8D44;&#x4EA7;&#xFF08;&#x6BCF;&#x4E2A;&#x79DF;&#x6237;&#xFF09;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x542F;&#x7528;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EA;&#x6709;&#x5F53;&#x4E00;&#x4E2A;&#x8D44;&#x4EA7;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x521B;&#x5EFA;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x96C6;&#x7FA4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x5728;&#x96C6;&#x7FA4;&#x95F4;&#x542F;&#x7528;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x3002;&#x867D;&#x7136;&#x4ECE;&#x6743;&#x9650;&#x7684;&#x9650;&#x5236;&#x51FA;&#x53D1;&#xFF0C;&#x5730;&#x57DF;&#x590D;&#x5236;&#x5FC5;&#x987B;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x8D44;&#x4EA7;&#x542F;&#x7528;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x4ECE;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x7684;&#x5C42;&#x9762;&#x52A0;&#x4EE5;&#x7BA1;&#x7406;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x79DF;&#x6237;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x4E2D;&#x5FC3;A&#x3001;B&#x3001;C&#x548C;D&#xFF0C;&#x5373;&#x53EF;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x5FC3;A&#x548C;B&#x4E4B;&#x95F4;&#x4E3A;&#x5730;&#x57DF;&#x590D;&#x5236;&#x521B;&#x5EFA;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x4E3A;C&#x548C;D&#x7684;&#x5730;&#x57DF;&#x590D;&#x5236;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x4E3A;A&#x3001;B&#x3001;C&#x548C;D&#x4E4B;&#x95F4;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#xFF08;Full-mesh&#xFF09;&#x590D;&#x5236;&#x521B;&#x5EFA;&#x7B2C;&#x4E09;&#x4E2A;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x590D;&#x5236;&#x7B56;&#x7565;&#x7684;&#x5B9A;&#x5236;&#x65B9;&#x9762;&#xFF0C;Pulsar&#x4E3A;&#x79DF;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x8BBE;&#x7F6E;&#x4E3B;&#x4ECE;&#x6A21;&#x5F0F;&#x7684;&#x590D;&#x5236;&#xFF0C;&#x53CC;&#x6D3B;&#x53CC;&#x5411;&#x590D;&#x5236;&#xFF0C;&#x4EE5;&#x53CA;&#x5168;&#x8FDE;&#x63A5;&#x590D;&#x5236;&#xFF08;&#x56FE;5&#x5C55;&#x793A;&#x7684;&#x662F;&#x7528;3&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5EFA;&#x7ACB;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x590D;&#x5236;&#xFF09;&#x3002;&#x6B64;&#x5916;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x53EF;&#x7531;Pulsar Broker&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#xFF0C;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x3002;&#x5176;&#x4ED6;pub-sub&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x989D;&#x5916;&#x8BBE;&#x7F6E;&#x590D;&#x6742;&#x7684;&#x8FDB;&#x7A0B;&#x6765;&#x4E3A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x6D88;&#x606F;&#x521B;&#x5EFA;&#x955C;&#x50CF;&#xFF0C;Pulsar&#x7684;&#x5730;&#x57DF;&#x590D;&#x5236;&#x5219;&#x53EF;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x968F;&#x65F6;&#x542F;&#x7528;&#x3001;&#x7981;&#x7528;&#x6216;&#x66F4;&#x6539;&#xFF08;&#x4F8B;&#x5982;&#x4ECE;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x6539;&#x4E3A;&#x53CC;&#x6D3B;&#x53CC;&#x5411;&#x590D;&#x5236;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6761;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#x5373;&#x53EF;&#x3002;&#x6709;&#x5173;Pulsar&#x4E2D;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x5B9E;&#x73B0;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x3001;&#x5931;&#x8D25;&#x56DE;&#x6EDA;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x8BE6;&#x60C5;&#xFF0C;&#x5EFA;&#x8BAE;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<h2 id="Yahoo&#x7684;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;"><a href="#Yahoo&#x7684;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;" class="headerlink" title="Yahoo&#x7684;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;"></a>Yahoo&#x7684;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;</h2><p>Yahoo&#x81EA;&#x4ECE;2015&#x5E74;&#x5F00;&#x59CB;&#xFF0C;&#x5DF2;&#x7ECF;&#x5728;&#x5168;&#x7403;&#x5341;&#x51E0;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x90E8;&#x7F72;&#x4E86;Pulsar&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E86;&#x5168;&#x8FDE;&#x63A5;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E00;&#x5730;&#x57DF;&#x590D;&#x5236;&#x673A;&#x5236;&#x4E3B;&#x8981;&#x88AB;&#x7528;&#x4E8E;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x90AE;&#x4EF6;&#x3001;&#x8D22;&#x7ECF;&#x3001;Gemini&#x5E7F;&#x544A;&#x3001;Sherpa&#xFF08;Yahoo&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x952E;-&#x503C;&#x670D;&#x52A1;&#xFF09;&#x7B49;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x9488;&#x5BF9;&#x8D85;&#x8FC7;140&#x4E07;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x6BCF;&#x5929;&#x590D;&#x5236;&#x4E0A;&#x5343;&#x4E07;&#x4EBF;&#x6761;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x6A21;&#x6765;&#x770B;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x5FC5;&#x8981;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x9AD8;&#x6548;&#x7BA1;&#x7406;&#x590D;&#x5236;&#x8FC7;&#x7A0B;&#x3002;&#x4ECE;&#x589E;&#x51CF;&#x5730;&#x57DF;&#x5230;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x7684;&#x590D;&#x5236;&#x96C6;&#xFF0C;&#x518D;&#x5230;&#x5168;&#x9762;&#x4E86;&#x89E3;&#x6570;&#x636E;&#x5230;&#x5E95;&#x4F1A;&#x88AB;&#x4FDD;&#x5B58;&#x5230;&#x4F55;&#x5904;&#xFF0C;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x91CF;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x4E3A;&#x4F55;&#x590D;&#x5236;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x7684;&#x76D1;&#x89C6;&#x80FD;&#x529B;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x5145;&#x5206;&#x8003;&#x8651;&#x5230;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x5730;&#x57DF;&#x590D;&#x5236;&#x540E;&#xFF0C;&#x4EA7;&#x751F;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#x6216;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x95F4;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x9000;&#x5316;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4F1A;&#x8FDC;&#x8FDC;&#x9AD8;&#x4E8E;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x65F6;&#x5019;&#x3002;&#x56E0;&#x6B64;&#x6240;&#x7528;&#x6D88;&#x606F;&#x548C;&#x5B58;&#x50A8;&#x7EC4;&#x4EF6;&#x4E5F;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x627F;&#x53D7;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x6784;&#x5EFA;&#x79EF;&#x538B;&#xFF0C;&#x53EF;&#x80FD;&#x4ECE;&#x6570;&#x5C0F;&#x65F6;&#x5230;&#x6570;&#x5929;&#x4E0D;&#x7B49;&#x3002;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x6709;&#xFF0C;&#x5F53;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x987A;&#x5229;&#x89E3;&#x51B3;&#x540E;&#xFF0C;&#x5FC5;&#x987B;&#x80FD;&#x7528;&#x5FEB;&#x8FC7;&#x65B0;&#x6D88;&#x606F;&#x62B5;&#x8FBE;&#x7684;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x901F;&#x5730;&#x5904;&#x7406;&#x6389;&#x79EF;&#x538B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x80FD;&#x5BF9;&#x6D41;&#x91CF;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;"><a href="#&#x7ED3;&#x8BBA;" class="headerlink" title="&#x7ED3;&#x8BBA;"></a>&#x7ED3;&#x8BBA;</h2><p>Apache Pulsar&#x5145;&#x5206;&#x5229;&#x7528;&#x4E86;Apache BookKeeper&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6D41;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x540C;&#x65F6;&#x652F;&#x6301;&#x540C;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF08;&#x501F;&#x52A9;Apache BookKeeper&#xFF09;&#x548C;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#xFF08;&#x5728;Broker&#x5C42;&#x9762;&#x914D;&#x7F6E;&#xFF09;&#x7684;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x3002;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x4E24;&#x79CD;&#x5730;&#x57DF;&#x590D;&#x5236;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x63A2;&#x8BA8;&#x4E86;&#x4E24;&#x8005;&#x7684;&#x5DEE;&#x5F02;&#x548C;&#x5FC5;&#x8981;&#x7684;&#x6743;&#x8861;&#x3002;Pulsar&#x53EF;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x673A;&#x5236;&#x540C;&#x65F6;&#x652F;&#x6301;&#x8FD9;&#x4E24;&#x79CD;&#x5730;&#x57DF;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x3002;&#x5E0C;&#x671B;&#x672C;&#x6587;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;Apache Pulsar&#x53CA;&#x5176;&#x5730;&#x57DF;&#x590D;&#x5236;&#x529F;&#x80FD;&#x3002;&#x4E0B;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x5728;Apache Pulsar&#x4E2D;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x5730;&#x57DF;&#x590D;&#x5236;&#x7684;&#x51E0;&#x79CD;&#x5E38;&#x89C1;&#x6A21;&#x5F0F;&#x548C;&#x5B9E;&#x8DF5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5BF9;Pulsar&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x5217;&#x65B9;&#x5F0F;&#x52A0;&#x5165;Pulsar&#x793E;&#x533A;&#xFF1A;</p>
<ul>
<li>Pulsar <a href="/external_links/102c9e9a7a4d03b29ed35463e5597e43.html" target="blank" rel="noopener">Slack&#x9891;&#x9053;</a>&#xFF0C;&#x8BF7;&#x5728;&#x8FD9;&#x91CC;&#x6CE8;&#x518C;&#xFF1A;<a href="/external_links/82d737a72a0cd92065dfac0ae50f5da9.html" target="blank" rel="noopener">apache-pulsar.herokuapp.com/</a>&#x3002;</li>
<li>Pulsar<a href="/external_links/ebeb49b7217db23169b44c689b5c2d52.html" target="blank" rel="noopener">&#x90AE;&#x4EF6;&#x5217;&#x8868;</a>&#x3002;</li>
</ul>
<p>&#x6709;&#x5173;Apache Pulsar&#x9879;&#x76EE;&#x7684;&#x5E38;&#x89C4;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;&#x5B98;&#x7F51;&#xFF1A;<a href="/external_links/23f1fe18d2716ce17d5f03c6e49821d8.html" target="blank" rel="noopener">pulsar.incubator.apache.org/</a> &#xFF0C;&#x6B64;&#x5916;&#x4E5F;&#x53EF;&#x5173;&#x6CE8;Twitter&#x5E10;&#x53F7;<a href="/external_links/b8ba0880e63f73476cd1076f8f4137f0.html" target="blank" rel="noopener">@apache_pulsar</a>&#x3002;</p>
<p><strong>&#x4F5C;&#x8005;</strong>&#xFF1A;Sijie Guo&#xFF0C;<strong>&#x9605;&#x8BFB;&#x82F1;&#x6587;&#x539F;&#x6587;</strong>&#xFF1A;<a href="/external_links/70ac9f1f2111a162e456b08cdaf1d2f2.html" target="blank" rel="noopener">Geo-replication in Apache Pulsar, part 1: concepts and features</a></p>
<p>&#x611F;&#x8C22;<a href="/external_links/5ac3608fb113d288215f9b3bbf82c8c8.html" target="blank" rel="noopener">&#x675C;&#x5C0F;&#x82B3;</a>&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002;</p>
<p> <a href="/external_links/0c10cfe9c274e00f15941334d6bec7ff.html" target="blank" rel="noopener"><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/df95143c875d716ed1abeeac6512f3e6d34b369b128fb11a3c370e12af896951" alt></a>  </p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/4b2dfe8b495cac4ad882dc99fabb9c18.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-Apache/" rel="tag"># 后端,Apache</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903512661295112.html" rel="next" title="Ruby Web 服务器的并发模型与性能">
                <i class="fa fa-chevron-left"></i> Ruby Web 服务器的并发模型与性能
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903512699043848.html" rel="prev" title="加密解密 LatteCake">
                加密解密 LatteCake <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#概念"><span class="nav-number">1.</span> <span class="nav-text">概念</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#BookKeeper中的同步地域复制"><span class="nav-number">2.</span> <span class="nav-text">BookKeeper中的同步地域复制</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Pulsar中的异步地域复制"><span class="nav-number">3.</span> <span class="nav-text">Pulsar中的异步地域复制</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Yahoo的多数据中心复制"><span class="nav-number">4.</span> <span class="nav-text">Yahoo的多数据中心复制</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#结论"><span class="nav-number">5.</span> <span class="nav-text">结论</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
