<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="测试,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x53BB;&amp;#x5E74;&amp;#x6709;&amp;#x5199;&amp;#x8FC7;&amp;#x4E24;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x662F;&amp;#x6D45;&amp;#x8C08;UI&amp;#x81EA;&amp;#x52A8;&amp;#x5316;&amp;#x6D4B;&amp;#x8BD5;&amp;#x548C;&amp;#x6D45;&amp;#x8C08;&amp;#x63A5;&amp;#x53E">
<meta name="keywords" content="测试">
<meta property="og:type" content="article">
<meta property="og:title" content="聊聊自动化测试路上遇到的挑战">
<meta property="og:url" content="https://dev.newban.cn/6844903606424961037.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x53BB;&amp;#x5E74;&amp;#x6709;&amp;#x5199;&amp;#x8FC7;&amp;#x4E24;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x662F;&amp;#x6D45;&amp;#x8C08;UI&amp;#x81EA;&amp;#x52A8;&amp;#x5316;&amp;#x6D4B;&amp;#x8BD5;&amp;#x548C;&amp;#x6D45;&amp;#x8C08;&amp;#x63A5;&amp;#x53E">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/444d40837f0d669785de36b101c8a755c8d524838e5d1026a5f52167adaf4e64">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/8930c776555c7ba07abe2eb78282b7bdbbf369b66aefc3979588e843853965aa">
<meta property="og:updated_time" content="2024-04-28T11:15:45.716Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="聊聊自动化测试路上遇到的挑战">
<meta name="twitter:description" content="&amp;#x53BB;&amp;#x5E74;&amp;#x6709;&amp;#x5199;&amp;#x8FC7;&amp;#x4E24;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x662F;&amp;#x6D45;&amp;#x8C08;UI&amp;#x81EA;&amp;#x52A8;&amp;#x5316;&amp;#x6D4B;&amp;#x8BD5;&amp;#x548C;&amp;#x6D45;&amp;#x8C08;&amp;#x63A5;&amp;#x53E">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/444d40837f0d669785de36b101c8a755c8d524838e5d1026a5f52167adaf4e64">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844903606424961037.html">





  <title>聊聊自动化测试路上遇到的挑战 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">聊聊自动化测试路上遇到的挑战</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2018-05-16T11:20:43+08:00">
                2018-05-16
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x53BB;&#x5E74;&#x6709;&#x5199;&#x8FC7;&#x4E24;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x5206;&#x522B;&#x662F;<a href="/external_links/3089ad26b67688f13b0d757d158a17cb.html" target="blank" rel="noopener">&#x6D45;&#x8C08;UI&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;</a>&#x548C;<a href="/external_links/443f9b554341765c2920d3b49054205c.html" target="blank" rel="noopener">&#x6D45;&#x8C08;&#x63A5;&#x53E3;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;</a>&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4ECA;&#x5E74;&#x8F6C;&#x5C97;&#x4E13;&#x95E8;&#x505A;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#xFF0C;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>&#x9042;&#x91CD;&#x5F00;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x804A;&#x804A;&#x6700;&#x8FD1;&#x505A;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x9047;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x548C;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x3002;&#x3002;&#x3002;</p>
<p><strong>&#x4E00;&#x3001;&#x6D4B;&#x8BD5;&#x8303;&#x56F4;</strong></p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD8;&#x662F;&#x81EA;&#x52A8;&#x5316;&#x6216;&#x8005;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x662F;&#x660E;&#x786E;&#x6D4B;&#x8BD5;&#x8303;&#x56F4;&#x548C;&#x9700;&#x6C42;&#x6307;&#x6807;&#x3002;&#x5BF9;&#x4E8E;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x6765;&#x8BF4;&#xFF0C;&#x7279;&#x522B;&#x662F;UI&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x529F;&#x80FD;&#x70B9;&#x90FD;&#x9002;&#x5408;&#x505A;UI&#x81EA;&#x52A8;&#x5316;&#x3002;</p>
<p>&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x4E1A;&#x52A1;&#x60C5;&#x51B5;&#x548C;&#x9879;&#x76EE;&#x7A33;&#x5B9A;&#x7A0B;&#x5EA6;&#xFF0C;&#x9009;&#x62E9;<strong>UI&#x81EA;&#x52A8;&#x5316;+API&#x81EA;&#x52A8;&#x5316;</strong>&#x7ED3;&#x5408;&#xFF0C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x4E1A;&#x52A1;&#x70B9;&#x6765;&#x8FDB;&#x884C;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#xFF0C;&#x624D;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4EC0;&#x4E48;&#x9879;&#x76EE;&#x9002;&#x5408;&#x505A;UI&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x535A;&#x5BA2;<a href="/external_links/3089ad26b67688f13b0d757d158a17cb.html" target="blank" rel="noopener">&#x6D45;&#x8C08;UI&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;</a>&#x91CC;&#x5DF2;&#x7ECF;&#x5206;&#x6790;&#x8FC7;&#xFF0C;&#x8FD9;&#x91CC;&#x5217;&#x51E0;&#x4E2A;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x505A;UI&#x81EA;&#x52A8;&#x5316;&#x7684;&#x70B9;&#xFF1A;</p>
<p>&#x2460;&#x3001;&#x4F7F;&#x7528;&#x9891;&#x6B21;&#x8F83;&#x9AD8;&#xFF0C;&#x5F02;&#x5E38;&#x5224;&#x65AD;&#x8F83;&#x591A;&#xFF0C;&#x4E14;&#x6700;&#x57FA;&#x7840;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x3001;&#x767B;&#x5F55;&#xFF1B;</p>
<p>&#x2461;&#x3001;&#x7528;&#x6237;&#x7AEF;&#x6BD4;&#x8F83;&#x6838;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x8BA2;&#x5355;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F1A;&#x5458;&#x4E2D;&#x5FC3;&#xFF1B;</p>
<p>&#x2462;&#x3001;&#x4FC3;&#x9500;&#x6D3B;&#x52A8;&#x9875;&#x9762;&#x3001;&#x4FE1;&#x606F;&#x5C55;&#x793A;&#x9875;&#x7B49;&#xFF1B;</p>
<p>&#x5206;&#x5C42;&#x6D4B;&#x8BD5;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E4B;&#x524D;&#x4E5F;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#xFF0C;&#x5206;&#x5C42;&#x6D4B;&#x8BD5;&#x91D1;&#x5B57;&#x5854;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/444d40837f0d669785de36b101c8a755c8d524838e5d1026a5f52167adaf4e64" alt></p>
<p>&#x4ECE;&#x6548;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x5355;&#x5143;&#x81EA;&#x52A8;&#x5316;&#x662F;&#x6536;&#x76CA;&#x6700;&#x9AD8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5355;&#x5143;&#x81EA;&#x52A8;&#x5316;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x96BE;&#x5EA6;&#x592A;&#x5927;&#x3002;</p>
<p>&#x4E14;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x5C0F;&#x578B;&#x4F01;&#x4E1A;&#xFF0C;&#x5F00;&#x53D1;&#x672C;&#x8EAB;&#x7684;&#x5F00;&#x53D1;&#x89C4;&#x8303;&#x3001;&#x7BA1;&#x7406;&#x7B49;&#x5DE5;&#x4F5C;&#x4E5F;&#x505A;&#x7684;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x5355;&#x5143;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5B9E;&#x73B0;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x77ED;&#x671F;&#x5185;&#x4E0D;&#x770B;&#x597D;&#x3002;</p>
<p>&#x800C;&#x63A5;&#x53E3;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#x662F;&#x6027;&#x4EF7;&#x6BD4;&#x6700;&#x9AD8;&#x7684;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x3002;</p>
<p>UI&#x81EA;&#x52A8;&#x5316;&#x7684;&#x6295;&#x5165;&#x548C;&#x4EA7;&#x51FA;&#x6BD4;&#xFF0C;&#x662F;&#x4E09;&#x79CD;&#x6A21;&#x578B;&#x4E2D;&#x6700;&#x4F4E;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x7684;&#x5927;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;UI&#x81EA;&#x52A8;&#x5316;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x53D1;&#x5E03;&#x540E;&#x5192;&#x70DF;&#x6D4B;&#x8BD5;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;</strong></p>
<p>&#x5BF9;&#x5927;&#x591A;&#x6570;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E0D;&#x7528;&#x592A;&#x591A;&#x5173;&#x6CE8;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x81EA;&#x52A8;&#x5316;&#x6216;&#x8005;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x662F;&#x524D;&#x671F;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;&#x6280;&#x672F;&#x65B9;&#x6848;&#x9009;&#x578B;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7C7B;&#x578B;&#xFF0C;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#x6846;&#x67B6;&#xFF08;&#x5982;&#x679C;&#x8981;&#x8FDB;&#x884C;API&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x6240;&#x91C7;&#x7528;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x662F;&#x7ED5;&#x4E0D;&#x8FC7;&#x53BB;&#x7684;&#x4E00;&#x70B9;&#xFF09;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x90E8;&#x7F72;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x3002;</p>
<p>PS&#xFF1A;&#x6211;&#x76EE;&#x524D;&#x5C31;&#x804C;&#x7684;&#x8FD9;&#x5BB6;&#x4F01;&#x4E1A;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5FAE;&#x8F6F;&#x5168;&#x5BB6;&#x6876;&#x5957;&#x9910;&#x91CC;&#x9762;&#x7684;SQL server&#xFF0C;&#x800C;&#x6211;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x662F;python&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5BF9;SQL server&#x548C;Oracle&#x7684;&#x652F;&#x6301;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x5BFC;&#x81F4;&#x5728;&#x6570;&#x636E;&#x5E93;&#x914D;&#x7F6E;&#x65F6;&#x5019;&#xFF0C;&#x8E29;&#x4E86;&#x5F88;&#x591A;&#x5751;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x6700;&#x540E;&#x4E5F;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5173;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x719F;&#x6089;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#xFF1A;&#x6BD4;&#x5982;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x662F;java&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x672C;&#x8EAB;&#x4F7F;&#x7528;&#x7684;&#x811A;&#x672C;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x4E5F;&#x662F;java&#xFF0C;&#x90A3;&#x4E48;&#x517C;&#x5BB9;&#x6027;&#x5C31;&#x662F;&#x5F88;&#x597D;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x5F00;&#x53D1;&#x540C;&#x4E8B;&#x5E2E;&#x5FD9;&#x89E3;&#x51B3;&#xFF0C;</p>
<p>&#x8FD9;&#x6837;&#x65E0;&#x5F62;&#x4E2D;&#x4E5F;&#x8282;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x63D0;&#x5347;&#xFF0C;&#x4E5F;&#x662F;&#x4E0D;&#x5C0F;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x719F;&#x6089;&#x4E86;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x540E;&#xFF0C;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x8003;&#x8651;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#xFF0C;&#x6280;&#x672F;&#x65B9;&#x6848;&#x9009;&#x578B;&#xFF0C;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x8981;&#x7528;&#x56FA;&#x6709;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x8981;<strong>&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;</strong>&#x3002;</p>
<p>&#x9644;&#xFF1A;<a href="/external_links/25847f99d49e388ca4a42386a14ddb42.html" target="blank" rel="noopener">python&#xFF1A;&#x5229;&#x7528;pymmsql&#x6A21;&#x5757;&#x64CD;&#x4F5C;SQL server&#x6570;&#x636E;&#x5E93;</a></p>
<p><strong>&#x4E09;&#x3001;&#x9879;&#x76EE;&#x60C5;&#x51B5;</strong></p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x70B9;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x6C9F;&#x901A;&#x6765;&#x786E;&#x8BA4;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x9002;&#x5408;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#xFF1F;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/8930c776555c7ba07abe2eb78282b7bdbbf369b66aefc3979588e843853965aa" alt></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x5927;&#x6982;&#x7F57;&#x5217;&#x4E86;&#x4E00;&#x4E9B;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x7684;&#x9879;&#x76EE;&#x6240;&#x5177;&#x5907;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5168;&#x90E8;&#x5177;&#x5907;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x51E0;&#x70B9;&#x5373;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#xFF08;&#x7EA2;&#x8272;&#x7EBF;&#x6761;&#x6807;&#x6CE8;&#x90E8;&#x5206;&#x4E3A;&#x57FA;&#x672C;&#x7684;&#x6761;&#x4EF6;&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x9879;&#x76EE;&#x60C5;&#x51B5;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E9B;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><strong>&#x2460;&#x3001;&#x6587;&#x6863;&#x7BA1;&#x7406;</strong></p>
<p>&#x6587;&#x6863;&#x5305;&#x62EC;&#x9700;&#x6C42;&#x6587;&#x6863;&#x3001;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x3001;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x3001;&#x6D4B;&#x8BD5;&#x89C4;&#x8303;&#x3001;&#x5F00;&#x53D1;&#x89C4;&#x8303;&#x3001;&#x6570;&#x636E;&#x5E93;&#x8868;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#x3001;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x7B49;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6587;&#x6863;&#x4E0D;&#x592A;&#x5B8C;&#x5584;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#xFF0C;&#x524D;&#x671F;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x5C31;&#x9700;&#x8981;&#x6295;&#x5165;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;</p>
<p>PS&#xFF1A;&#x6BD4;&#x5982;&#x8981;&#x8FDB;&#x884C;API&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x63A5;&#x53E3;&#x6587;&#x6863;&#xFF0C;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5E93;&#x8868;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#xFF0C;&#x90A3;&#x4E48;&#x5173;&#x4E8E;API&#x7684;&#x63A5;&#x53E3;&#x8BF4;&#x660E;&#xFF0C;&#x5165;&#x53C2;&#x51FA;&#x53C2;&#x8BF4;&#x660E;&#xFF0C;&#x8FD9;&#x5C06;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x9644;&#x5E26;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x800C;&#x6587;&#x6863;&#x6570;&#x636E;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x53C8;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x6570;&#x636E;&#x5E93;&#x786E;&#x8BA4;&#x63A5;&#x53E3;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868;&#x5B57;&#x6BB5;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x5DF1;&#x6574;&#x7406;&#x4EE5;&#x53CA;&#x548C;DBA&#x6C9F;&#x901A;&#x719F;&#x6089;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;</p>
<p>&#x800C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x5BF9;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x8BA4;&#x8BC6;&#x592A;&#x7247;&#x9762;&#xFF0C;&#x8BA4;&#x4E3A;&#x81EA;&#x52A8;&#x5316;&#x53EF;&#x4EE5;&#x66FF;&#x4EE3;&#x4EBA;&#x53D1;&#x73B0;&#x5F88;&#x591A;BUG&#xFF0C;&#x4E14;&#x8FFD;&#x6C42;&#x77ED;&#x671F;&#x7684;&#x660E;&#x663E;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8F83;&#x5B8C;&#x5584;&#x7684;&#x6587;&#x6863;&#x7BA1;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x5728;&#x524D;&#x671F;&#x7684;&#x51C6;&#x5907;&#x9636;&#x6BB5;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x5C06;&#x5F71;&#x54CD;</p>
<p>leader&#x5BF9;&#x4E2A;&#x4EBA;&#x80FD;&#x529B;&#x548C;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x7684;&#x6000;&#x7591;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x4E5F;&#x662F;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x5B58;&#x5728;&#x7684;&#x5F0A;&#x7AEF;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x603B;&#x5F52;&#x662F;&#x8981;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4EFB;&#x52A1;&#x62C6;&#x5206;&#x548C;&#x5DE5;&#x65F6;&#x9884;&#x4F30;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x8003;&#x8651;&#x8FDB;&#x53BB;&#xFF0C;&#x8BA1;&#x7B97;&#x5728;&#x4E2A;&#x4EBA;&#x5DE5;&#x65F6;&#x4E2D;&#xFF0C;&#x5E76;&#x6CE8;&#x660E;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x548C;leader&#x751A;&#x81F3;&#x66F4;&#x9AD8;&#x5C42;&#x8BC4;&#x4F30;&#x4E2D;&#xFF0C;&#x629B;&#x51FA;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#xFF0C;</p>
<p>&#x63A8;&#x52A8;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x7684;&#x4E00;&#x79CD;&#x4EF7;&#x503C;&#x4F53;&#x73B0;&#x3002;</p>
<p><strong>&#x2461;&#x3001;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;</strong></p>
<p>&#x9879;&#x76EE;&#x7684;&#x9700;&#x6C42;&#x8FED;&#x4EE3;&#x662F;&#x5426;&#x7A33;&#x5B9A;&#xFF1F;&#x4ECE;&#x9700;&#x6C42;&#x8BC4;&#x5BA1;&#x5230;&#x5F00;&#x53D1;&#x3001;&#x6D4B;&#x8BD5;&#x3001;&#x53D1;&#x5E03;&#x4E0A;&#x7EBF;&#x662F;&#x5426;&#x6709;&#x6BD4;&#x8F83;&#x89C4;&#x8303;&#x7684;&#x6D41;&#x7A0B;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x9700;&#x6C42;&#x8FED;&#x4EE3;&#x8F83;&#x5FEB;&#x6216;&#x8005;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x7684;&#x811A;&#x672C;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x91CF;&#x5C06;&#x6210;&#x500D;&#x589E;&#x957F;&#xFF1B;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8F83;&#x597D;&#x7684;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x4F5C;&#x7684;&#x8FDB;&#x5C55;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x5F88;&#x591A;&#x4E0D;&#x53EF;&#x63CF;&#x8FF0;&#x7684;&#x5751;&#xFF0C;&#x6C9F;&#x901A;&#x6210;&#x672C;&#xFF0C;&#x53D8;&#x66F4;&#x6210;&#x672C;&#x7B49;&#xFF0C;&#x8FD8;&#x4F1A;&#x5F71;&#x54CD;&#x5230;</p>
<p>&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x89C4;&#x5212;&#x3002;</p>
<p>&#x5728;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x719F;&#x6089;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x70B9;&#xFF0C;&#x505A;&#x597D;&#x5E94;&#x5BF9;&#x7684;&#x51C6;&#x5907;&#x3002;<strong>&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53D8;&#x5316;&#x662F;&#x6700;&#x5927;&#x7684;&#x6311;&#x6218;&#xFF01;&#xFF01;&#xFF01;</strong></p>
<p><strong>&#x56DB;&#x3001;&#x201C;&#x76EE;&#x6807;&#x201D;&#x4E00;&#x81F4;</strong></p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x76EE;&#x6807;&#x201D;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x4E2A;&#x4EBA;&#x5BF9;&#x5DE5;&#x4F5C;&#x7684;&#x76EE;&#x6807;&#x8BBE;&#x5B9A;&#x548C;leader&#x5BF9;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x4F5C;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x7AD9;&#x7684;&#x89D2;&#x5EA6;&#x4E0D;&#x540C;&#xFF0C;&#x7406;&#x89E3;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x8FBE;&#x6210;&#x5B8C;&#x5168;&#x7684;&#x4E00;&#x81F4;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;<strong>&#x6C9F;&#x901A;&#x7684;&#x91CD;&#x8981;&#x6027;</strong>&#x3002;</p>
<p>&#x4E2A;&#x4EBA;&#x9488;&#x5BF9;&#x7CFB;&#x7EDF;&#x60C5;&#x51B5;&#xFF0C;&#x6280;&#x672F;&#x67B6;&#x6784;&#xFF0C;&#x6D4B;&#x8BD5;&#x8303;&#x56F4;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#x548C;&#x76EE;&#x6807;&#x8BBE;&#x5B9A;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0E;leader&#x4E0D;&#x65AD;&#x6C9F;&#x901A;&#xFF0C;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#xFF0C;&#x8FBE;&#x6210;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x80FD;&#x907F;&#x514D;&#x5F88;&#x591A;&#x540E;&#x7EED;&#x7684;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x76EE;&#x6807;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x9700;&#x6C42;&#xFF0C;&#x8FDB;&#x884C;&#x4EFB;&#x52A1;&#x62C6;&#x5206;&#xFF0C;&#x8BC4;&#x5BA1;&#xFF0C;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<strong>&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x8C03;&#x6574;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x8010;&#x5FC3;&#x548C;&#x575A;&#x6301;&#xFF01;</strong></p>
<p><strong>&#x4E94;&#x3001;&#x8FD0;&#x884C;&#x73AF;&#x5883;</strong></p>
<p>&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x5F00;&#x53D1;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x73AF;&#x5883;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E0B;&#x9762;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x8BF4;&#x8BF4;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x601D;&#x8DEF;&#xFF1A;</p>
<p><strong>1&#x3001;SIT&#x73AF;&#x5883;&#xFF1A;</strong></p>
<p>SIT&#x73AF;&#x5883;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x7CFB;&#x7EDF;&#x96C6;&#x6210;&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF0C;&#x5982;&#x679C;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x662F;&#x57FA;&#x4E8E;SIT&#x73AF;&#x5883;&#x5F00;&#x53D1;&#x8C03;&#x8BD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;SIT&#x73AF;&#x5883;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#xFF0C;SIT&#x73AF;&#x5883;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x591A;&#x6B21;&#x7684;&#x63D0;&#x4EA4;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EA4;&#x53C9;&#x5F71;&#x54CD;&#x8F83;&#x5927;&#xFF0C;&#x4E14;SIT&#x73AF;&#x5883;&#x548C;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x5DEE;&#x5F02;&#x7684;&#xFF08;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x76F8;&#x4FE1;&#x6D4B;&#x8BD5;&#x7AE5;&#x978B;&#xFF0C;&#x90FD;&#x660E;&#x767D;&#x5176;&#x4E2D;&#x7684;&#x75DB;&#x70B9;&#xFF09;&#x3002;</p>
<p><strong>2&#x3001;UAT&#x73AF;&#x5883;&#xFF1A;</strong></p>
<p>UAT&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x9A8C;&#x6536;&#x73AF;&#x5883;&#xFF0C;&#x5F53;&#x7136;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x7070;&#x5EA6;&#x73AF;&#x5883;&#x7B49;&#x3002;UAT&#x73AF;&#x5883;&#x76F8;&#x5BF9;SIT&#x73AF;&#x5883;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x4E14;&#x548C;&#x751F;&#x4EA7;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x8F83;&#x9AD8;&#x7684;&#xFF0C;&#x5F88;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x5F00;&#x53D1;&#x548C;&#x8C03;&#x8BD5;&#xFF0C;&#x4EE5;&#x53CA;&#x65E5;&#x5E38;&#x7684;&#x6D4B;&#x8BD5;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x4F46;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x7684;&#x4F5C;&#x7528;&#x53C8;&#x4E0D;&#x9650;&#x4E8E;&#x8FD9;&#x70B9;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x53D1;&#x5E03;&#x540E;&#x7684;&#x751F;&#x4EA7;&#x5192;&#x70DF;&#xFF0C;&#x5B9A;&#x65F6;&#x8F6E;&#x8BE2;&#x6D4B;&#x8BD5;&#x7B49;&#x3002;</p>
<p><strong>3&#x3001;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF1A;</strong></p>
<p>&#x5982;&#x679C;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x5F00;&#x53D1;&#x548C;&#x8C03;&#x8BD5;&#xFF0C;&#x4EE5;&#x53CA;&#x6D4B;&#x8BD5;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#x95EE;&#x9898;&#xFF1A;</p>
<p><strong>&#x2460;&#x3001;&#x7F51;&#x7EDC;&#x95EE;&#x9898;</strong></p>
<p>&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x7684;SIT&#x548C;UAT&#x73AF;&#x5883;&#x90FD;&#x662F;&#x90E8;&#x7F72;&#x5728;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#xFF0C;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E5F;&#x662F;&#x8D70;&#x7684;&#x5185;&#x7F51;&#xFF0C;&#x8BF7;&#x6C42;&#x89E3;&#x6790;&#x548C;&#x5916;&#x7F51;&#x6709;&#x4E00;&#x5B9A;&#x533A;&#x522B;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8FD0;&#x884C;&#x811A;&#x672C;&#x8FDB;&#x884C;&#x56DE;&#x5F52;&#x5192;&#x70DF;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x771F;&#x5B9E;&#x7684;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7EDC;&#x5BF9;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x4E2D;&#xFF0C;sleep&#x6700;&#x597D;&#x80FD;&#x4E0D;&#x7528;&#x5C31;&#x4E0D;&#x7528;&#xFF08;&#x7279;&#x522B;&#x662F;UI&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5F3A;&#x5236;&#x7B49;&#x5F85;&#x5BB9;&#x6613;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x4E0D;&#x53EF;&#x63A7;&#x7684;&#x53D8;&#x6570;&#xFF09;&#x3002;</p>
<p><strong>&#x2461;&#x3001;&#x6570;&#x636E;&#x6C61;&#x67D3;&#x95EE;&#x9898;</strong></p>
<p>&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x56DE;&#x5F52;&#x5192;&#x70DF;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x6D4B;&#x8BD5;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x5904;&#x7406;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x4E1A;&#x52A1;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x751F;&#x4EA7;&#x7684;&#x6570;&#x636E;&#x9020;&#x6210;&#x6C61;&#x67D3;&#x3002;&#x5E38;&#x7528;&#x7684;&#x6570;&#x636E;&#x9694;&#x79BB;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x6D4B;&#x8BD5;&#x767D;&#x540D;&#x5355;&#x8D26;&#x53F7;&#x3001;&#x7F51;&#x7EDC;&#x6807;&#x8BB0;&#x3001;&#x7EBF;&#x7A0B;&#x6807;&#x8BB0;&#x3001;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x843D;&#x5165;&#x5BF9;&#x5E94;&#x7684;&#x6D4B;&#x8BD5;&#x5E93;&#xFF0C;&#x67D0;&#x4E9B;&#x4E1A;&#x52A1;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;MOCK&#x5BF9;&#x8C61;&#x548C;&#x6321;&#x677F;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x6570;&#x636E;&#x9694;&#x79BB;&#x8FD9;&#x51E0;&#x70B9;&#xFF0C;&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#x4E5F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x9694;&#x79BB;&#xFF0C;&#x907F;&#x514D;&#x751F;&#x4EA7;&#x6570;&#x636E;&#x6C61;&#x67D3;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p><strong>&#x516D;&#x3001;&#x670D;&#x52A1;&#x90E8;&#x7F72;</strong></p>
<p>&#x4E4B;&#x524D;&#x7684;&#x535A;&#x5BA2;<a href="/external_links/c43b5d2999cf37f89dc9c26b399548b0.html" target="blank" rel="noopener">&#x505A;&#x63A5;&#x53E3;&#x6D4B;&#x8BD5;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x6280;&#x80FD;</a>&#x6709;&#x4ECB;&#x7ECD;&#x8FC7;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x3002;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E0D;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x73AF;&#x5883;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;</p>
<p>&#x6301;&#x7EED;&#x96C6;&#x6210;&#x73AF;&#x5883;&#x4E5F;&#x53EB;&#x4F5C;CI&#x73AF;&#x5883;&#xFF0C;&#x7C7B;&#x4F3C;&#x7684;&#x8FD8;&#x6709;CD&#x73AF;&#x5883;&#xFF08;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x5728;&#x654F;&#x6377;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4E0D;&#x8FC7;&#x76EE;&#x524D;&#x884C;&#x4E1A;&#x5185;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x5F00;&#x59CB;&#x642D;&#x5EFA;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x73AF;&#x5883;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x5F88;&#x591A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>&#x2460;&#x3001;&#x7248;&#x672C;&#x8FED;&#x4EE3;&#x63D0;&#x6D4B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CI&#x670D;&#x52A1;&#x4E00;&#x952E;&#x63D0;&#x4EA4;&#xFF0C;&#x8282;&#x7701;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF1B;</p>
<p>&#x2461;&#x3001;&#x5982;&#x679C;&#x9700;&#x8981;&#x9020;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5C0F;&#x811A;&#x672C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x70B9;&#x51FB;&#x542F;&#x52A8;&#x6309;&#x94AE;&#x5373;&#x53EF;&#xFF1B;</p>
<p>&#x2462;&#x3001;&#x53D1;&#x5E03;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CI&#x670D;&#x52A1;&#x81EA;&#x52A8;&#x5316;&#x6253;&#x5305;&#x90E8;&#x7F72;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x4EBA;&#x624B;&#x5DE5;&#x6253;&#x5305;&#x914D;&#x7F6E;&#x65F6;&#x5019;&#x7684;&#x8BEF;&#x64CD;&#x4F5C;&#x7B49;&#x95EE;&#x9898;&#xFF1B;</p>
<p>&#x2463;&#x3001;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#xFF0C;&#x90E8;&#x7F72;&#x5728;CI&#x73AF;&#x5883;&#x540E;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x70B9;&#x51FB;&#x542F;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x8BBE;&#x7F6E;&#x51FA;&#x53D1;&#x6761;&#x4EF6;&#xFF0C;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6765;&#x505A;&#x5230;&#x751F;&#x4EA7;&#x5B9A;&#x65F6;&#x8F6E;&#x8BE2;&#xFF0C;&#x53D1;&#x5E03;&#x540E;&#x5192;&#x70DF;&#x7B49;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#xFF1B;</p>
<p>CI&#x73AF;&#x5883;&#x5982;&#x4F55;&#x90E8;&#x7F72;&#xFF1F;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x535A;&#x5BA2;&#xFF1A;<a href="/external_links/18493580ddc47037496a47e0c3639a55.html" target="blank" rel="noopener">linux&#x73AF;&#x5883;&#xFF1A;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x7CFB;&#x5217;</a></p>
<p><strong>&#x4E03;&#x3001;&#x6D4B;&#x8BD5;&#x7B56;&#x7565;</strong></p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF1A;</p>
<p><strong>1&#x3001;&#x4EFB;&#x52A1;&#x62C6;&#x5206;</strong></p>
<p>&#x786E;&#x8BA4;&#x6D4B;&#x8BD5;&#x8303;&#x56F4;&#x548C;&#x9700;&#x6C42;&#x6307;&#x6807;&#x540E;&#xFF0C;&#x5C06;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x7C92;&#x5EA6;&#x66F4;&#x5C0F;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x5C06;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x6240;&#x9700;&#x65F6;&#x95F4;&#x7CBE;&#x786E;&#x5230;<strong>&#x4EBA;/&#x5929;</strong>&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x6309;&#x65F6;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#xFF1B;</p>
<p><strong>2&#x3001;&#x4F18;&#x5148;&#x7EA7;</strong></p>
<p>&#x4EFB;&#x52A1;&#x62C6;&#x5206;&#x540E;&#xFF0C;&#x5BF9;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x4F18;&#x5148;&#x7EA7;&#x6392;&#x5E8F;&#xFF0C;&#x901A;&#x8FC7;&#x8BC4;&#x5BA1;&#x6C9F;&#x901A;&#xFF0C;&#x786E;&#x8BA4;&#x5148;&#x5B8C;&#x6210;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5B8C;&#x6210;&#x54EA;&#x4E9B;&#x7B49;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5206;&#x4E3A;&#x7B2C;&#x4E00;&#x671F;&#x3001;&#x7B2C;&#x4E8C;&#x671F;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x7B2C;&#x4E00;&#x671F;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x8986;&#x76D6;&#x7387;&#xFF0C;&#x5148;&#x5B9E;&#x73B0;PC&#x7AEF;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#xFF0C;&#x7B2C;&#x4E8C;&#x671F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x8986;&#x76D6;&#xFF0C;</p>
<p>&#x7B2C;&#x4E09;&#x671F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5E73;&#x53F0;&#x7684;&#x5F00;&#x53D1;&#x7B49;&#x7B49;&#x3002;&#x6709;&#x76EE;&#x6807;&#x6709;&#x8BA1;&#x5212;&#xFF0C;&#x6839;&#x636E;&#x9879;&#x76EE;&#x53D8;&#x5316;&#x548C;&#x8FDB;&#x5EA6;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x81EA;&#x52A8;&#x5316;&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x6392;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x51E0;&#x70B9;&#xFF1A;</p>
<p>&#x2460;&#x3001;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x8D8A;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x5E94;&#x8BE5;&#x6700;&#x9AD8;&#xFF1B;</p>
<p>&#x2461;&#x3001;&#x7CFB;&#x7EDF;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x5E94;&#x8BE5;&#x6392;&#x5728;&#x4F18;&#x5148;&#x7EA7;&#x524D;&#x5217;&#xFF1B;</p>
<p>&#x2462;&#x3001;&#x7CFB;&#x7EDF;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF08;&#x6BD4;&#x5982;&#x652F;&#x4ED8;&#x3001;&#x8BA2;&#x5355;&#xFF09;&#x5E94;&#x8BE5;&#x8F83;&#x65E9;&#x7684;&#x8986;&#x76D6;&#xFF1B;</p>
<p>&#x2463;&#x3001;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x751F;&#x4EA7;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x53EB;&#x591A;&#x7684;&#x529F;&#x80FD;&#x70B9;&#xFF0C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8986;&#x76D6;&#xFF1B;</p>
<p><strong>3&#x3001;&#x5DE5;&#x65F6;&#x9884;&#x4F30;</strong></p>
<p>&#x524D;&#x671F;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF08;&#x6BD4;&#x5982;&#x8303;&#x56F4;&#x786E;&#x8BA4;&#x3001;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;CI&#x73AF;&#x5883;&#x90E8;&#x7F72;&#x3001;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#x3001;&#x6280;&#x672F;&#x6846;&#x67B6;&#x9009;&#x578B;&#x3001;&#x6587;&#x6863;&#x6574;&#x7406;&#x7B49;&#xFF09;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x5177;&#x4F53;&#x7684;&#x62C6;&#x5206;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x5DE5;&#x65F6;&#x9884;&#x4F30;&#xFF0C;&#x4EE5;&#x786E;&#x8BA4;&#x5DE5;&#x4F5C;&#x9636;&#x6BB5;&#x6027;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;</p>
<p>&#x65B9;&#x4FBF;&#x968F;&#x65F6;&#x8C03;&#x6574;&#x3002;&#x5DE5;&#x65F6;&#x9884;&#x4F30;&#x9700;&#x8981;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<p>&#x2460;&#x3001;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x4E2A;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x7279;&#x70B9;&#xFF1B;</p>
<p>&#x2461;&#x3001;&#x9879;&#x76EE;&#x60C5;&#x51B5;&#x3001;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x3001;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x5316;&#x7A0B;&#x5EA6;&#xFF1B;</p>
<p>&#x2462;&#x3001;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#xFF1B;</p>
<p><strong>&#x516B;&#x3001;&#x89E3;&#x51B3;&#x95EE;&#x9898;</strong></p>
<p><strong>&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x9053;&#x8DEF;&#x4E0A;&#xFF0C;&#x5168;&#x662F;&#x5751;&#xFF01;&#xFF01;&#xFF01;</strong></p>
<p>&#x5DE5;&#x4F5C;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x9047;&#x5230;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x6C9F;&#x901A;&#x95EE;&#x9898;&#x3001;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x3001;&#x6280;&#x672F;&#x96BE;&#x70B9;&#x3001;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x4E0D;&#x53EF;&#x63CF;&#x8FF0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#xFF0C;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x83B7;&#x5F97;&#x8BE5;&#x6709;&#x7684;&#x6536;&#x83B7;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7684;&#x4F01;&#x4E1A;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6CA1;&#x6709;&#x5B8C;&#x7F8E;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x56E0;&#x6B64;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x5B66;&#x4F1A;&#x9002;&#x5E94;&#x73AF;&#x5883;&#xFF0C;&#x878D;&#x6D3D;&#x6C9F;&#x901A;&#xFF0C;&#x4E5F;&#x662F;&#x5DE5;&#x4F5C;&#x4E2D;&#x5FC5;&#x987B;&#x7684;&#x4E00;&#x9879;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x62FF;&#x94B1;&#x6D88;&#x707E;&#xFF0C;<strong>&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x521B;&#x9020;&#x4EF7;&#x503C;&#xFF01;&#xFF01;&#xFF01;</strong></p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x826F;&#x597D;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x575A;&#x6301;&#x4E0D;&#x61C8;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x7AE5;&#x978B;&#x6240;&#x5177;&#x5907;&#x7684;&#x3002;&#x3002;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x5728;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6311;&#x6218;&#xFF0C;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x4E3A;&#x770B;&#x5230;&#x7684;&#x7AE5;&#x978B;&#x63D0;&#x4F9B;&#x4E00;&#x5B9A;&#x7684;&#x601D;&#x8DEF;&#x548C;&#x5E2E;&#x52A9;&#xFF0C;&#x4EC5;&#x4F9B;&#x53C2;&#x8003;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5176;&#x4E2D;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x62FF;&#x51FA;&#x6765;&#x5355;&#x72EC;&#x8BF4;&#xFF0C;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x503C;&#x5F97;&#x63A2;&#x8BA8;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x5206;&#x6790;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x3002;&#x3002;&#x3002;</p>
<p> Has anything you&#x2019;ve done made your life better?</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/c4d73b9550fd399c0dea9c6eb44f2c0f.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/测试/" rel="tag"># 测试</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903606395781127.html" rel="next" title="如何准备Java初级和高级的技术面试">
                <i class="fa fa-chevron-left"></i> 如何准备Java初级和高级的技术面试
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844903613609803783.html" rel="prev" title="Axios源码深度剖析 - AJAX新王者">
                Axios源码深度剖析 - AJAX新王者 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
