<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="架构,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x5173;&amp;#x6CE8;&amp;#x300C; IT&amp;#x8001;&amp;#x5175;&amp;#x54E5;&amp;#x300D;&amp;#xFF0C;&amp;#x8D4B;&amp;#x80FD;&amp;#x7A0B;&amp;#x5E8F;&amp;#x4EBA;&amp;#x751F;&amp;#xFF01;&amp;#x672C;&amp;#x7CFB;&amp;#x5217;&amp;#x524D;&amp;#x5E8F;&amp;#x6587;&amp;#x7AE0;&amp;#x7D22;&amp;#x5F15;&amp;#xFF">
<meta name="keywords" content="架构">
<meta property="og:type" content="article">
<meta property="og:title" content="程序员，练就哪些技能才胜任架构师？">
<meta property="og:url" content="https://dev.newban.cn/6844904037234507789.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x5173;&amp;#x6CE8;&amp;#x300C; IT&amp;#x8001;&amp;#x5175;&amp;#x54E5;&amp;#x300D;&amp;#xFF0C;&amp;#x8D4B;&amp;#x80FD;&amp;#x7A0B;&amp;#x5E8F;&amp;#x4EBA;&amp;#x751F;&amp;#xFF01;&amp;#x672C;&amp;#x7CFB;&amp;#x5217;&amp;#x524D;&amp;#x5E8F;&amp;#x6587;&amp;#x7AE0;&amp;#x7D22;&amp;#x5F15;&amp;#xFF">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/a4ebaf209d32422d94e949f2ae61a6af09894732defe0160537ec3bd2a7fb9ce">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/5a4cfc3952ffc51778d5140463ba0465db91f4093f2b41be99a27039dfd7a60f">
<meta property="og:updated_time" content="2024-04-28T07:52:45.621Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="程序员，练就哪些技能才胜任架构师？">
<meta name="twitter:description" content="&amp;#x5173;&amp;#x6CE8;&amp;#x300C; IT&amp;#x8001;&amp;#x5175;&amp;#x54E5;&amp;#x300D;&amp;#xFF0C;&amp;#x8D4B;&amp;#x80FD;&amp;#x7A0B;&amp;#x5E8F;&amp;#x4EBA;&amp;#x751F;&amp;#xFF01;&amp;#x672C;&amp;#x7CFB;&amp;#x5217;&amp;#x524D;&amp;#x5E8F;&amp;#x6587;&amp;#x7AE0;&amp;#x7D22;&amp;#x5F15;&amp;#xFF">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/a4ebaf209d32422d94e949f2ae61a6af09894732defe0160537ec3bd2a7fb9ce">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6844904037234507789.html">





  <title>程序员，练就哪些技能才胜任架构师？ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">程序员，练就哪些技能才胜任架构师？</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2020-01-03T14:35:13+08:00">
                2020-01-03
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5173;&#x6CE8;&#x300C; <strong>IT&#x8001;&#x5175;&#x54E5;</strong>&#x300D;&#xFF0C;&#x8D4B;&#x80FD;&#x7A0B;&#x5E8F;&#x4EBA;&#x751F;&#xFF01;&#x672C;&#x7CFB;&#x5217;&#x524D;&#x5E8F;&#x6587;&#x7AE0;&#x7D22;&#x5F15;&#xFF1A;</p>
<ol>
<li><a href="/external_links/3fd13fe90613b04a58fb0fd3c51a2378.html" target="blank" rel="noopener">&#x7A0B;&#x5E8F;&#x5458;&#x4E3A;&#x4EC0;&#x4E48;&#x5FC5;&#x987B;&#x8981;&#x61C2;&#x67B6;&#x6784;&#xFF1F;</a></li>
<li><a href="https://dev.newban.cn/6844904034625650701">&#x67B6;&#x6784;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;</a></li>
<li><a href="https://dev.newban.cn/6844904035066052616">&#x67B6;&#x6784;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#xFF1F;</a></li>
<li><a href="https://dev.newban.cn/6844903971681763335">&#x67B6;&#x6784;&#x5E08;&#x90FD;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;</a></li>
</ol>
<p><strong>&#x67B6;&#x6784;&#x5E08;&#xFF0C;</strong>&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x5458;&#x6253;&#x602A;&#x5347;&#x7EA7;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#xFF0C;&#x5B83;&#x4E0D;&#x50CF;&#x67D0;&#x4E9B;&#x6280;&#x80FD;&#x62A5;&#x4E2A;&#x57F9;&#x8BAD;&#x73ED;&#x5C31;&#x80FD;&#x83B7;&#x5F97;&#x3002;&#x80DC;&#x4EFB;&#x67B6;&#x6784;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x5177;&#x5907;&#x8BB8;&#x591A;&#x6280;&#x80FD;&#xFF0C;&#x65E2;&#x6709;&#x786C;&#x6280;&#x80FD;&#x8FD8;&#x6709;&#x8F6F;&#x6280;&#x80FD;&#x3002;&#x4FD7;&#x8BDD;&#x8BF4;&#xFF1A;&#x4E00;&#x53E3;&#x5403;&#x4E0D;&#x6210;&#x80D6;&#x5B50;&#x3002;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x5230;&#x67B6;&#x6784;&#x5E08;&#x4E5F;&#x65E0;&#x6CD5;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#x3001;&#x7A33;&#x6B65;&#x63D0;&#x5347;&#x7684;&#x8FDB;&#x9636;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x6709;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x8981;&#x638C;&#x63E1;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x591A;&#x9879;&#x6280;&#x80FD;&#x4E4B;&#x95F4;&#x8FD8;&#x5B58;&#x5728;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x60F3;&#x5C3D;&#x5FEB;&#x8F6C;&#x578B;&#x5347;&#x7EA7;&#x81F3;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x90A3;&#x4F60;&#x5FC5;&#x987B;&#x5728;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x6709;&#x610F;&#x8BC6;&#x5730;&#x50A8;&#x5907;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8001;&#x5175;&#x54E5;&#x7ED3;&#x5408;&#x4EB2;&#x8EAB;&#x7ECF;&#x5386;&#x6765;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/a4ebaf209d32422d94e949f2ae61a6af09894732defe0160537ec3bd2a7fb9ce" alt="&#x67B6;&#x6784;&#x5E08;&#x4E4B;&#x786C;&#x6280;&#x80FD;" title="&#x67B6;&#x6784;&#x5E08;&#x4E4B;&#x786C;&#x6280;&#x80FD;"></p>
<ol>
<li>&#x786C;&#x6280;&#x80FD;</li>
</ol>
<hr>
<p>&#x4E0D;&#x50CF;&#x4EA7;&#x54C1;&#x3001;&#x7BA1;&#x7406;&#x7B49;&#x6761;&#x7EBF;&#x66F4;&#x52A0;&#x501A;&#x91CD;&#x901A;&#x7528;&#x6280;&#x80FD;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x6761;&#x7EBF;&#x8F6C;&#x4EA7;&#x54C1;&#x6216;&#x7BA1;&#x7406;&#xFF0C;&#x5165;&#x95E8;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x4E00;&#x4E9B;&#x3002;&#x4F46;&#x4ECE;&#x4EA7;&#x54C1;&#x6216;&#x7BA1;&#x7406;&#x5F88;&#x96BE;&#x8F6C;&#x578B;&#x81F3;&#x67B6;&#x6784;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x4ECE;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x5C97;&#x505A;&#x8D77;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#x548C;&#x79EF;&#x7D2F;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x518D;&#x5230;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x6700;&#x540E;&#x5230;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#x63D0;&#x5347;&#x786C;&#x6280;&#x80FD;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x6784;&#x5EFA;&#x67B6;&#x6784;&#x5E08;&#x786C;&#x6280;&#x80FD;&#x201C;&#x70B9;&#x7EBF;&#x9762;&#x201D;&#x3002;</p>
<h3 id="1-1-&#x70B9;"><a href="#1-1-&#x70B9;" class="headerlink" title="1.1 &#x70B9;"></a>1.1 &#x70B9;</h3><p>&#x8001;&#x5175;&#x54E5;&#x6211;&#x521A;&#x5165;&#x884C;&#x65F6;&#x7684;&#x5C97;&#x4F4D;&#x5C31;&#x662F;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8DDF;&#x5176;&#x4ED6;&#x51E0;&#x4E2A;&#x6BD5;&#x4E1A;&#x751F;&#x4E00;&#x8D77;&#x88AB;&#x5B89;&#x6392;&#x5728;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5E73;&#x53F0;&#x9879;&#x76EE;&#x7EC4;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7531;&#x90E8;&#x95E8;&#x8D44;&#x6DF1;&#x540C;&#x4E8B;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x522B;&#x8D1F;&#x8D23;&#x5F00;&#x53D1;&#x5176;&#x4E2D;&#x67D0;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x51E0;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6211;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x51FD;&#x6570;&#x3001;&#x7C7B;&#x548C;&#x6A21;&#x5757;&#x8FD9;&#x4E2A;&#x7C92;&#x5EA6;&#xFF0C;&#x4E3A;&#x4E86;&#x505A;&#x597D;&#x5DE5;&#x4F5C;&#x6211;&#x8981;&#x94BB;&#x7814;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; C/C++&#xFF0C;&#x4EE5;&#x53CA;&#x719F;&#x6089; Visual C++ MFC&#x3001;Socket &#x7B49;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x6BCF;&#x5468;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x4E3E;&#x884C;&#x4EE3;&#x7801;&#x8BC4;&#x5BA1;&#x4F1A;&#x8BAE;&#xFF0C;&#x9080;&#x8BF7;&#x540C;&#x4E8B;&#x70B9;&#x8BC4;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x7684;&#x81EA;&#x5DF1;&#x5E74;&#x8F7B;&#x6C14;&#x76DB;&#xFF0C;&#x4E0D;&#x7BA1;&#x6536;&#x5230;&#x6B63;&#x9762;&#x6216;&#x8D1F;&#x9762;&#x7684;&#x8BC4;&#x4EF7;&#x90FD;&#x4F1A;&#x6781;&#x5927;&#x5730;&#x6FC0;&#x52B1;&#x81EA;&#x5DF1;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5386;&#x7EC3;&#xFF0C;&#x6211;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x80FD;&#x5F97;&#x4EE5;&#x8F83;&#x5927;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4E5F;&#x517B;&#x6210;&#x4E86;&#x8F83;&#x89C4;&#x8303;&#x7684;&#x7F16;&#x7801;&#x4E60;&#x60EF;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x597D;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3001;&#x7C7B;&#x548C;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x524D;&#x540E;&#x505A;&#x4E86;&#x4E24;&#x5E74;&#x5DE6;&#x53F3;&#x65F6;&#x95F4;&#xFF0C;&#x540E;&#x9762;&#x534A;&#x5E74;&#x8FD8;&#x505A;&#x4E86;&#x4E9B;&#x7CFB;&#x7EDF;&#x63A8;&#x5E7F;&#x57F9;&#x8BAD;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x542F;&#x52A8;&#x4E86;&#x91C7;&#x7528;&#x811A;&#x672C;&#x8BED;&#x8A00; Python &#x4F5C;&#x4E3A;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6211;&#x8D1F;&#x8D23;&#x9884;&#x7814; Python &#x811A;&#x672C;&#x89E3;&#x91CA;&#x5F15;&#x64CE;&#x548C;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x4EE3;&#x7406;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x6BB5;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x8BA9;&#x6211;&#x8DC3;&#x5347;&#x5230;&#x5B50;&#x7CFB;&#x7EDF;&#x8FD9;&#x4E2A;&#x7C92;&#x5EA6;&#x3002;&#x6211;&#x9700;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x5728;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5F53;&#x4E2D;&#x9700;&#x8981;&#x627F;&#x62C5;&#x4EC0;&#x4E48;&#x804C;&#x8D23;&#xFF0C;&#x4EE5;&#x53CA;&#x8DDF;&#x5176;&#x4ED6;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x88AB;&#x6D4B;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x673A;&#x5236;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x8981;&#x8D1F;&#x8D23;&#x8FD9;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#xFF0C;&#x786E;&#x5B9A;&#x5B83;&#x7531;&#x54EA;&#x4E9B;&#x6A21;&#x5757;&#x6784;&#x6210;&#x3001;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x5185;&#x90E8;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x7C7B;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x8BA9;&#x6211;&#x5177;&#x5907;&#x4E86;&#x6784;&#x5EFA;&#x5355;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4FE1;&#x5FC3;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x6211;&#x8FD8;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6784;&#x5EFA;&#x8FC7;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x5728;&#x5F3A;&#x5316;&#x6784;&#x5EFA;&#x5355;&#x4E2A;&#x70B9;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5173;&#x8054;&#x6280;&#x80FD;&#x6811;&#x5305;&#x62EC;&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#x3001;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x7B49;&#x3002;</p>
<h3 id="1-2-&#x7EBF;"><a href="#1-2-&#x7EBF;" class="headerlink" title="1.2 &#x7EBF;"></a>1.2 &#x7EBF;</h3><p>&#x5BF9;&#x4E8E;&#x7A0D;&#x5177;&#x89C4;&#x6A21;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x90FD;&#x514D;&#x4E0D;&#x4E86;&#x8981;&#x5212;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B50;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x6216;&#x8005;&#x4E0E;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x5C31;&#x9700;&#x8981;&#x8FDE;&#x63A5;&#x901A;&#x4FE1;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x628A;&#x4E24;&#x4E2A;&#x5B64;&#x7ACB;&#x7684;&#x70B9;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x5373;&#x8FDE;&#x70B9;&#x6210;&#x7EBF;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x8DDF;&#x5F00;&#x53D1;&#x5355;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x8981;&#x7684;&#x6280;&#x80FD;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x6280;&#x80FD;&#x3002;&#x5728;&#x8001;&#x5175;&#x54E5;&#x6211;&#x521A;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#x7684;&#x90A3;&#x4E9B;&#x5E74;&#xFF0C;Web &#x5E94;&#x7528;&#x8FD8;&#x6CA1;&#x6709;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#x7684;&#x5E94;&#x7528;&#x5F62;&#x6001;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;/&#x670D;&#x52A1;&#x5668;&#xFF08;B/S&#xFF09;&#x67B6;&#x6784;&#x8FD8;&#x6CA1;&#x6709;&#x5174;&#x8D77;&#xFF0C;HTTP &#x534F;&#x8BAE;&#x5C1A;&#x672A;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x5F53;&#x65F6;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5C31;&#x662F;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#xFF08;C/S&#xFF09;&#x67B6;&#x6784;&#xFF0C;IP/TCP &#x624D;&#x662F;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x79EF;&#x7D2F;&#x4E0B;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x6280;&#x80FD;&#x7684;&#x3002;</p>
<p>&#x6700;&#x65E9;&#x6211;&#x4EEC;&#x8981;&#x5F00;&#x53D1;&#x5BA2;&#x6237;&#x7AEF;&#x6216;&#x670D;&#x52A1;&#x5668;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x719F;&#x6089;&#x638C;&#x63E1; Socket &#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#x7ED1;&#x5B9A;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x3001;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3001;&#x5E76;&#x53D1;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7B49;&#xFF0C;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x5168;&#x90E8;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x5BF9;&#x4E8E;&#x6211;&#x540E;&#x6765;&#x7406;&#x89E3;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x6709;&#x975E;&#x5E38;&#x5927;&#x5E2E;&#x52A9;&#x3002;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5B50;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x9700;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x57FA;&#x4E8E; IP/TCP &#x534F;&#x8BAE;&#x6765;&#x5B9A;&#x5236;&#x4E13;&#x95E8;&#x7684;&#x5E94;&#x7528;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x5305;&#x62EC;&#x5236;&#x5B9A;&#x62A5;&#x6587;&#x5934;&#x548C;&#x62A5;&#x6587;&#x4F53;&#x4E24;&#x5C42;&#x7ED3;&#x6784;&#xFF0C;&#x867D;&#x7136;&#x6BD4; HTTP&#x3001;FTP&#x3001;SMTP&#x7B49;&#x534F;&#x8BAE;&#x8981;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x8FD9;&#x6BB5;&#x7ECF;&#x5386;&#x8BA9;&#x6211;&#x5BF9; HTTP &#x8FD9;&#x7C7B;&#x5E94;&#x7528;&#x5C42;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x6709;&#x4E86;&#x6DF1;&#x523B;&#x7684;&#x7406;&#x89E3;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x62A5;&#x6587;&#x5185;&#x5BB9;&#x8FC7;&#x957F;&#x65F6;&#x7684;&#x5206;&#x5305;&#x7EC4;&#x5305;&#x3001;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x65F6;&#x7684;&#x4E22;&#x5305;&#x91CD;&#x53D1;&#xFF0C;&#x4EE5;&#x53CA;&#x62A5;&#x6587;&#x5185;&#x5BB9;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x7B49;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x5FD7;&#x4E8E;&#x5728;&#x6280;&#x672F;&#x7EBF;&#x53D1;&#x5C55;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x6709;&#x5FC5;&#x8981;&#x8865;&#x4E0A;&#x8FD9;&#x5757;&#x6280;&#x80FD;&#x3002;&#x5728;&#x8FD1;&#x5341;&#x4E94;&#x5E74;&#x7684;&#x6280;&#x672F;&#x4ECE;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#xFF0C;&#x8001;&#x5175;&#x54E5;&#x6211;&#x524D;&#x524D;&#x540E;&#x540E;&#x89E3;&#x51B3;&#x8FC7;&#x65E0;&#x6570;&#x73B0;&#x7F51;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x8DDF;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x901A;&#x4FE1;&#x6709;&#x5173;&#xFF0C;&#x501F;&#x52A9;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x6293;&#x5305;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x62BD;&#x4E1D;&#x5265;&#x8327;&#xFF0C;&#x6700;&#x540E;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x7684;&#x6839;&#x6E90;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5F88;&#x5E86;&#x5E78;&#x81EA;&#x5DF1;&#x5728;&#x8FC7;&#x5F80;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x6709;&#x8FD9;&#x6BB5;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#xFF0C;Web &#x5E94;&#x7528;&#x6210;&#x4E86;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x5E94;&#x7528;&#x5F62;&#x6001;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6; HTTP &#x8FD9;&#x79CD;&#x66F4;&#x4EBA;&#x6027;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x6210;&#x4E86;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4EA4;&#x4E92;&#x534F;&#x8BAE;&#x3002;&#x4ECE;&#x5F00;&#x53D1;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#xFF08;C/S&#xFF09;&#x5E94;&#x7528;&#x8F6C;&#x5230;&#x5F00;&#x53D1;&#x6D4F;&#x89C8;&#x5668;/&#x670D;&#x52A1;&#x5668;&#xFF08;B/S&#xFF09;&#x5E94;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8001;&#x5175;&#x54E5;&#x6211;&#x4E13;&#x95E8;&#x82B1;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x4E86; HTTP &#x534F;&#x8BAE;&#xFF0C;&#x4E86;&#x89E3;&#x5176;&#x8FD0;&#x884C;&#x539F;&#x7406;&#x548C;&#x63A7;&#x5236;&#x673A;&#x5236;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x534F;&#x8BAE;&#x5934;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x4F5C;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x3001;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3001;&#x8D85;&#x65F6;&#x673A;&#x5236;&#x3001;&#x7F13;&#x5B58;&#x673A;&#x5236;&#x7B49;&#x3002;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x523B;&#x7684;&#x5C31;&#x662F; Roy Thomas Fielding &#x535A;&#x58EB;&#x53D1;&#x8868;&#x4E86; REST &#x7684;&#x8BBA;&#x6587;&#x300A;Architectural Styles and the Design of Network-based Software Architectures&#x300B;&#xFF0C;&#x5373;&#x300A;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x4E0E;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x300B;&#xFF0C;&#x8BA9;&#x6211;&#x5BF9; HTTP &#x6709;&#x4E86;&#x5168;&#x65B0;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x6280;&#x80FD;&#x5BF9;&#x4E8E;&#x7406;&#x89E3;&#x638C;&#x63E1;&#x4E91;&#x8BA1;&#x7B97;&#x65F6;&#x4EE3;&#x7684;&#x670D;&#x52A1;&#x5316;&#x67B6;&#x6784;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x9664;&#x4E86; IP/TCP&#x3001;HTTP &#x8FD9;&#x4E24;&#x7C7B;&#x534F;&#x8BAE;&#x4E4B;&#x5916;&#xFF0C;&#x8001;&#x5175;&#x54E5;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF08;Message Queue&#xFF09;&#x76F8;&#x5173;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x8FD9;&#x7C7B;&#x578B;&#x534F;&#x8BAE;&#x66F4;&#x9002;&#x5408;&#x6784;&#x5EFA;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x652F;&#x6301;&#x540C;&#x6B65;&#x8FD8;&#x652F;&#x6301;&#x5F02;&#x6B65;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x5404;&#x79CD;&#x624B;&#x673A;&#x7EC8;&#x7AEF;&#x578B;&#x53F7;&#x548C;&#x8BBE;&#x5907;&#x4FE1;&#x606F;&#xFF0C;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x9700;&#x8981;&#x4ECE;&#x8FD9;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x53CA;&#x65F6;&#x5730;&#x83B7;&#x53D6;&#x6700;&#x65B0;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x521D;&#x6211;&#x4EEC;&#x7528; HTTP &#x534F;&#x8BAE;&#x8F6E;&#x8BE2;&#x62C9;&#x53D6;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x6570;&#x91CF;&#x548C;&#x4FE1;&#x606F;&#x66F4;&#x65B0;&#x9891;&#x6B21;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x540C;&#x6B65;&#x673A;&#x5236;&#x5C31;&#x906D;&#x9047;&#x74F6;&#x9888;&#x4E86;&#xFF0C;&#x540E;&#x6765;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4E2D;&#x95F4;&#x4EF6;&#x4F18;&#x96C5;&#x5730;&#x5316;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="1-3-&#x9762;"><a href="#1-3-&#x9762;" class="headerlink" title="1.3 &#x9762;"></a>1.3 &#x9762;</h3><p>&#x4ECE;&#x70B9;&#x3001;&#x7EBF;&#x5F00;&#x59CB;&#x4FEE;&#x70BC;&#xFF0C;&#x968F;&#x7740;&#x8FDE;&#x7EBF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x6700;&#x7EC8;&#x5C06;&#x4F1A;&#x5F62;&#x6210;&#x5E73;&#x9762;&#xFF0C;&#x5373;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x5458;&#x901A;&#x5F80;&#x67B6;&#x6784;&#x5E08;&#x8DEF;&#x4E0A;&#x5FC5;&#x7136;&#x7ECF;&#x8FC7;&#x7684;&#x7AD9;&#x70B9;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x6765;&#x53D1;&#x5E03;&#x641C;&#x7D22;&#x4FE1;&#x606F;&#xFF0C;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x5373;&#x65F6;&#x901A;&#x4FE1;&#x548C;&#x793E;&#x4EA4;&#x4E5F;&#x642C;&#x5230;&#x4E86;&#x7F51;&#x4E0A;&#xFF0C;&#x518D;&#x540E;&#x6765;&#x8D2D;&#x7269;&#x5DEE;&#x65C5;&#x7B49;&#x4E8B;&#x60C5;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x6765;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x8DDF;&#x6211;&#x4EEC;&#x8863;&#x98DF;&#x4F4F;&#x884C;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x7269;&#x90FD;&#x5F00;&#x59CB;&#x88AB;&#x4E92;&#x8054;&#x7F51;&#x5316;&#x4E86;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x865A;&#x62DF;&#x4E16;&#x754C;&#x88AB;&#x6784;&#x5EFA;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x5E9E;&#x5927;&#x8D8A;&#x590D;&#x6742;&#x3002;&#x539F;&#x5148;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x5EA6;&#x8FD8;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x9876;&#x591A;&#x88AB;&#x5212;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x9700;&#x8981;&#x5173;&#x8054;&#x4EA4;&#x4E92;&#x7684;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x6570;&#x91CF;&#x4E5F;&#x975E;&#x5E38;&#x6709;&#x9650;&#x3002;&#x4F46;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x8D8A;&#x6765;&#x8D8A;&#x4E30;&#x5BCC;&#xFF0C;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x6025;&#x5267;&#x589E;&#x957F;&#xFF0C;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x4E5F;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x9010;&#x6E10;&#x6F14;&#x53D8;&#x6210;&#x4E00;&#x5F20;&#x7EB5;&#x6A2A;&#x4EA4;&#x9519;&#x7684;&#x7F51;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x9762;&#x201D;&#x3002;&#x5982;&#x4F55;&#x5728;&#x8FD9;&#x6837;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7EDC;&#x5F53;&#x4E2D;&#x7EF4;&#x62A4;&#x597D;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4EE5;&#x53CA;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x4F9D;&#x65E7;&#x6EE1;&#x8DB3;&#x6613;&#x7528;&#x6027;&#x3001;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x9760;&#x6027;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#x7B49;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x8001;&#x5175;&#x54E5;&#x6211;&#x5728;&#x4ECE;&#x4E8B;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x76F8;&#x5173;&#x7CFB;&#x7EDF;&#x7814;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x66F4;&#x9AD8;&#x590D;&#x6742;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x82F9;&#x679C;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x7C7B;&#x4F3C;&#x7684;&#x751F;&#x6001;&#x4F53;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x8D1F;&#x8D23;&#x7684;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x7531;&#x516D;&#x4E03;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7EC4;&#x6210;&#xFF0C;&#x5B83;&#x8FD8;&#x9700;&#x8981;&#x8DDF;&#x8BB8;&#x591A;&#x4E0A;&#x4E0B;&#x6E38;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x7684;&#x7CFB;&#x7EDF;&#x5BF9;&#x63A5;&#x4EA4;&#x4E92;&#x3002;&#x5982;&#x679C;&#x8DDF;&#x6BCF;&#x4E2A;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x7684;&#x5BF9;&#x63A5;&#x90FD;&#x91C7;&#x7528;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x968F;&#x7740;&#x63A5;&#x5165;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x90A3;&#x5BF9;&#x63A5;&#x76F8;&#x5173;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x6700;&#x7EC8;&#x8D70;&#x5411;&#x5931;&#x63A7;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x50CF;&#x5E94;&#x7528;&#x8BA2;&#x9605;&#x8D2D;&#x4E70;&#x7B49;&#x5178;&#x578B;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x90FD;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#xFF0C;&#x5176;&#x4E2D;&#x6D89;&#x53CA;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x600E;&#x6837;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x5C31;&#x662F;&#x5F88;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002;&#x6309;&#x7167;&#x5E38;&#x89C4;&#x903B;&#x8F91;&#xFF0C;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x5B95;&#x673A;&#x7684;&#x6982;&#x7387;&#x5C31;&#x4F1A;&#x63D0;&#x5347;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F9D;&#x65E7;&#x5E0C;&#x671B;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B; 7*24 &#x5C0F;&#x65F6;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x4E0D;&#x8981;&#x51FA;&#x73B0;&#x670D;&#x52A1;&#x8D85;&#x65F6;&#x6216;&#x5931;&#x6548;&#x7B49;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;&#x9762;&#x201D;&#x5E26;&#x6765;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>&#x4ECE;&#x90A3;&#x4E2A;&#x9636;&#x6BB5;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x6709;&#x4E86;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x6700;&#x65E9;&#x5C31;&#x662F;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784; SOA&#xFF0C;&#x5373; Web Service&#x3001;SOAP &#x7B49;&#x6280;&#x672F;&#x6807;&#x51C6;&#xFF0C;&#x7AD9;&#x5728;&#x73B0;&#x5728;&#x56DE;&#x770B;&#x90A3;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x5957;&#x6280;&#x672F;&#x6808;&#x662F;&#x504F;&#x91CD;&#x504F;&#x7E41;&#x7410;&#x7684;&#xFF0C;&#x4F46;&#x5F53;&#x65F6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x4E1A;&#x754C;&#x90FD;&#x662F;&#x5168;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x8FD9;&#x5957;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7531; Compaq&#x3001;HP&#x3001;IBM&#x3001;Lotus&#x3001;Microsoft&#x3001;SAP &#x8FD9;&#x4E9B;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x5DE8;&#x5934;&#x4EEC;&#x63D0;&#x51FA;&#x7684;&#x3002;&#x5B83;&#x901A;&#x8FC7; Web &#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x8BED;&#x8A00; WSDL &#x6765;&#x6807;&#x51C6;&#x5316;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x534F;&#x8BAE; SOAP &#x6765;&#x89C4;&#x8303;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x4ECE;&#x67D0;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8D8A;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x534F;&#x4F5C;&#x5FC5;&#x987B;&#x4F9D;&#x8D56;&#x7EDF;&#x4E00;&#x7684;&#x6807;&#x51C6;&#x548C;&#x89C4;&#x8303;&#x3002;</p>
<p>&#x4F46;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x5DE8;&#x5934;&#x5F88;&#x5C11;&#x6709;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7B2C;&#x4E00;&#x7EBF;&#x5B9E;&#x8DF5;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E0D;&#x50CF; BAT &#x4ED6;&#x4EEC;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x6311;&#x6218;&#x6709;&#x90A3;&#x4E48;&#x771F;&#x5207;&#x7684;&#x611F;&#x53D7;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5C31;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x5B75;&#x5316;&#x51FA;&#x4E86;&#x6BD4; Web Service&#x3001;SOAP &#x66F4;&#x52A0;&#x8F7B;&#x91CF;&#x5316;&#x7684; Dubbo&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x4F9D;&#x6258;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784; SOA &#x8FD9;&#x5957;&#x7406;&#x8BBA;&#xFF0C;&#x53EA;&#x662F;&#x662F;&#x7EBF;&#x4E0A;&#x66F4;&#x52A0;&#x63A5;&#x5730;&#x6C14;&#x3002;&#x8FD9;&#x6BB5;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x8BA9;&#x6211;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x6709;&#x4E86;&#x4F53;&#x7CFB;&#x5316;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x867D;&#x7136;&#x8FD1;&#x4E9B;&#x5E74;&#x5206;&#x5E03;&#x5F0F;&#x6280;&#x672F;&#x4ECE;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784; SOA &#x6F14;&#x8FDB;&#x81F3;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784; MicroService&#xFF0C;&#x6280;&#x672F;&#x4E2D;&#x95F4;&#x4EF6;&#x4ECE; Dubbo &#x66F4;&#x66FF;&#x4E3A; Spring Cloud&#xFF0C;&#x4F46;&#x6211;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x5957;&#x7528;&#x8FD9;&#x5957;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x53BB;&#x7406;&#x89E3;&#x65B0;&#x6280;&#x672F;&#x3002;</p>
<ol start="2">
<li>&#x8F6F;&#x6280;&#x80FD;</li>
</ol>
<hr>
<p>&#x8F6F;&#x786C;&#x6280;&#x80FD;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x533A;&#x5206;&#x5462;&#xFF1F;&#x8001;&#x5175;&#x54E5;&#x6211;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x4EBA;&#x9760;&#x54EA;&#x95E8;&#x624B;&#x827A;&#x5403;&#x996D;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x95E8;&#x624B;&#x827A;&#x76F8;&#x5173;&#x7684;&#x6280;&#x80FD;&#x5C31;&#x662F;&#x786C;&#x6280;&#x80FD;&#xFF0C;&#x800C;&#x8F85;&#x52A9;&#x786C;&#x6280;&#x80FD;&#x4EA7;&#x751F;&#x66F4;&#x5927;&#x4EF7;&#x503C;&#x7684;&#x6280;&#x80FD;&#x5C31;&#x662F;&#x8F6F;&#x6280;&#x80FD;&#xFF0C;&#x8FD9;&#x8DDF;&#x201C;T&#x201D;&#x5B57;&#x578B;&#x4EBA;&#x624D;&#x7684;&#x8981;&#x6C42;&#x7C7B;&#x4F3C;&#xFF0C;&#x65E2;&#x8981;&#x6C42;&#x6709;&#x8DB3;&#x591F;&#x7CBE;&#x6E5B;&#x62D4;&#x5C16;&#x7684;&#x4E3B;&#x653B;&#x6280;&#x827A;&#xFF0C;&#x4E5F;&#x8981;&#x6709;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x7EFC;&#x5408;&#x6280;&#x80FD;&#x3002;&#x786C;&#x6280;&#x80FD;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x76F8;&#x4FE1;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x53CD;&#x5BF9;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x8F6F;&#x6280;&#x80FD;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x5BF9;&#x6280;&#x672F;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4ECE;&#x5F00;&#x53D1;&#x5230;&#x67B6;&#x6784;&#xFF0C;&#x4ECE;&#x67B6;&#x6784;&#x5230; CTO&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x5F00;&#x53D1;&#x8F6C;&#x4EA7;&#x54C1;&#x6216;&#x7BA1;&#x7406;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x664B;&#x5347;&#x8FD8;&#x662F;&#x8F6C;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x5728;&#x52A0;&#x5F3A;&#x786C;&#x6280;&#x80FD;&#x7684;&#x540C;&#x65F6;&#x63D0;&#x5347;&#x8F6F;&#x6280;&#x80FD;&#x7684;&#x6BD4;&#x91CD;&#xFF0C;&#x751A;&#x81F3;&#x539F;&#x5148;&#x7684;&#x786C;&#x6280;&#x80FD;&#x53D8;&#x6210;&#x4E86;&#x8F6F;&#x6280;&#x80FD;&#xFF0C;&#x800C;&#x539F;&#x5148;&#x8F85;&#x52A9;&#x4F5C;&#x7528;&#x7684;&#x8F6F;&#x6280;&#x80FD;&#x5374;&#x6210;&#x4E86;&#x786C;&#x6280;&#x80FD;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x5C06;&#x7ED3;&#x5408;&#x4E2A;&#x4EBA;&#x4ECE;&#x5F00;&#x53D1;&#x8F6C;&#x578B;&#x67B6;&#x6784;&#x7684;&#x7ECF;&#x5386;&#x6765;&#x8C08;&#x4E00;&#x8C08;&#x54EA;&#x4E9B;&#x8F6F;&#x6280;&#x80FD;&#x5F88;&#x91CD;&#x8981;&#xFF1A;</p>
<ul>
<li><strong>&#x6C9F;&#x901A;&#xFF1A;</strong>&#x76F8;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x804C;&#x8D23;&#x51B3;&#x5B9A;&#x4E86;&#x4ED6;&#x9700;&#x8981;&#x5BF9;&#x63A5;&#x66F4;&#x591A;&#x4E0A;&#x4E0B;&#x6E38;&#x5BA2;&#x6237;&#xFF0C;&#x5BF9;&#x6C9F;&#x901A;&#x6280;&#x80FD;&#x7684;&#x8981;&#x6C42;&#x5C31;&#x8981;&#x9AD8;&#x5F88;&#x591A;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x548C;&#x7ACB;&#x573A;&#x89D2;&#x5EA6;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x61C2;&#x5F97;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x8DDF;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x6C9F;&#x901A;&#x4E92;&#x52A8;&#xFF0C;&#x6362;&#x4F4D;&#x601D;&#x8003;&#xFF0C;&#x4ECE;&#x800C;&#x6316;&#x6398;&#x5230;&#x771F;&#x5B9E;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#x5E73;&#x8861;&#x597D;&#x5404;&#x65B9;&#x9700;&#x6C42;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x5404;&#x65B9;&#x90FD;&#x6EE1;&#x610F;&#x7684;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x3002;</li>
<li><strong>&#x5199;&#x4F5C;&#xFF1A;</strong>&#x505A;&#x5F00;&#x53D1;&#x5C97;&#x65F6;&#xFF0C;&#x6211;&#x7684;&#x4E3B;&#x8981;&#x8F93;&#x51FA;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x3002;&#x867D;&#x7136;&#x5076;&#x5C14;&#x4E5F;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x6587;&#x6863;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x662F;&#x4F9B;&#x81EA;&#x5DF1;&#x770B;&#x7684;&#x6280;&#x672F;&#x6587;&#x6863;&#x6216;&#x8005;&#x51D1;&#x6570;&#x7528;&#x7684;&#x4EA7;&#x54C1;&#x64CD;&#x4F5C;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x3002;&#x5728;&#x8F6C;&#x578B;&#x505A;&#x67B6;&#x6784;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x6BD4;&#x91CD;&#x964D;&#x4F4E;&#x4E86;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5404;&#x4E2A;&#x5E72;&#x7CFB;&#x4EBA;&#x7406;&#x89E3;&#x8BA4;&#x53EF;&#x6211;&#x7684;&#x67B6;&#x6784;&#x65B9;&#x6848;&#xFF0C;&#x9664;&#x4E86;&#x53E3;&#x5934;&#x8BF4;&#x660E;&#x4E4B;&#x5916;&#xFF0C;&#x6700;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x9760;&#x6280;&#x672F;&#x5199;&#x4F5C;&#xFF0C;&#x5199;&#x7ED9;&#x4ED6;&#x4EBA;&#x770B;&#x7684;&#x6587;&#x6863;&#x8DDF;&#x7EAF;&#x7CB9;&#x8BB0;&#x5F55;&#x7684;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;</li>
<li><strong>&#x8BBE;&#x8BA1;&#xFF1A;</strong>&#x4E0D;&#x7BA1;&#x662F;&#x53E3;&#x5934;&#x6C9F;&#x901A;&#x8FD8;&#x662F;&#x6587;&#x6863;&#x4F20;&#x64AD;&#xFF0C;&#x8BED;&#x6587;&#x6216;&#x6587;&#x5B57;&#x529F;&#x5E95;&#x518D;&#x597D;&#xFF0C;&#x4E5F;&#x62B5;&#x4E0D;&#x8FC7;&#x642D;&#x914D;&#x4E0A;&#x8BBE;&#x8BA1;&#x56FE;&#x4F8B;&#xFF0C;&#x56FE;&#x4F8B;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#xFF0C;&#x4E5F;&#x66F4;&#x52A0;&#x76F4;&#x89C2;&#x6613;&#x61C2;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6211;&#x4E60;&#x60EF;&#x5728;&#x5199;&#x6280;&#x672F;&#x6587;&#x6863;&#x4E4B;&#x524D;&#x5148;&#x628A;&#x8BBE;&#x8BA1;&#x56FE;&#x753B;&#x51FA;&#x6765;&#xFF0C;&#x753B;&#x8BBE;&#x8BA1;&#x56FE;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x7406;&#x987A;&#x601D;&#x8DEF;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x518D;&#x6765;&#x7EC4;&#x7EC7;&#x6587;&#x5B57;&#x6216;&#x8BED;&#x8A00;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x5BB9;&#x6613;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x770B;&#x56FE;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;</li>
<li><strong>&#x6F14;&#x8BB2;&#xFF1A;</strong>&#x6743;&#x529B;&#x548C;&#x975E;&#x804C;&#x6743;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5F00;&#x5C55;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x975E;&#x804C;&#x6743;&#x5F71;&#x54CD;&#x529B;&#x3002;&#x67B6;&#x6784;&#x5E08;&#x8DDF;&#x5404;&#x4E2A;&#x5E72;&#x7CFB;&#x4EBA;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x4E0A;&#x4E0B;&#x7EA7;&#x5173;&#x7CFB;&#xFF0C;&#x8981;&#x8BA9;&#x56E2;&#x961F;&#x53CA;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x8BA4;&#x53EF;&#x5E76;&#x6267;&#x884C;&#x4F60;&#x7684;&#x67B6;&#x6784;&#x65B9;&#x6848;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x4E13;&#x4E1A;&#x80FD;&#x529B;&#x8BA9;&#x5BF9;&#x65B9;&#x4FE1;&#x670D;&#x3002;&#x5728;&#x4EE5;&#x5F80;&#x5B66;&#x6821;&#x6559;&#x80B2;&#x6216;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x672C;&#x8EAB;&#x662F;&#x7F3A;&#x4E4F;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x79EF;&#x7D2F;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x6210;&#x529F;&#x8F6C;&#x578B;&#x67B6;&#x6784;&#x5E08;&#x6211;&#x523B;&#x610F;&#x8BAD;&#x7EC3;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#x3002;</li>
</ul>
<p>&#x603B;&#x7ED3;&#x8D77;&#x6765;&#x8BF4;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x67B6;&#x6784;&#x5E08;&#x8FD9;&#x4E2A;&#x65B0;&#x5E73;&#x53F0;&#x4E0A;&#x505A;&#x597D;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x8F93;&#x5165;&#x3001;&#x8BBE;&#x8BA1;&#x548C;&#x8F93;&#x51FA;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4EE5;&#x5F80;&#x6211;&#x4EEC;&#x4ECE;&#x5916;&#x754C;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x4E3B;&#x8981;&#x9760;&#x9605;&#x8BFB;&#x6587;&#x6863;&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x8981;&#x52A0;&#x5F3A;&#x7ACB;&#x4F53;&#x591A;&#x65B9;&#x4F4D;&#x7684;&#x6C9F;&#x901A;&#x3002;&#x5728;&#x8F93;&#x51FA;&#x65B9;&#x9762;&#xFF0C;&#x4EE5;&#x5F80;&#x6211;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x5F62;&#x5F0F;&#x592A;&#x8FC7;&#x5355;&#x4E00;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x638C;&#x63E1;&#x6587;&#x5B57;&#x3001;&#x6F14;&#x8BB2;&#x7B49;&#x591A;&#x5A92;&#x4F53;&#x65B9;&#x5F0F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x8FD8;&#x662F;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7684;&#x4E2D;&#x5FC3;&#x3002;</p>
<ol start="3">
<li>&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;</li>
</ol>
<hr>
<p>&#x4ECA;&#x5929;&#x5148;&#x5206;&#x4EAB;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x8001;&#x5175;&#x54E5;&#x540E;&#x7EED;&#x8FD8;&#x4F1A;&#x5206;&#x4EAB;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x5230;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x8FDB;&#x9636;&#x6307;&#x5357;&#xFF0C;&#x5305;&#x62EC;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x8F6F;&#x786C;&#x6280;&#x80FD;&#x56FE;&#x8C31;&#xFF08;&#x5982;&#x9898;&#x56FE;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x6587;&#x5B57;&#x63D0;&#x7EB2;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6587;&#x7AE0;&#xFF1A;<a href="https://dev.newban.cn/6844904022202138632">&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x5230;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x6709;&#x6377;&#x5F84;&#x5417;&#xFF1F;</a>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5343;&#x4E07;&#x8981;&#x8BB0;&#x5F97;&#x5148; <strong>&#x5173;&#x6CE8;</strong>&#x54E6;&#xFF01;</p>
<p>&#x575A;&#x6301;&#x539F;&#x521B;&#x4E0D;&#x6613;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x9EBB;&#x70E6;&#x52A8;&#x52A8;&#x624B;&#x6307;&#x70B9;&#x4E0B;&#x6587; &#x300C; <strong>&#x1F44D;</strong> &#x300D;&#x6309;&#x94AE;&#xFF0C;&#x8BA9;&#x66F4;&#x591A;&#x5C0F;&#x4F19;&#x4F34;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8001;&#x5175;&#x54E5;&#x4F1A;&#x66F4;&#x6709;&#x52A8;&#x529B;&#x575A;&#x6301;&#x5206;&#x4EAB;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x540E;&#x7EED;&#x8FD8;&#x4F1A;&#x5206;&#x4EAB;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x3001;&#x5E94;&#x8058;&#x9762;&#x8BD5;&#x3001;&#x6280;&#x80FD;&#x63D0;&#x5347;&#x3001;&#x5F71;&#x54CD;&#x529B;&#x6253;&#x9020;&#x7B49;&#x7ECF;&#x9A8C;&#xFF0C;&#x6B22;&#x8FCE; <strong>&#x5173;&#x6CE8;</strong> &#x672C;&#x4E13;&#x680F;&#x6216;&#x6B6A;&#x4FE1;&#x516C;&#x4E3B;&#x53F7; &#x300C; <strong>IT&#x8001;&#x5175;&#x54E5; &#x300D;</strong>&#xFF01;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/5a4cfc3952ffc51778d5140463ba0465db91f4093f2b41be99a27039dfd7a60f" alt="&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x300C; IT&#x8001;&#x5175;&#x54E5; &#x300D;" title="&#x5173;&#x6CE8;&#x300C; IT&#x8001;&#x5175;&#x54E5; &#x300D;&#xFF0C;&#x8D4B;&#x80FD;&#x7A0B;&#x5E8F;&#x4EBA;&#x751F;&#xFF01;"></p>
<p><strong>&#x8F6F;&#x6280;&#x80FD;-&#x70ED;&#x95E8;&#x6587;&#x7AE0;&#xFF1A;&#xFF08;&#x9996;&#x53D1;&#x516C;&#x4F17;&#x53F7;&#xFF09;</strong></p>
<ul>
<li>&#x5982;&#x4F55;&#x5728;&#x6253;&#x9020;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x8DEF;&#x4E0A;&#x300C;&#x7801;&#x300D;&#x4E0D;&#x505C;&#xFF1F;&#xFF08;<strong>&#x65B0;</strong>&#xFF09;</li>
<li>2020 &#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x7684; 2019 &#x6652;&#x597D;&#x5C01;&#x5B58;&#x4E86;&#x5417;&#xFF1F;&#xFF08;<strong>&#x65B0;</strong>&#xFF09;</li>
<li>&#x201C;&#x82B1;&#x5F0F;&#x201D;&#x88C1;&#x5458;&#x5957;&#x8DEF;&#x6DF1;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;</li>
<li>&#x906D;&#x9047;&#x88C1;&#x5458;&#xFF0C;&#x5982;&#x4F55;&#x6E21;&#x8FC7;&#x5FC3;&#x7406;&#x5371;&#x673A;&#xFF1F;</li>
<li>&#x7A0B;&#x5E8F;&#x5458;&#x201C;&#x6C42;&#x5305;&#x517B;&#x201D;&#x653B;&#x7565;&#x63ED;&#x79D8;</li>
</ul>
<p><strong>&#x786C;&#x6280;&#x80FD;-&#x70ED;&#x95E8;&#x6587;&#x7AE0;&#xFF1A;</strong></p>
<ul>
<li><a href="https://dev.newban.cn/6844904029479239693">&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x51FA;&#x4F18;&#x7F8E;&#x7684;Web API&#xFF1F;</a>&#xFF08;<strong>&#x70ED;</strong>&#xFF09;</li>
<li><a href="https://dev.newban.cn/6844904032507543560">&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x7684;&#x6027;&#x80FD;&#x8C03;&#x4F18; X Y Z</a> &#xFF08;<strong>&#x70ED;</strong>&#xFF09;</li>
<li><a href="https://dev.newban.cn/6844904031207292936">&#x5982;&#x4F55;&#x628A;&#x5355;&#x4F53;&#x5F0F;&#x5E94;&#x7528;&#x62C6;&#x89E3;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#xFF1F;&#x3010;&#x4E0A;&#x3011;</a></li>
<li><a href="https://dev.newban.cn/6844904031777718279">&#x5982;&#x4F55;&#x628A;&#x5355;&#x4F53;&#x5F0F;&#x5E94;&#x7528;&#x62C6;&#x89E3;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#xFF1F;&#x3010;&#x4E0B;&#x3011;</a></li>
<li><a href="https://dev.newban.cn/6844904018083315725">&#x56FE;&#x89E3; Spring&#xFF1A;HTTP &#x8BF7;&#x6C42;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x4E0E;&#x673A;&#x5236;&#x3010;1&#x3011;</a></li>
</ul>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/1bdcfc5d83b120decc20b5279cfdd3a9.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/架构/" rel="tag"># 架构</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6844903527865647112.html" rel="next" title="使用Jenkins自动化部署，节省你的时间">
                <i class="fa fa-chevron-left"></i> 使用Jenkins自动化部署，节省你的时间
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6844904037586829320.html" rel="prev" title="最全面的Kotlin协程  Coroutine/Channe">
                最全面的Kotlin协程  Coroutine/Channe <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#1-1-点"><span class="nav-number">1.</span> <span class="nav-text">1.1 点</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-2-线"><span class="nav-number">2.</span> <span class="nav-text">1.2 线</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-3-面"><span class="nav-number">3.</span> <span class="nav-text">1.3 面</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
