<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="算法,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x6587;&amp;#x7AE0;&amp;#x9996;&amp;#x53D1;&amp;#xFF1A;&amp;#x5FAE;&amp;#x4FE1;&amp;#x641C;&amp;#x7D22;&amp;#x300E;&amp;#x4E1A;&amp;#x4F59;&amp;#x7801;&amp;#x519C;&amp;#x300F;  &amp;#x7B97;&amp;#x6CD5;&amp;#x548C;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#x4E00;&amp;#x76F4;&amp;#x4E">
<meta name="keywords" content="算法">
<meta property="og:type" content="article">
<meta property="og:title" content="一文图解弄懂八大常用算法思想！">
<meta property="og:url" content="https://dev.newban.cn/6854573212794093582.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x6587;&amp;#x7AE0;&amp;#x9996;&amp;#x53D1;&amp;#xFF1A;&amp;#x5FAE;&amp;#x4FE1;&amp;#x641C;&amp;#x7D22;&amp;#x300E;&amp;#x4E1A;&amp;#x4F59;&amp;#x7801;&amp;#x519C;&amp;#x300F;  &amp;#x7B97;&amp;#x6CD5;&amp;#x548C;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#x4E00;&amp;#x76F4;&amp;#x4E">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/0617f96dff7978fffbfeaaaaadb10176340c9b494c7ab85e01449dca8c354f03">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/c2112e7224b2953b40d5f1bf5955a52dfa421484298647f3131bb8c4146b35bb">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/e859139fe1f4e51e77f9249103b011fe458704ea714dd5ba6f83155df1179d9c">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/2cb7c81d5fab58623547b6b3ad99cf3c9dc78924d6ed10a60d45fad0569c778f">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/77c623f7d5a6c3e5973ae6dbd8b9ba7fd73b8c8f39e9fa7c39be455dbcce27f9">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/7e3ceab1cbed2e2adb21181a405167206e78b521650e2dacae5c68bda74b4c33">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/b8ea0fb9cda0eee4110fd8af98c9d47cbf7df2dcfde3d6dfc1a255b6a30d98c7">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/d19466d3043c037be65a2d978c1fea7dd172b4e81d49fd9e0e95463d2fa2d22a">
<meta property="og:updated_time" content="2024-04-28T13:38:59.252Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="一文图解弄懂八大常用算法思想！">
<meta name="twitter:description" content="&amp;#x6587;&amp;#x7AE0;&amp;#x9996;&amp;#x53D1;&amp;#xFF1A;&amp;#x5FAE;&amp;#x4FE1;&amp;#x641C;&amp;#x7D22;&amp;#x300E;&amp;#x4E1A;&amp;#x4F59;&amp;#x7801;&amp;#x519C;&amp;#x300F;  &amp;#x7B97;&amp;#x6CD5;&amp;#x548C;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#x4E00;&amp;#x76F4;&amp;#x4E">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/0617f96dff7978fffbfeaaaaadb10176340c9b494c7ab85e01449dca8c354f03">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6854573212794093582.html">





  <title>一文图解弄懂八大常用算法思想！ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">一文图解弄懂八大常用算法思想！</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2020-07-21T00:01:07+08:00">
                2020-07-21
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x6587;&#x7AE0;&#x9996;&#x53D1;&#xFF1A;&#x5FAE;&#x4FE1;&#x641C;&#x7D22;&#x300E;&#x4E1A;&#x4F59;&#x7801;&#x519C;&#x300F;</p>
</blockquote>
<p>&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x57FA;&#x672C;&#x5185;&#x529F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x57FA;&#x7840;&#x5EFA;&#x8BBE;&#x548C;&#x7B97;&#x6CD5;&#x52A0;&#x6301;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x8FD9;&#x5C06;&#x8FD1;&#x516B;&#x5341;&#x5E74;&#x7684;&#x4FE1;&#x606F;&#x9769;&#x547D;&#x65F6;&#x4EE3;&#x3002;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7279;&#x6B8A;&#x7ED3;&#x6784;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5408;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x7B97;&#x6CD5;&#x66F4;&#x4E3A;&#x9AD8;&#x6548;&#x800C;&#x53EF;&#x9760;&#x7684;&#x6267;&#x884C;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x7684;&#x5E94;&#x7528;&#x4E0D;&#x5355;&#x53EA;&#x4F53;&#x73B0;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#x3002;&#x72ED;&#x4E49;&#x7684;&#x6765;&#x8BB2;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x770B;&#x4F5C;&#x662F;&#x6570;&#x636E;&#x4F20;&#x9012;&#x548C;&#x5904;&#x7406;&#x7684;&#x987A;&#x5E8F;&#x3001;&#x65B9;&#x6CD5;&#x548C;&#x7EC4;&#x6210;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x5404;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7B49;&#x3002;&#x800C;&#x5E7F;&#x4E49;&#x7684;&#x6765;&#x8BB2;&#xFF0C;&#x7B97;&#x6CD5;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x4E8B;&#x7269;&#x8FD0;&#x884C;&#x7684;&#x903B;&#x8F91;&#x548C;&#x89C4;&#x5219;&#x3002;&#x592A;&#x9633;&#x4E1C;&#x5347;&#x897F;&#x843D;&#xFF0C;&#x6D77;&#x6C34;&#x6F6E;&#x6C50;&#x6F6E;&#x6D41;&#xFF0C;&#x6708;&#x513F;&#x9634;&#x6674;&#x5706;&#x7F3A;&#xFF0C;&#x8FD9;&#x4E9B;&#x6216;&#x8BB8;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F3C;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6267;&#x884C;&#x8005;&#x4E0D;&#x662F;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x7136;&#x4E07;&#x7269;&#x3002;</p>
<p>&#x804A;&#x8FDC;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x7B97;&#x6CD5;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x9886;&#x609F;&#x5176;&#x601D;&#x60F3;&#xFF0C;&#x611F;&#x53D7;&#x5176;&#x5185;&#x5728;&#x3002;&#x6709;&#x540C;&#x5B66;&#x6216;&#x8BB8;&#x5C31;&#x4F1A;&#x8BF4;&#x4E86;&#xFF0C;&#x300C;&#x7B97;&#x6CD5;&#x4E0D;&#x5C31;&#x662F;Leetcode&#xFF0C;&#x4E0D;&#x5C31;&#x662F;&#x5237;&#x9898;&#x561B; &#x300D;&#x3002;</p>
<p>&#x7247;&#x9762;&#x4E86;&#x554A;&#x3002;&#x9898;&#x603B;&#x662F;&#x5237;&#x4E0D;&#x5B8C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x5C31;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#x3002;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x5237;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x9898;&#x7684;&#x4F60;&#xFF0C;&#x8FD8;&#x4E0D;&#x4E86;&#x89E3;&#x8FD9;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#xFF0C;&#x60F3;&#x5FC5;&#x662F;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x53CD;&#x7701;&#x53CD;&#x7701;&#x4E0B;&#x4E86;&#x3002;</p>
<h2 id="&#x679A;&#x4E3E;"><a href="#&#x679A;&#x4E3E;" class="headerlink" title="&#x679A;&#x4E3E;"></a>&#x679A;&#x4E3E;</h2><p>&#x9996;&#x5148;&#xFF0C;&#x6700;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x679A;&#x4E3E;&#x7B97;&#x6CD5;&#x3002;&#x679A;&#x4E3E;&#x4E5F;&#x53EB;&#x7A77;&#x4E3E;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x7A77;&#x5C3D;&#x5217;&#x4E3E;&#x3002;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5341;&#x5206;&#x5E7F;&#x6CDB;&#xFF0C;&#x4E5F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x679A;&#x4E3E;&#x5C31;&#x662F;&#x5C06;&#x95EE;&#x9898;&#x7684;&#x53EF;&#x80FD;&#x89E3;&#x4F9D;&#x6B21;&#x5217;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x4E00;&#x5E26;&#x5165;&#x95EE;&#x9898;&#x68C0;&#x9A8C;&#xFF0C;&#x4ECE;&#x800C;&#x4ECE;&#x4E00;&#x7CFB;&#x5217;&#x53EF;&#x80FD;&#x89E3;&#x4E2D;&#x83B7;&#x5F97;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x7CBE;&#x786E;&#x89E3;&#x3002;</p>
<p>&#x679A;&#x4E3E;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5BB9;&#x6613;&#x88AB;&#x4EBA;&#x5FFD;&#x89C6;&#x7684;&#x8003;&#x8651;&#x70B9;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#x5F85;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x300C;&#x53EF;&#x80FD;&#x89E3;/&#x5019;&#x9009;&#x89E3;&#x300D;&#x7684;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#xFF0C;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x7A77;&#x4E3E;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x7A77;&#x4E3E;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x5FC5;&#x53BB;&#x8FFD;&#x6C42;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x590D;&#x6742;&#x7B97;&#x6CD5;&#x7ED3;&#x6784;&#xFF0C;&#x53CD;&#x800C;&#x5927;&#x9053;&#x81F3;&#x7B80;&#xFF0C;&#x91C7;&#x7528;&#x679A;&#x4E3E;&#x6CD5;&#x5C31;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x89C4;&#x907F;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x5E26;&#x6765;&#x7684;&#x5197;&#x4F59;&#xFF0C;&#x540C;&#x65F6;&#x6216;&#x8BB8;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8FD8;&#x80FD;&#x591F;&#x5BF9;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x7F29;&#x51CF;&#x3002;</p>
<p>&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x7684;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x56FE;&#x6765;&#x8868;&#x793A;&#x3002;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;&#x4E8B;&#x5148;&#x786E;&#x5B9A;&#x597D;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#xFF0C;&#x7136;&#x540E;&#x9010;&#x4E00;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6839;&#x636E;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#x6765;&#x5BF9;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x548C;&#x8BBA;&#x8BC1;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x660E;&#x663E;&#x7684;&#x7ED3;&#x679C;&#x5BFC;&#x5411;&#x578B;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x5730;&#x8BD5;&#x56FE;&#x4ECE;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x53CD;&#x5411;&#x5206;&#x6790;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/0617f96dff7978fffbfeaaaaadb10176340c9b494c7ab85e01449dca8c354f03" alt></p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x7684;&#x52A3;&#x52BF;&#x5F53;&#x7136;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x679A;&#x4E3E;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6C42;&#x89E3;&#x7684;&#x95EE;&#x9898;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#x3002;&#x800C;&#x5F53;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x5BFC;&#x81F4;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x6570;&#x91CF;&#x548C;&#x8303;&#x56F4;&#x65E0;&#x6CD5;&#x51C6;&#x786E;&#x5224;&#x65AD;&#x65F6;&#xFF0C;&#x679A;&#x4E3E;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5F53;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x89C4;&#x6A21;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;&#x4F9D;&#x6B21;&#x9A8C;&#x8BC1;&#x7684;&#x8FC7;&#x7A0B;&#x5BB9;&#x6613;&#x5B9E;&#x65BD;&#x65F6;&#xFF0C;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x4E0D;&#x5931;&#x4E3A;&#x4E00;&#x79CD;&#x65B9;&#x4FBF;&#x5FEB;&#x6377;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x5728;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5BF9;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x9A8C;&#x8BC1;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x4F18;&#x5316;&#x53EF;&#x4EE5;&#x4ECE;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x5165;&#x624B;&#xFF0C;&#x4E00;&#x662F;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5316;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5BF9;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x6A21;&#x578B;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x7CBE;&#x7B80;&#x3002;&#x8FD9;&#x79CD;&#x7CBE;&#x7B80;&#x5177;&#x4F53;&#x53EF;&#x4F53;&#x73B0;&#x5728;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x6570;&#x76EE;&#xFF0C;&#x51CF;&#x5C11;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x591F;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x964D;&#x4F4E;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x4E8C;&#x662F;&#x5BF9;&#x7B5B;&#x9009;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x8303;&#x56F4;&#x548C;&#x6761;&#x4EF6;&#x8FDB;&#x884C;&#x4E25;&#x683C;&#x5224;&#x65AD;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5254;&#x9664;&#x5927;&#x90E8;&#x5206;&#x65E0;&#x6548;&#x7684;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x3002;</p>
<p>&#x867D;&#x8BF4;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x800C;&#x8A00;&#x5927;&#x90E8;&#x5206;&#x679A;&#x4E3E;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x573A;&#x666F;&#x90FD;&#x662F;&#x7531;&#x4E8E;&#x300C;&#x53EF;&#x80FD;&#x89E3;&#x300D;&#x7684;&#x6570;&#x91CF;&#x8FC7;&#x591A;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x6709;&#x9650;&#x7A7A;&#x95F4;&#x6216;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x9A8C;&#x8BC1;&#x3002;&#x4E0D;&#x8FC7;&#x5B9E;&#x9645;&#x4E0A;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x662F;&#x6700;&#x63A5;&#x8FD1;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x5019;&#x662F;&#x7528;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x53BB;&#x300C;&#x7406;&#x89E3;&#x95EE;&#x9898;&#x300D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x300D;&#x3002;</p>
<h4 id="&#x6848;&#x4F8B;"><a href="#&#x6848;&#x4F8B;" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x767E;&#x94B1;&#x4E70;&#x767E;&#x9E21;&#x95EE;&#x9898;&#x3002;</strong> &#x8BE5;&#x95EE;&#x9898;&#x53D9;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;&#x9E21;&#x7FC1;&#x4E00;&#xFF0C;&#x503C;&#x94B1;&#x4E94;&#xFF1B;&#x9E21;&#x6BCD;&#x4E00;&#xFF0C;&#x503C;&#x94B1;&#x4E09;&#xFF1B;&#x9E21;&#x96CF;&#x4E09;&#xFF0C;&#x503C;&#x94B1;&#x4E00;&#xFF1B;&#x767E;&#x94B1;&#x4E70;&#x767E;&#x9E21;&#xFF0C;&#x5219;&#x7FC1;&#x3001;&#x6BCD;&#x3001;&#x96CF;&#x5404;&#x51E0;&#x4F55;&#xFF1F;</p>
<p>&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x516C;&#x9E21;&#x4E00;&#x4E2A;&#x4E94;&#x5757;&#x94B1;&#xFF0C;&#x6BCD;&#x9E21;&#x4E00;&#x4E2A;&#x4E09;&#x5757;&#x94B1;&#xFF0C;&#x5C0F;&#x9E21;&#x4E09;&#x4E2A;&#x4E00;&#x5757;&#x94B1;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x7528;&#x4E00;&#x767E;&#x5757;&#x94B1;&#x4E70;&#x4E00;&#x767E;&#x53EA;&#x9E21;&#xFF0C;&#x95EE;&#x516C;&#x9E21;&#x3001;&#x6BCD;&#x9E21;&#x3001;&#x5C0F;&#x9E21;&#x5404;&#x591A;&#x5C11;&#x53EA;&#xFF1F;</p>
<h2 id="&#x9012;&#x63A8;"><a href="#&#x9012;&#x63A8;" class="headerlink" title="&#x9012;&#x63A8;"></a>&#x9012;&#x63A8;</h2><p>&#x9012;&#x63A8;&#x601D;&#x60F3;&#x8DDF;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x63A5;&#x8FD1;&#x4EBA;&#x7C7B;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x5B9E;&#x9645;&#x751F;&#x6D3B;&#x5177;&#x6709;&#x6BD4;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;&#x4EBA;&#x8111;&#x5728;&#x9047;&#x5230;&#x672A;&#x77E5;&#x7684;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7B2C;&#x4E00;&#x76F4;&#x89C9;&#x90FD;&#x4F1A;&#x4ECE;&#x79EF;&#x7D2F;&#x7684;&#x300C;&#x5148;&#x9A8C;&#x77E5;&#x8BC6;&#x300D;&#x51FA;&#x53D1;&#xFF0C;&#x8BD5;&#x56FE;&#x4ECE;&#x300C;&#x5DF2;&#x77E5;&#x300D;&#x63A8;&#x5BFC;&#x300C;&#x672A;&#x77E5;&#x300D;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x9012;&#x63A8;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x3002;&#x9012;&#x63A8;&#x601D;&#x60F3;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x4ECE;&#x5DF2;&#x77E5;&#x6761;&#x4EF6;&#x51FA;&#x53D1;&#xFF0C;&#x9010;&#x6B65;&#x63A8;&#x7B97;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x3002;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5F88;&#x50CF;&#x662F;&#x521D;&#x9AD8;&#x4E2D;&#x65F6;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x5B66;&#x8003;&#x5377;&#x4E0A;&#x4E00;&#x8FDE;&#x4E32;&#x7684;&#x300C;&#x56E0;&#x4E3A;&#x300D;&#x300C;&#x6240;&#x4EE5;&#x300D;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x7528;&#x4E09;&#x4E2A;&#x70B9;&#x6765;&#x8868;&#x793A;&#x7684;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x8A00;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x63A8;&#x5BFC;&#x5176;&#x5B9E;&#x5F88;&#x96BE;&#x5B9E;&#x73B0;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x64C5;&#x957F;&#x7684;&#x662F;&#x6267;&#x884C;&#x9AD8;&#x5BC6;&#x5EA6;&#x91CD;&#x590D;&#x6027;&#x9AD8;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5BF9;&#x4E8E;&#x968F;&#x673A;&#x6027;&#x9AD8;&#x53D8;&#x5316;&#x591A;&#x7AEF;&#x7684;&#x95EE;&#x9898;&#x53CD;&#x800C;&#x4E0D;&#x597D;&#x8BA1;&#x7B97;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4EBA;&#x8111;&#x5728;&#x5BF9;&#x4E0D;&#x540C;&#x7EF4;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x63A8;&#x5BFC;&#x65F6;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x3002;</p>
<p>&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x4EBA;&#x8111;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x4ECE;&#x300C;&#x592A;&#x9633;&#x4ECE;&#x4E1C;&#x8FB9;&#x5347;&#x8D77;&#x300D;&#x63A8;&#x51FA;&#x300C;&#x592A;&#x9633;&#x4ECE;&#x897F;&#x8FB9;&#x843D;&#x4E0B;&#x300D;&#xFF0C;&#x7136;&#x540E;&#x5927;&#x81F4;&#x63A8;&#x51FA;&#x300C;&#x73B0;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x300D;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x8A00;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF0C;&#x624D;&#x80FD;&#x907F;&#x514D;&#x8BA1;&#x7B97;&#x673A;&#x63A8;&#x51FA;&#x300C;&#x592A;&#x9633;/&#x6708;&#x4EAE;/&#x661F;&#x661F;&#x300D;&#x4ECE;&#x300C;&#x5357;/&#x5317;/&#x4E1C;&#x8FB9;&#x300D;&#x300C;&#x843D;&#x4E0B;/&#x98DE;&#x8D70;/&#x6389;&#x843D;&#x300D;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x6211;&#x8BF4;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x7528;&#x610F;&#x662F;&#x5728;&#x8BF4;&#x660E;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x8FD0;&#x7528;&#x9012;&#x63A8;&#x601D;&#x60F3;&#x65F6;&#xFF0C;&#x5927;&#x591A;&#x90FD;&#x662F;<strong>&#x91CD;&#x590D;&#x6027;&#x7684;&#x63A8;&#x7406;</strong>&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x4ECE;&#x300C;&#x4ECA;&#x5929;&#x662F;1&#x53F7;&#x300D;&#x63A8;&#x51FA;&#x300C;&#x660E;&#x5929;&#x662F;2&#x53F7;&#x300D;&#x3002;&#x8FD9;&#x79CD;&#x63A8;&#x7406;&#x7684;&#x7ED3;&#x6784;&#x5341;&#x5206;&#x7C7B;&#x4F3C;&#xFF0C;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EE7;&#x800C;&#x5F80;&#x590D;&#x7684;&#x63A8;&#x7406;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x89E3;&#x3002;</p>
<p>&#x9012;&#x63A8;&#x601D;&#x60F3;&#x7528;&#x56FE;&#x89E3;&#x6765;&#x8868;&#x793A;&#x53EF;&#x4EE5;&#x53C2;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x63A8;&#x5BFC;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x6B21;&#x63A8;&#x5BFC;&#x7684;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x8DDF;&#x8FED;&#x4EE3;&#x3001;&#x9012;&#x5F52;&#x7684;&#x601D;&#x60F3;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x8FC7;&#x9012;&#x63A8;&#x7684;&#x8303;&#x7574;&#x8981;&#x66F4;&#x5E7F;&#x4E00;&#x4E9B;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/c2112e7224b2953b40d5f1bf5955a52dfa421484298647f3131bb8c4146b35bb" alt></p>
<h4 id="&#x6848;&#x4F8B;-1"><a href="#&#x6848;&#x4F8B;-1" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x5154;&#x5B50;&#x95EE;&#x9898;&#x3002;</strong> &#x5B9A;&#x4E00;&#x5BF9;&#x5927;&#x5154;&#x5B50;&#x6BCF;&#x6708;&#x80FD;&#x751F;&#x4E00;&#x5BF9;&#x5C0F;&#x5154;&#x5B50;&#xFF0C;&#x4E14;&#x6BCF;&#x5BF9;&#x65B0;&#x751F;&#x7684;&#x5C0F;&#x5154;&#x5B50;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x6708;&#x53EF;&#x4EE5;&#x957F;&#x6210;&#x4E00;&#x5BF9;&#x5927;&#x5154;&#x5B50;,&#x5177;&#x5907;&#x7E41;&#x6B96;&#x80FD;&#x529B;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x53D1;&#x751F;&#x6B7B;&#x4EA1;&#xFF0C;&#x4E14;&#x6BCF;&#x6B21;&#x5747;&#x751F;&#x4E0B;&#x4E00;&#x96CC;&#x4E00;&#x96C4;&#xFF0C;&#x95EE;&#x4E00;&#x5E74;&#x540E;&#x5171;&#x6709;&#x591A;&#x5C11;&#x5BF9;&#x5154;&#x5B50;&#xFF1F;</p>
<h2 id="&#x9012;&#x5F52;"><a href="#&#x9012;&#x5F52;" class="headerlink" title="&#x9012;&#x5F52;"></a>&#x9012;&#x5F52;</h2><p>&#x8BF4;&#x5B8C;&#x9012;&#x63A8;&#xFF0C;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x8BF4;&#x5B83;&#x7684;&#x5144;&#x5F1F;&#x601D;&#x60F3;&#x2014;&#x2014;&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#x3002;&#x4E8C;&#x8005;&#x540C;&#x6837;&#x90FD;&#x5E26;&#x6709;&#x4E00;&#x4E2A;&#x300C;&#x9012;&#x300D;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4E8C;&#x8005;&#x8FD8;&#x662F;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x3002;&#x300C;&#x9012;&#x300D;&#x7684;&#x7406;&#x89E3;&#x53EF;&#x4EE5;&#x662F;&#x9010;&#x6B21;&#x3001;&#x9010;&#x6B65;&#x3002;&#x5728;&#x9012;&#x63A8;&#x4E2D;&#xFF0C;&#x662F;&#x9010;&#x6B21;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x63A8;&#x5BFC;&#x76F4;&#x5230;&#x83B7;&#x5F97;&#x6700;&#x7EC8;&#x89E3;&#x3002;&#x800C;&#x5728;&#x9012;&#x5F52;&#x4E2D;&#xFF0C;&#x5219;&#x662F;&#x9010;&#x6B21;&#x56DE;&#x5F52;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x8DF3;&#x51FA;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x628A;&#x95EE;&#x9898;&#x8F6C;&#x5316;&#x6210;&#x89C4;&#x6A21;&#x66F4;&#x5C0F;&#x7684;&#x540C;&#x7C7B;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x5148;&#x89E3;&#x51B3;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x6C42;&#x89E3;&#x8FC7;&#x7A0B;&#x9010;&#x6B65;&#x89E3;&#x51B3;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x83B7;&#x5F97;&#x6700;&#x7EC8;&#x7684;&#x89E3;&#x3002;&#x6240;&#x4EE5;&#x76F8;&#x8F83;&#x4E8E;&#x9012;&#x63A8;&#x800C;&#x8A00;&#xFF0C;&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#x7684;&#x8303;&#x7574;&#x66F4;&#x5C0F;&#xFF0C;&#x8981;&#x6C42;&#x5B50;&#x95EE;&#x9898;&#x8DDF;&#x7236;&#x95EE;&#x9898;&#x7684;&#x7ED3;&#x6784;&#x76F8;&#x540C;&#x3002;&#x800C;&#x9012;&#x63A8;&#x601D;&#x60F3;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7EA6;&#x675F;&#x3002;</p>
<p>&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x5F62;&#x5BB9;&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x51FD;&#x6570;&#x6216;&#x8005;&#x5B50;&#x8FC7;&#x7A0B;&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x7B97;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x786E;&#x5B9A;&#x9012;&#x5F52;&#x8FC7;&#x7A0B;&#x7EC8;&#x6B62;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x8DF3;&#x51FA;&#x7684;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x5728;&#x81EA;&#x6211;&#x8C03;&#x7528;&#x4E2D;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x800C;&#x5D29;&#x6E83;&#x3002;</p>
<p>&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#x7684;&#x56FE;&#x89E3;&#x53EF;&#x5982;&#x4E0B;&#x56FE;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x9012;&#x5F52;&#x601D;&#x60F3;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5957;&#x5A03;&#x8FC7;&#x7A0B;&#x3002;&#x4E00;&#x822C;&#x5B98;&#x65B9;&#x90FD;&#x662F;&#x4E25;&#x7981;&#x5957;&#x5A03;&#x884C;&#x4E3A;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4F7F;&#x7528;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x660E;&#x786E;&#x300C;&#x5957;&#x5A03;&#x300D;&#x4E3E;&#x52A8;&#x7684;&#x505C;&#x6B62;&#x6761;&#x4EF6;&#xFF0C;&#x53CA;&#x65F6;&#x6B62;&#x635F;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/e859139fe1f4e51e77f9249103b011fe458704ea714dd5ba6f83155df1179d9c" alt></p>
<h4 id="&#x6848;&#x4F8B;-2"><a href="#&#x6848;&#x4F8B;-2" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x6C49;&#x8BFA;&#x5854;&#x95EE;&#x9898;&#x3002;</strong> &#x6E90;&#x4E8E;&#x5370;&#x5EA6;&#x4F20;&#x8BF4;&#x4E2D;&#xFF0C;&#x5927;&#x68B5;&#x5929;&#x521B;&#x9020;&#x4E16;&#x754C;&#x65F6;&#x9020;&#x4E86;&#x4E09;&#x6839;&#x91D1;&#x94A2;&#x77F3;&#x67F1;&#x5B50;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x6839;&#x67F1;&#x5B50;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x53E0;&#x7740;64&#x7247;&#x9EC4;&#x91D1;&#x5706;&#x76D8;&#x3002;&#x5927;&#x68B5;&#x5929;&#x547D;&#x4EE4;&#x5A46;&#x7F57;&#x95E8;&#x628A;&#x5706;&#x76D8;&#x4ECE;&#x4E0B;&#x9762;&#x5F00;&#x59CB;&#x6309;&#x5927;&#x5C0F;&#x987A;&#x5E8F;&#x91CD;&#x65B0;&#x6446;&#x653E;&#x5728;&#x53E6;&#x4E00;&#x6839;&#x67F1;&#x5B50;&#x4E0A;&#x3002;&#x5E76;&#x4E14;&#x89C4;&#x5B9A;&#xFF0C;&#x5728;&#x5C0F;&#x5706;&#x76D8;&#x4E0A;&#x4E0D;&#x80FD;&#x653E;&#x5927;&#x5706;&#x76D8;&#xFF0C;&#x5728;&#x4E09;&#x6839;&#x67F1;&#x5B50;&#x4E4B;&#x95F4;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x5706;&#x76D8;&#x3002;</p>
<h2 id="&#x5206;&#x6CBB;"><a href="#&#x5206;&#x6CBB;" class="headerlink" title="&#x5206;&#x6CBB;"></a>&#x5206;&#x6CBB;</h2><p>&#x5206;&#x6CBB;&#xFF0C;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x3002;</p>
<p>&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x6B65;&#x9AA4;&#x5C31;&#x662F;&#x4E24;&#x6B65;&#xFF0C;&#x4E00;&#x662F;&#x5206;&#xFF0C;&#x4E8C;&#x662F;&#x6CBB;&#x3002;&#x4F46;&#x8FD9;&#x8FD8;&#x5F15;&#x7533;&#x51FA;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5206;&#xFF0C;&#x600E;&#x4E48;&#x5206;&#xFF0C;&#x600E;&#x4E48;&#x6CBB;&#xFF0C;&#x6CBB;&#x540E;&#x5982;&#x4F55;&#x3002;</p>
<p>&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x5F88;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x5411;&#x4E0B;&#x7BA1;&#x7406;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x4ECE;&#x6700;&#x9AD8;&#x7EA7;&#x5C42;&#x5C42;&#x5212;&#x5206;&#xFF0C;&#x5C06;&#x5B50;&#x4EFB;&#x52A1;&#x5212;&#x5206;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x6A21;&#x5757;&#xFF0C;&#x8FDB;&#x800C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5927;&#x95EE;&#x9898;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x5BF9;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#x7684;&#x7C92;&#x5EA6;&#x8FDB;&#x884C;&#x7EC6;&#x5316;&#xFF0C;&#x5BFB;&#x6C42;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x6700;&#x57FA;&#x672C;&#x7684;&#x89E3;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x601D;&#x8DEF;&#x5728;&#x5F88;&#x591A;&#x9886;&#x57DF;&#x90FD;&#x6709;&#x8FD0;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x51E0;&#x4F55;&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x6B63;&#x4EA4;&#x5750;&#x6807;&#x3001;&#x5355;&#x4F4D;&#x5750;&#x6807;&#x3001;&#x57FA;&#x7684;&#x6982;&#x5FF5;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7B80;&#x5316;&#x4E3A;&#x57FA;&#x672C;&#x7684;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5148;&#x89E3;&#x51B3;&#x5B50;&#x6A21;&#x5757;&#x518D;&#x9010;&#x6B65;&#x89E3;&#x51B3;&#x4E3B;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8FD0;&#x7528;&#x4E2D;&#xFF0C;&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x662F;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#xFF0C;&#x5C06;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x5212;&#x5206;&#x9010;&#x5C42;&#x7EA7;&#x5212;&#x5206;&#x4E3A;&#x5B50;&#x95EE;&#x9898;&#xFF1B;&#x4E8C;&#x662F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#xFF0C;&#x5C06;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x9010;&#x5C42;&#x9012;&#x589E;&#x878D;&#x5165;&#x4E3B;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x4E2D;&#x3002;</p>
<p>&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#xFF1F;&#x8FD9;&#x4E2A;&#x5F88;&#x597D;&#x89E3;&#x91CA;&#xFF0C;&#x7531;&#x4E8E;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x7684;&#x89C4;&#x6A21;&#x8FC7;&#x5927;&#xFF0C;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x6C42;&#x89E3;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5BF9;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x7C92;&#x5EA6;&#x5212;&#x5206;&#x3002;</p>
<p>&#x90A3;&#x600E;&#x4E48;&#x5206;&#xFF1F;&#x9075;&#x5FAA;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6700;&#x64C5;&#x957F;&#x7684;&#x91CD;&#x590D;&#x8FD0;&#x7B97;&#xFF0C;&#x5212;&#x5206;&#x51FA;&#x6765;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x9700;&#x8981;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x5E76;&#x4E14;&#x4E0E;&#x539F;&#x95EE;&#x9898;&#x7ED3;&#x6784;&#x7279;&#x5F81;&#x76F8;&#x540C;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x89E3;&#x51B3;&#x5B50;&#x95EE;&#x9898;&#x540E;&#xFF0C;&#x4E3B;&#x95EE;&#x9898;&#x4E5F;&#x5C31;&#x80FD;&#x591F;&#x987A;&#x52BF;&#x800C;&#x89E3;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x6CBB;&#xFF1F;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x6700;&#x57FA;&#x672C;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x7EA6;&#x5B9A;&#x6700;&#x5C0F;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x662F;&#x80FD;&#x591F;&#x8F7B;&#x6613;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x5212;&#x5206;&#x624D;&#x5177;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6CBB;&#x7684;&#x73AF;&#x8282;&#x5C31;&#x662F;&#x9700;&#x8981;&#x5BF9;&#x6700;&#x57FA;&#x672C;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x6613;&#x6C42;&#x89E3;&#x3002;</p>
<p>&#x6CBB;&#x540E;&#x5982;&#x4F55;&#xFF1F;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x662F;&#x4E3A;&#x4E86;&#x4E3B;&#x95EE;&#x9898;&#x800C;&#x670D;&#x52A1;&#x7684;&#x3002;&#x5F53;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x5F97;&#x5230;&#x89E3;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5C42;&#x5C42;&#x5411;&#x4E0A;&#x9012;&#x589E;&#xFF0C;&#x9010;&#x6B65;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x95EE;&#x9898;&#x7684;&#x89E3;&#xFF0C;&#x76F4;&#x5230;&#x83B7;&#x5F97;&#x539F;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7EC8;&#x89E3;&#x3002;</p>
<p>&#x5206;&#x6CBB;&#x601D;&#x60F3;&#x7684;&#x56FE;&#x89E3;&#x53EF;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x901A;&#x8FC7;&#x5C42;&#x5C42;&#x7C92;&#x5EA6;&#x4E0A;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x5C06;&#x539F;&#x95EE;&#x9898;&#x5212;&#x5206;&#x4E3A;&#x6700;&#x5C0F;&#x7684;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5411;&#x4E0A;&#x4F9D;&#x6B21;&#x5F97;&#x5230;&#x66F4;&#x9AD8;&#x7C92;&#x5EA6;&#x7684;&#x89E3;&#x3002;<strong>&#x4ECE;&#x4E0A;&#x800C;&#x4E0B;&#xFF0C;&#x518D;&#x4ECE;&#x4E0B;&#x800C;&#x4E0A;&#x3002;&#x5148;&#x5206;&#x89E3;&#xFF0C;&#x518D;&#x6C42;&#x89E3;&#xFF0C;&#x518D;&#x5408;&#x5E76;&#x3002;</strong></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/2cb7c81d5fab58623547b6b3ad99cf3c9dc78924d6ed10a60d45fad0569c778f" alt></p>
<h4 id="&#x6848;&#x4F8B;-3"><a href="#&#x6848;&#x4F8B;-3" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x3002;</strong></p>
<h2 id="&#x52A8;&#x6001;&#x89C4;&#x5212;"><a href="#&#x52A8;&#x6001;&#x89C4;&#x5212;" class="headerlink" title="&#x52A8;&#x6001;&#x89C4;&#x5212;"></a>&#x52A8;&#x6001;&#x89C4;&#x5212;</h2><p>&#x8BB2;&#x5B8C;&#x5206;&#x6CBB;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5206;&#x6CBB;&#x601D;&#x60F3;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x5206;&#x89E3;&#x51FA;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x4E14;&#x7ED3;&#x6784;&#x7279;&#x5F81;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x6EE1;&#x8DB3;&#xFF0C;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x7684;&#x5212;&#x5206;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x76F8;&#x4E92;&#x91CD;&#x53E0;&#x4E14;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5F88;&#x96BE;&#x4F7F;&#x7528;&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x800C;&#x53C8;&#x5E72;&#x51C0;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x5212;&#x5206;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x6765;&#x4E86;&#x3002;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x540C;&#x6837;&#x9700;&#x8981;&#x5C06;&#x95EE;&#x9898;&#x5212;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x5F53;&#x524D;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x53EF;&#x770B;&#x4F5C;&#x662F;&#x524D;&#x591A;&#x4E2A;&#x9636;&#x6BB5;&#x95EE;&#x9898;&#x7684;&#x5B8C;&#x6574;&#x603B;&#x7ED3;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5728;&#x5728;&#x5B50;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x591A;&#x9636;&#x6BB5;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x540C;&#x65F6;&#x5F53;&#x524D;&#x9636;&#x6BB5;&#x4E4B;&#x524D;&#x7684;&#x51B3;&#x7B56;&#x90FD;&#x80FD;&#x591F;&#x6784;&#x6210;&#x4E00;&#x79CD;&#x6700;&#x4F18;&#x7684;&#x5B50;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x6700;&#x4F18;&#x5316;&#x539F;&#x7406;&#x3002;</p>
<p>&#x6700;&#x4F18;&#x5316;&#x539F;&#x7406;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x5177;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x4E0D;&#x8BBA;&#x8FC7;&#x53BB;&#x72B6;&#x6001;&#x548C;&#x51B3;&#x7B56;&#x5982;&#x4F55;&#xFF0C;&#x5BF9;&#x524D;&#x9762;&#x7684;&#x51B3;&#x7B56;&#x6240;&#x5F62;&#x6210;&#x7684;&#x72B6;&#x6001;&#x800C;&#x8A00;&#xFF0C;&#x4F59;&#x4E0B;&#x7684;&#x8BF8;&#x51B3;&#x7B56;&#x5FC5;&#x987B;&#x6784;&#x6210;&#x6700;&#x4F18;&#x7B56;&#x7565;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6700;&#x4F18;&#x7B56;&#x7565;&#x662F;&#x9488;&#x5BF9;&#x6709;&#x5DF2;&#x4F5C;&#x51FA;&#x51B3;&#x7B56;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x5BF9;&#x540E;&#x6765;&#x7684;&#x51B3;&#x7B56;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#xFF0C;&#x53EA;&#x80FD;&#x501F;&#x7528;&#x76EE;&#x524D;&#x6700;&#x4F18;&#x7B56;&#x7565;&#x7684;&#x72B6;&#x6001;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x4E5F;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x65E0;&#x540E;&#x6548;&#x6027;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x89C4;&#x5212;&#x662F;&#x5728;&#x76EE;&#x524D;&#x770B;&#x6765;&#x975E;&#x5E38;&#x4E0D;&#x63A5;&#x8FD1;&#x4EBA;&#x7C7B;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x5728;&#x4E8E;&#x4EBA;&#x8111;&#x5728;&#x6F14;&#x7B97;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x96BE;&#x5BF9;&#x6BCF;&#x4E00;&#x6B21;&#x51B3;&#x7B56;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x8BB0;&#x5FC6;&#x3002;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x5BF9;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E0B;&#x6B21;&#x51B3;&#x7B56;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7684;&#x6C42;&#x89E3;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x56FE;&#x89E3;&#x3002;&#x52A8;&#x5F52;&#x7684;&#x5F00;&#x59CB;&#x9700;&#x8981;&#x5C06;&#x95EE;&#x9898;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x987A;&#x5E8F;&#x5212;&#x5206;&#x4E3A;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x8282;&#x70B9;&#x7684;F0&#x7B49;&#x3002;&#x7136;&#x540E;&#x91CD;&#x70B9;&#x662F;&#x6839;&#x636E;&#x51B3;&#x7B56;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x65B9;&#x7A0B;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x6839;&#x636E;&#x5F53;&#x524D;&#x9636;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#x786E;&#x5B9A;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0B;&#x4E00;&#x72B6;&#x6001;&#x7684;&#x786E;&#x5B9A;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x53C2;&#x8003;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x4E00;&#x6B21;&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#xFF0C;&#x65B9;&#x4FBF;&#x4E4B;&#x540E;&#x7684;&#x67E5;&#x627E;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/77c623f7d5a6c3e5973ae6dbd8b9ba7fd73b8c8f39e9fa7c39be455dbcce27f9" alt></p>
<p>&#x52A8;&#x6001;&#x89C4;&#x5212;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x591A;&#x9636;&#x6BB5;&#x51B3;&#x7B56;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x4E2D;&#x5F80;&#x5F80;&#x5F88;&#x96BE;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x5FC5;&#x987B;&#x7ED3;&#x5408;&#x95EE;&#x9898;&#x7684;&#x7279;&#x70B9;&#x6765;&#x8FDB;&#x884C;&#x7B97;&#x6CD5;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x5F88;&#x96BE;&#x771F;&#x6B63;&#x638C;&#x63E1;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h4 id="&#x6848;&#x4F8B;-4"><a href="#&#x6848;&#x4F8B;-4" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x80CC;&#x5305;&#x95EE;&#x9898;&#x3002;</strong> &#x6709; n &#x4EF6;&#x7269;&#x54C1;&#x548C;&#x5BB9;&#x91CF;&#x4E3A; m &#x7684;&#x80CC;&#x5305;&#xFF0C;&#x7ED9;&#x51FA;&#x7269;&#x54C1;&#x7684;&#x91CD;&#x91CF;&#x4EE5;&#x53CA;&#x4EF7;&#x503C;&#x3002;&#x6C42;&#x89E3;&#x8BA9;&#x88C5;&#x5165;&#x80CC;&#x5305;&#x7684;&#x7269;&#x54C1;&#x91CD;&#x91CF;&#x4E0D;&#x8D85;&#x8FC7;&#x80CC;&#x5305;&#x5BB9;&#x91CF;&#x4E14;&#x4EF7;&#x503C;&#x6700;&#x5927; &#x3002;</p>
<h2 id="&#x8D2A;&#x5FC3;"><a href="#&#x8D2A;&#x5FC3;" class="headerlink" title="&#x8D2A;&#x5FC3;"></a>&#x8D2A;&#x5FC3;</h2><p>&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x613F;&#x79F0;&#x4E4B;&#x4E3A;&#x6700;&#x73B0;&#x5B9E;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x3002;</p>
<p>&#x4EBA;&#x6D3B;&#x5728;&#x4E16;&#x4E0A;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x6BCF;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x90FD;&#x90A3;&#x4E48;&#x6070;&#x5230;&#x597D;&#x5904;&#x3002;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x51C6;&#x786E;&#x89E3;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x65E0;&#x89E3;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x50BB;&#x50BB;&#x7684;&#x53BB;&#x8FFD;&#x6C42;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7CBE;&#x786E;&#x89E3;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x90A3;&#x8FD8;&#x6709;&#x6700;&#x4F18;&#x89E3;&#x5462;&#x3002;&#x96BE;&#x9053;&#x6700;&#x4F18;&#x89E3;&#x90FD;&#x4E0D;&#x8981;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x6CA1;&#x9519;&#xFF0C;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x867D;&#x7136;&#x627E;&#x4E0D;&#x5230;&#x6700;&#x7CBE;&#x786E;&#x7684;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x7684;&#x786E;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x4E00;&#x4E9B;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x8FFD;&#x6C42;&#x8FD9;&#x4E9B;&#x6700;&#x4F18;&#x89E3;&#x5417;&#xFF1F;&#x6211;&#x770B;&#x4E0D;&#x4E00;&#x5B9A;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x7684;&#x5B58;&#x5728;&#x4E0D;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x4E3A;&#x4E86;&#x5BF9;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x300C;&#x7B56;&#x7565;&#x300D;&#x3002;&#x4F55;&#x8C13;&#x300C;&#x7B56;&#x7565;&#x300D;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#xFF0C;&#x4E00;&#x6761;&#x8DEF;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8D2A;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002;</p>
<p>&#x8BF4;&#x56DE;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x3002;&#x4ECE;&#x8D2A;&#x5FC3;&#x4E8C;&#x5B57;&#x5C31;&#x53EF;&#x5F97;&#x77E5;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x300C;&#x8D2A;&#x56FE;&#x66F4;&#x591A;&#x300D;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x8D2A;&#x5FC3;&#x662F;&#x300C;&#x76EE;&#x5149;&#x77ED;&#x6D45;&#x300D;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x65E0;&#x6CD5;&#x4ECE;&#x957F;&#x8FDC;&#x51FA;&#x53D1;&#xFF0C;&#x53EA;&#x770B;&#x91CD;&#x773C;&#x524D;&#x7684;&#x5229;&#x76CA;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x70B9;&#x8BF4;&#xFF0C;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x5728;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x6700;&#x5927;&#x7684;&#x6536;&#x76CA;&#xFF0C;&#x4F46;&#x662F;&#x603B;&#x6536;&#x76CA;&#x5374;&#x4E0D;&#x4E00;&#x5B9A;&#x6700;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x50BB;&#x767D;&#x751C;&#x7684;&#x601D;&#x8DEF;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7EA0;&#x7ED3;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x672A;&#x6765;&#x3002;</p>
<p>&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x4ECE;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x89E3;&#x51FA;&#x53D1;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x4F5C;&#x51FA;&#x300C;&#x5F53;&#x524D;&#x6700;&#x4F18;&#x300D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x76F4;&#x81F3;&#x9047;&#x5230;&#x5C40;&#x90E8;&#x6781;&#x503C;&#x70B9;&#x3002;&#x8D2A;&#x5FC3;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5C40;&#x9650;&#x6027;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5C31;&#x662F;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x6700;&#x540E;&#x7684;&#x89E3;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5B83;&#x6BCF;&#x4E00;&#x6B21;&#x505A;&#x9009;&#x62E9;&#x7684;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x540C;&#x65F6;&#x5224;&#x65AD;&#x6761;&#x4EF6;&#x7B80;&#x5355;&#xFF0C;&#x80FD;&#x591F;&#x6BD4;&#x8F83;&#x5FEB;&#x901F;&#x7684;&#x7ED9;&#x51FA;&#x4E00;&#x79CD;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x56FE;&#x89E3;&#x6211;&#x7528;&#x4E0B;&#x56FE;&#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x56FE;&#x8868;&#x793A;&#x7684;&#x662F;&#x6C42;&#x89E3;&#x5BF9;&#x591A;&#x6761;&#x76F4;&#x7EBF;&#x7684;&#x4EA4;&#x70B9;&#x3002;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x4E0B;&#x56FE;&#x4E2D;&#x7684;&#x76F4;&#x7EBF;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7EDF;&#x4E00;&#x4EA4;&#x70B9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x6C42;&#x5F97;&#x7EDF;&#x4E00;&#x4EA4;&#x70B9;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x82E5;&#x662F;&#x91C7;&#x7528;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x65F6;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x79BB;&#x6B64;&#x65F6;&#x4F4D;&#x7F6E;&#x6700;&#x8FD1;&#x7684;&#x76F4;&#x7EBF;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5728;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x8FED;&#x4EE3;&#x6CBB;&#x540E;&#xFF0C;&#x4EA4;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x4F1A;&#x5728;&#x67D0;&#x4E00;&#x7247;&#x533A;&#x57DF;&#x65E0;&#x9650;&#x8F6E;&#x56DE;&#x8DF3;&#x8F6C;&#x3002;&#x800C;&#x8FD9;&#x7247;&#x533A;&#x57DF;&#x4E5F;&#x5C31;&#x662F;&#x80FD;&#x6C42;&#x5F97;&#x51FA;&#x7684;&#x5927;&#x81F4;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x533A;&#x57DF;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/7e3ceab1cbed2e2adb21181a405167206e78b521650e2dacae5c68bda74b4c33" alt></p>
<h4 id="&#x6848;&#x4F8B;-5"><a href="#&#x6848;&#x4F8B;-5" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x65C5;&#x884C;&#x63A8;&#x9500;&#x5458;&#x95EE;&#x9898;&#x3002;</strong> &#x7ED9;&#x5B9A;&#x4E00;&#x7CFB;&#x5217;&#x57CE;&#x5E02;&#x548C;&#x6BCF;&#x5BF9;&#x57CE;&#x5E02;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x6C42;&#x89E3;&#x8BBF;&#x95EE;&#x6BCF;&#x4E00;&#x5EA7;&#x57CE;&#x5E02;&#x4E00;&#x6B21;&#x5E76;&#x56DE;&#x5230;&#x8D77;&#x59CB;&#x57CE;&#x5E02;&#x7684;&#x6700;&#x77ED;&#x56DE;&#x8DEF;&#x3002;</p>
<h2 id="&#x56DE;&#x6EAF;"><a href="#&#x56DE;&#x6EAF;" class="headerlink" title="&#x56DE;&#x6EAF;"></a>&#x56DE;&#x6EAF;</h2><blockquote>
<p>&#x84B9;&#x846D;&#x82CD;&#x82CD;&#xFF0C;&#x767D;&#x9732;&#x4E3A;&#x971C;&#x3002;&#x6240;&#x8C13;&#x4F0A;&#x4EBA;&#xFF0C;&#x5728;&#x6C34;&#x4E00;&#x65B9;&#x3002;&#x6EAF;&#x6D04;&#x4ECE;&#x4E4B;&#xFF0C;&#x9053;&#x963B;&#x4E14;&#x957F;&#x3002;&#x6EAF;&#x6E38;&#x4ECE;&#x4E4B;&#xFF0C;&#x5B9B;&#x5728;&#x6C34;&#x4E2D;&#x592E;&#x3002;</p>
</blockquote>
<p>&#x6BCF;&#x6BCF;&#x63D0;&#x53CA;&#x56DE;&#x6EAF;&#xFF0C;&#x90FD;&#x4F1A;&#x5FCD;&#x4E0D;&#x4F4F;&#x60F3;&#x5230;&#x300C;&#x84B9;&#x846D;&#x300D;&#x91CC;&#x7684;&#x8FD9;&#x53E5;&#x8BD7;&#x3002;&#x770B;&#x5230;&#x5FC3;&#x4E2D;&#x6240;&#x6000;&#x5FF5;&#x7684;&#x5FC3;&#x4E0A;&#x4EBA;&#x554A;&#xFF0C;&#x5FCD;&#x4E0D;&#x4F4F;&#x9006;&#x6D41;&#x800C;&#x4E0A;&#x53BB;&#x8FFD;&#x5BFB;&#x5979;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FFD;&#x968F;&#x7684;&#x9053;&#x8DEF;&#x9669;&#x963B;&#x53C8;&#x6F2B;&#x957F;&#xFF1B;&#x53C8;&#x987A;&#x6D41;&#x800C;&#x4E0B;&#x7EE7;&#x7EED;&#x5BFB;&#x89C5;&#xFF0C;&#x611F;&#x89C9;&#x5979;&#x4F3C;&#x4E4E;&#x5C31;&#x5728;&#x6CB3;&#x6C34;&#x4E2D;&#x592E;&#x3002;&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x6B63;&#x5982;&#x8FFD;&#x9010;&#x7231;&#x60C5;&#x822C;&#x7684;&#x8270;&#x8F9B;&#x548C;&#x53CD;&#x590D;&#xFF0C;&#x65F6;&#x800C;&#x6EAF;&#x6D04;&#x4ECE;&#x4E4B;&#xFF0C;&#x65F6;&#x800C;&#x6EAF;&#x6E38;&#x4ECE;&#x4E4B;&#x3002;</p>
<p>&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x4E5F;&#x53EF;&#x79F0;&#x4F5C;&#x8BD5;&#x63A2;&#x7B97;&#x6CD5;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x56DE;&#x5FC6;&#x8D77;&#x4E86;&#x5728;&#x5973;&#x795E;&#x9762;&#x524D;&#x7684;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x56DE;&#x6EAF;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5728;&#x505A;&#x51FA;&#x4E0B;&#x4E00;&#x6B65;&#x9009;&#x62E9;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x5BF9;&#x6BCF;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x8FDB;&#x884C;&#x8BD5;&#x63A2;&#xFF1B;&#x53EA;&#x6709;&#x5F53;&#x53EF;&#x80FD;&#x6027;&#x5B58;&#x5728;&#x65F6;&#x624D;&#x4F1A;&#x5411;&#x524D;&#x8FC8;&#x8FDB;&#xFF0C;&#x5018;&#x82E5;&#x6240;&#x6709;&#x9009;&#x62E9;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x5219;&#x5411;&#x540E;&#x9000;&#x56DE;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x91CD;&#x65B0;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#xFF0C;&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x5F88;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x679A;&#x4E3E;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x884C;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x6027;&#x8FDB;&#x884C;&#x679A;&#x4E3E;&#x5E76;&#x5224;&#x65AD;&#x3002;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5C31;&#x5728;&#x5BF9;&#x6811;&#x7ED3;&#x6784;&#x3001;&#x56FE;&#x7ED3;&#x6784;&#x4EE5;&#x53CA;&#x68CB;&#x76D8;&#x843D;&#x5B50;&#x7684;&#x904D;&#x5386;&#x4E0A;&#x3002;</p>
<p>&#x4E3E;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x770B;&#x4E0B;&#x9762;&#x56FE;&#x89E3;&#x3002;&#x5047;&#x8BBE;&#x76EE;&#x7684;&#x662F;&#x4ECE;&#x6700;O0&#x5230;&#x8FBE;O4&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x56DE;&#x6EAF;&#x904D;&#x5386;&#x8DEF;&#x5F84;&#x3002;&#x90A3;&#x4E48;&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x5219;&#x9700;&#x8981;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x8BD5;&#x63A2;&#x3002;</p>
<p>&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;O0&#x8282;&#x70B9;&#x524D;&#x8FDB;&#x7684;&#x8DEF;&#x5F84;&#x6709;&#x4E09;&#x6761;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x4E0A;&#x4E2D;&#x4E0B;&#x6761;&#x7684;O1&#x3002;&#x56DE;&#x6EAF;&#x8FC7;&#x7A0B;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x5148;&#x8D70;&#x4E0A;&#x9762;&#x7684;O1&#xFF0C;&#x7136;&#x540E;&#x80FD;&#x591F;&#x5230;&#x8FBE;&#x4E0A;&#x9762; O2&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x65F6;&#x662F;&#x4E00;&#x6761;&#x6B7B;&#x8DEF;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4ECE;O2&#x9000;&#x56DE;&#x5230;O1&#xFF0C;&#x800C;&#x6B64;&#x65F6;O1&#x7684;&#x552F;&#x4E00;&#x9009;&#x62E9;&#x4E5F;&#x8D70;&#x4E0D;&#x901A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x9700;&#x8981;&#x4ECE;O1&#x9000;&#x56DE;&#x5230;O0&#x3002;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x8BD5;&#x63A2;&#x4E2D;&#x95F4;&#x7684;O1&#x3002;</p>
<p>&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x8BD5;&#x63A2;&#x3001;&#x5224;&#x65AD;&#x3001;&#x9000;&#x56DE;&#x5E76;&#x91CD;&#x65B0;&#x8BD5;&#x63A2;&#xFF0C;&#x76F4;&#x81F3;&#x627E;&#x5230;&#x4E00;&#x6761;&#x5B8C;&#x6574;&#x7684;&#x524D;&#x8FDB;&#x8DEF;&#x5F84;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x300C;&#x526A;&#x679D;&#x300D;&#x7B49;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x964D;&#x4F4E;&#x8BD5;&#x63A2;&#x641C;&#x7D22;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x65E0;&#x6548;&#x7684;&#x8BD5;&#x63A2;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#x4E0A;&#x4E0B;&#x7684;O2&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x7ECF;&#x8FC7;O0-O1-O2&#x7684;&#x8BD5;&#x63A2;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x9A8C;&#x8BC1;&#x4E86;&#x8BE5;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x884C;&#x6027;&#xFF0C;&#x4E0B;&#x6B21;&#x5C31;&#x65E0;&#x987B;&#x4ECE;O1&#x5F00;&#x59CB;&#x91CD;&#x590D;&#x5BF9;O2&#x7684;&#x8BD5;&#x63A2;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/b8ea0fb9cda0eee4110fd8af98c9d47cbf7df2dcfde3d6dfc1a255b6a30d98c7" alt></p>
<p>&#x56DE;&#x6EAF;&#x601D;&#x60F3;&#x5728;&#x8BB8;&#x591A;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x4E0A;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x6709;&#x6548;&#x7684;&#x8FD0;&#x7528;&#x3002;&#x56DE;&#x6EAF;&#x80FD;&#x591F;&#x5C06;&#x590D;&#x6742;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x5206;&#x6B65;&#x8C03;&#x6574;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x8FD0;&#x7528;&#x679A;&#x4E3E;&#x601D;&#x60F3;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x3002;&#x8FD9;&#x6837;&#x5F80;&#x5F80;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x7684;&#x770B;&#x5230;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7EC8;&#x89E3;&#x7ED3;&#x6784;&#x3002;</p>
<h4 id="&#x6848;&#x4F8B;-6"><a href="#&#x6848;&#x4F8B;-6" class="headerlink" title="&#x6848;&#x4F8B;"></a>&#x6848;&#x4F8B;</h4><p><strong>&#x516B;&#x7687;&#x540E;&#x95EE;&#x9898;&#x3002;</strong> &#x5728;8&#xD7;8&#x683C;&#x7684;&#x56FD;&#x9645;&#x8C61;&#x68CB;&#x4E0A;&#x6446;&#x653E;8&#x4E2A;&#x7687;&#x540E;&#xFF0C;&#x4F7F;&#x5176;&#x4E0D;&#x80FD;&#x4E92;&#x76F8;&#x653B;&#x51FB;&#xFF0C;&#x5373;&#x4EFB;&#x610F;&#x4E24;&#x4E2A;&#x7687;&#x540E;&#x90FD;&#x4E0D;&#x80FD;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x884C;&#x3001;&#x540C;&#x4E00;&#x5217;&#x6216;&#x540C;&#x4E00;&#x659C;&#x7EBF;&#x4E0A;&#xFF0C;&#x95EE;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x6446;&#x6CD5;&#x3002;</p>
<h2 id="&#x6A21;&#x62DF;"><a href="#&#x6A21;&#x62DF;" class="headerlink" title="&#x6A21;&#x62DF;"></a>&#x6A21;&#x62DF;</h2><p>&#x6A21;&#x62DF;&#x601D;&#x60F3;&#x7684;&#x7406;&#x89E3;&#x76F8;&#x6BD4;&#x4E0A;&#x8FF0;&#x601D;&#x60F3;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x96BE;&#x4E8B;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x771F;&#x5B9E;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x95EE;&#x9898;&#x89C4;&#x6A21;&#x8FC7;&#x5927;&#xFF0C;&#x53D8;&#x91CF;&#x8FC7;&#x591A;&#x7B49;&#x56E0;&#x7D20;&#xFF0C;&#x5F88;&#x96BE;&#x5C06;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x9488;&#x5BF9;&#x62BD;&#x8C61;&#x95EE;&#x9898;&#x7684;&#x7279;&#x5F81;&#x6765;&#x8FDB;&#x884C;&#x7B97;&#x6CD5;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6A21;&#x62DF;&#x601D;&#x60F3;&#x6216;&#x8BB8;&#x662F;&#x6700;&#x4F73;&#x7684;&#x89E3;&#x9898;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x6A21;&#x62DF;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5BF9;&#x771F;&#x5B9E;&#x573A;&#x666F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x6A21;&#x62DF;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x5F3A;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;&#x8FD9;&#x76F8;&#x8F83;&#x4E8E;&#x4E0A;&#x8FF0;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x4E3A;&#x5B8F;&#x5927;&#x7684;&#x601D;&#x60F3;&#x3002;&#x5728;&#x8FDB;&#x884C;&#x73B0;&#x5B9E;&#x573A;&#x666F;&#x7684;&#x6A21;&#x62DF;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x7CFB;&#x7EDF;&#x90E8;&#x4EF6;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x9700;&#x8981;&#x4E0A;&#x8FF0;&#x51E0;&#x4E2A;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x7684;&#x53C2;&#x4E0E;&#x3002;</p>
<p>&#x6A21;&#x62DF;&#x8BF4;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x7384;&#x5E7B;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x601D;&#x8DEF;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x3002;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x5177;&#x4F53;&#x5206;&#x6790;&#x3002;</p>
<p>&#x90A3;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x6837;&#x6765;&#x56FE;&#x89E3;&#x5462;&#x3002;&#x6211;&#x7684;&#x7406;&#x89E3;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x4EFB;&#x610F;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4E0D;&#x89C4;&#x5219;&#x7684;&#x7CFB;&#x7EDF;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x7406;&#x60F3;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/d19466d3043c037be65a2d978c1fea7dd172b4e81d49fd9e0e95463d2fa2d22a" alt></p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5F88;&#x7384;&#x5E7B;&#x7684;&#x3002;&#x540C;&#x4E00;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8BB8;&#x5728;&#x5B9E;&#x73B0;&#x4E0A;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x60F3;&#x8FDB;&#x884C;&#x3002;&#x8FD9;&#x516B;&#x79CD;&#x601D;&#x60F3;&#x4E5F;&#x4E0D;&#x662F;&#x60F3;&#x8C61;&#x4E2D;&#x90A3;&#x4E48;&#x9AD8;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#xFF0C;&#x5F88;&#x591A;&#x601D;&#x60F3;&#x90FD;&#x662F;&#x6742;&#x7CC5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x89D2;&#x5EA6;&#x548C;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#x3002;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x6848;&#x4F8B;&#x4E5F;&#x4E0D;&#x4EE3;&#x8868;&#x5355;&#x53EA;&#x80FD;&#x7528;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#x6765;&#x89E3;&#x7B54;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x6765;&#x4F53;&#x4F1A;&#x4E00;&#x4E0B;&#x5BF9;&#x5E94;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x5E95;&#x5C42;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x867D;&#x8BF4;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x5929;&#x5237;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x57FA;&#x7840;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x6709;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x5177;&#x4F53;&#x4E8E;&#x67D0;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E8E;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x9700;&#x6C42;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p><strong>&#x5982;&#x72EC;&#x7ACB;&#x4E4B;&#x7CBE;&#x795E;&#xFF0C;&#x81EA;&#x7531;&#x4E4B;&#x601D;&#x60F3;&#x822C;&#x3002;</strong></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/1c9091f6d9936445bc01b0fa092aeeb5.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/算法/" rel="tag"># 算法</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6854573211930066951.html" rel="next" title="Google 推荐在 MVVM 架构中使用 Kotlin F">
                <i class="fa fa-chevron-left"></i> Google 推荐在 MVVM 架构中使用 Kotlin F
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6854573219467411470.html" rel="prev" title="VAVR：颠覆你的 Java 体验">
                VAVR：颠覆你的 Java 体验 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#枚举"><span class="nav-number">1.</span> <span class="nav-text">枚举</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例"><span class="nav-number">1.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li></ol><li class="nav-item nav-level-2"><a class="nav-link" href="#递推"><span class="nav-number">2.</span> <span class="nav-text">递推</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-1"><span class="nav-number">2.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#递归"><span class="nav-number">3.</span> <span class="nav-text">递归</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-2"><span class="nav-number">3.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#分治"><span class="nav-number">4.</span> <span class="nav-text">分治</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-3"><span class="nav-number">4.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#动态规划"><span class="nav-number">5.</span> <span class="nav-text">动态规划</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-4"><span class="nav-number">5.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#贪心"><span class="nav-number">6.</span> <span class="nav-text">贪心</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-5"><span class="nav-number">6.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#回溯"><span class="nav-number">7.</span> <span class="nav-text">回溯</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#案例-6"><span class="nav-number">7.0.1.</span> <span class="nav-text">案例</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#模拟"><span class="nav-number">8.</span> <span class="nav-text">模拟</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总结"><span class="nav-number">9.</span> <span class="nav-text">总结</span></a></li></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
