<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="架构,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4E2D;&amp;#x53F0;&amp;#x7F18;&amp;#x8D77;&amp;#x963F;&amp;#x91CC;&amp;#x8FD1;&amp;#x51E0;&amp;#x5E74;&amp;#xFF0C;&amp;#x201C;&amp;#x4E2D;&amp;#x53F0;&amp;#x201D;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x662F;&amp;#x706B;&amp;#x7684;&amp;#x4E00;&amp;#x584C;&amp;#x7CCA;&amp;#x6D82;&amp;#x3002;">
<meta name="keywords" content="架构">
<meta property="og:type" content="article">
<meta property="og:title" content="“中台”消失了？">
<meta property="og:url" content="https://dev.newban.cn/6983476568211324935.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4E2D;&amp;#x53F0;&amp;#x7F18;&amp;#x8D77;&amp;#x963F;&amp;#x91CC;&amp;#x8FD1;&amp;#x51E0;&amp;#x5E74;&amp;#xFF0C;&amp;#x201C;&amp;#x4E2D;&amp;#x53F0;&amp;#x201D;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x662F;&amp;#x706B;&amp;#x7684;&amp;#x4E00;&amp;#x584C;&amp;#x7CCA;&amp;#x6D82;&amp;#x3002;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/8e883bc63359957615d986e424d8fd4d572deb1838eb182060d244ca32c6baf0">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/085e1b4ef6cccf642b65cdb08a87902f96b39137fb0cc83bf70ff345c440ab38">
<meta property="og:updated_time" content="2024-04-30T03:39:43.360Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="“中台”消失了？">
<meta name="twitter:description" content="&amp;#x4E2D;&amp;#x53F0;&amp;#x7F18;&amp;#x8D77;&amp;#x963F;&amp;#x91CC;&amp;#x8FD1;&amp;#x51E0;&amp;#x5E74;&amp;#xFF0C;&amp;#x201C;&amp;#x4E2D;&amp;#x53F0;&amp;#x201D;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x662F;&amp;#x706B;&amp;#x7684;&amp;#x4E00;&amp;#x584C;&amp;#x7CCA;&amp;#x6D82;&amp;#x3002;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/8e883bc63359957615d986e424d8fd4d572deb1838eb182060d244ca32c6baf0">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/6983476568211324935.html">





  <title>“中台”消失了？ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">“中台”消失了？</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-07-11T09:35:51+08:00">
                2021-07-11
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x4E2D;&#x53F0;&#x7F18;&#x8D77;&#x963F;&#x91CC;"><a href="#&#x4E2D;&#x53F0;&#x7F18;&#x8D77;&#x963F;&#x91CC;" class="headerlink" title="&#x4E2D;&#x53F0;&#x7F18;&#x8D77;&#x963F;&#x91CC;"></a>&#x4E2D;&#x53F0;&#x7F18;&#x8D77;&#x963F;&#x91CC;</h2><pre><code>&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x201C;&#x4E2D;&#x53F0;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x662F;&#x706B;&#x7684;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#x3002;&#x5BFC;&#x81F4;&#x597D;&#x591A;&#x516C;&#x53F8;&#x4E5F;&#x662F;&#x76F2;&#x76EE;&#x8DDF;&#x4ECE;&#xFF0C;&#x5EFA;&#x8BBE;&#x81EA;&#x5DF1;&#x7684;&#x4E2D;&#x53F0;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x53C8;&#x662F;&#x600E;&#x4E48;&#x6765;&#x7684;&#x5462;&#x3002;


&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x8D77;&#x6E90;&#x4E8E;&#x963F;&#x91CC;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x65E9;&#x843D;&#x5B9E;&#x5230;&#x963F;&#x91CC;&#x7684;&#x3002;&#x968F;&#x7740;17&#x5E74;&#x900D;&#x9065;&#x5B50;&#x7684;&#x4E00;&#x58F0;&#x4EE4;&#x4E0B;&#xFF0C;&#x963F;&#x91CC;&#x5F00;&#x59CB;&#x4E86;&#x6280;&#x672F;&#x4E2D;&#x53F0;&#x7684;&#x5EFA;&#x8BBE;&#xFF0C;&#x4E5F;&#x6B63;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x201C;&#x4E2D;&#x53F0;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x4E5F;&#x9010;&#x6E10;&#x8D70;&#x5230;&#x4E86;&#x5927;&#x5BB6;&#x9762;&#x524D;&#x3002;


&#x81F3;&#x4E8E;&#xFF0C;&#x963F;&#x91CC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5EFA;&#x8BBE;&#x4E2D;&#x53F0;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4F17;&#x8BF4;&#x7EB7;&#x4E91;&#x3002;&#x6BD4;&#x8F83;&#x53EF;&#x4FE1;&#x7684;&#x662F;&#xFF0C;Jack Ma&#x5E26;&#x7740;&#x963F;&#x91CC;&#x4E00;&#x4F17;&#x9AD8;&#x7BA1;&#xFF0C;&#x62DC;&#x8BBF;&#x4E86;&#x8377;&#x5170;&#x4E00;&#x5BB6;&#x6E38;&#x620F;&#x516C;&#x53F8;Supercell&#xFF08;&#x53F7;&#x79F0;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x6210;&#x529F;&#x7684;&#x6E38;&#x620F;&#x516C;&#x53F8;&#xFF09;&#x3002;&#x5F53;&#x65F6;&#x4ED6;&#x4EEC;&#x7684;&#x5458;&#x5DE5;&#x53EA;&#x6709;200-300&#x4EBA;&#x5DE6;&#x53F3;&#xFF0C;&#x5374;&#x80FD;&#x5728;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x65AD;&#x53D1;&#x5E03;&#x65B0;&#x54C1;&#x3002;&#x7A76;&#x5176;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x5C06;&#x6E38;&#x620F;&#x4E2D;&#x516C;&#x7528;&#x7684;&#x6A21;&#x5757;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x56E2;&#x961F;&#x6765;&#x7EF4;&#x62A4;&#x3002;&#x800C;&#x5176;&#x4ED6;&#x4EBA;&#x5206;&#x6210;&#x5C0F;&#x56E2;&#x961F;&#xFF08;10&#x4EBA;&#x5DE6;&#x53F3;&#xFF09;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x63A5;&#x5165;&#x516C;&#x7528;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x53BB;&#x5F00;&#x53D1;&#x65B0;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x4ECE;&#x800C;&#x8FC5;&#x901F;&#x7684;&#x63A8;&#x51FA;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x6DF1;&#x6DF1;&#x7684;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x62DC;&#x8BBF;&#x7684;&#x963F;&#x91CC;&#x4E00;&#x4F17;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x56DE;&#x53BB;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x5EFA;&#x8BBE;&#x65B0;&#x7684;&#x67B6;&#x6784;&#x4F53;&#x7CFB;&#x3002;</code></pre><h2 id="&#x6D45;&#x8C08;&#x4E2D;&#x53F0;"><a href="#&#x6D45;&#x8C08;&#x4E2D;&#x53F0;" class="headerlink" title="&#x6D45;&#x8C08;&#x4E2D;&#x53F0;"></a>&#x6D45;&#x8C08;&#x4E2D;&#x53F0;</h2><pre><code>&#x65E2;&#x7136;&#x8981;&#x505A;&#x4E2D;&#x53F0;&#xFF0C;&#x90A3;&#x4E48;&#x4F55;&#x4E3A;&#x4E2D;&#x53F0;&#xFF1F;&#x5982;&#x4F55;&#x53BB;&#x505A;&#x3002;&#x6240;&#x8C13;&#x4E2D;&#x53F0;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x901A;&#x7528;&#x7684;&#x80FD;&#x529B;&#x6C89;&#x6DC0;&#x5230;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x65B9;&#x6216;&#x8005;&#x9700;&#x6C42;&#x65B9;&#x63D0;&#x4F9B;&#x8F93;&#x51FA;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x6027;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x63CF;&#x8FF0;&#x53EF;&#x80FD;&#x8BA9;&#x8BFB;&#x8005;&#x89C9;&#x5F97;&#x6709;&#x70B9;&#x62BD;&#x8C61;&#xFF0C;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;


&#x4E0B;&#x9762;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6765;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#xFF1A;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;APP &#x3010;X&#x3011;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x504F;&#x793E;&#x4EA4;&#x7C7B;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x670B;&#x53CB;&#x5708;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x53D1;&#x5E03;&#x5185;&#x5BB9;&#xFF0C;&#x8BC4;&#x8BBA;&#xFF0C;&#x70B9;&#x8D5E;&#xFF0C;&#x5206;&#x4EAB;&#x7B49;&#x529F;&#x80FD;&#x3002;&#x800C;&#x516C;&#x53F8;&#x6709;&#x597D;&#x51E0;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x90FD;&#x6709;&#x7C7B;&#x4F3C;&#x70B9;&#x8D5E;&#xFF0C;&#x5206;&#x4EAB;&#xFF0C;&#x8BC4;&#x8BBA;&#x7684;&#x529F;&#x80FD;&#x3002;&#x800C;&#x6BCF;&#x4E2A;&#x56E2;&#x961F;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x4E00;&#x5957;&#x76F8;&#x540C;&#x529F;&#x80FD;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5176;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#xFF1A;</code></pre><p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/8e883bc63359957615d986e424d8fd4d572deb1838eb182060d244ca32c6baf0" alt></p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x628A;&#x70B9;&#x8D5E;&#xFF0C;&#x8BC4;&#x8BBA;&#xFF0C;&#x5206;&#x4EAB;&#x7684;&#x670D;&#x52A1;&#x62BD;&#x8C61;&#x51FA;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x4E2D;&#x53F0;&#xFF0C;&#x4EFB;&#x4F55;&#x4E1A;&#x52A1;&#x65B9;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x76F4;&#x63A5;&#x6765;&#x63A5;&#x5165;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x5355;&#x72EC;&#x6765;&#x5F00;&#x53D1;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E2D;&#x53F0;&#x5316;&#xFF0C;&#x4E3A;&#x591A;&#x4E2A;&#x4E1A;&#x52A1;&#x65B9;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x4F18;&#x5316;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/085e1b4ef6cccf642b65cdb08a87902f96b39137fb0cc83bf70ff345c440ab38" alt></p>
<pre><code>&#x8FD9;&#x6837;&#x4EE5;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x5F00;&#x53D1;&#x53EA;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x7684;&#x63A5;&#x5165;&#x8BC4;&#x8BBA;&#x4E2D;&#x53F0;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x6548;&#x7387;&#x4F1A;&#x5927;&#x5927;&#x63D0;&#x5347;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E2D;&#x53F0;&#x4E5F;&#x5206;&#x4E3A;&#x6570;&#x636E;&#x4E2D;&#x53F0;&#xFF0C;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#x7B49;&#x3002;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x79FB;&#x52A8;&#x4E2D;&#x53F0;&#xFF0C;&#x7BA1;&#x7406;&#x4E2D;&#x53F0;&#xFF0C;&#x6280;&#x672F;&#x4E2D;&#x53F0;&#x7B49;&#x7B49;&#x3002;</code></pre><h2 id="&#x4E2D;&#x53F0;&#x73B0;&#x72B6;"><a href="#&#x4E2D;&#x53F0;&#x73B0;&#x72B6;" class="headerlink" title="&#x4E2D;&#x53F0;&#x73B0;&#x72B6;"></a>&#x4E2D;&#x53F0;&#x73B0;&#x72B6;</h2><pre><code>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#xFF0C;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x7684;&#x573A;&#x666F;&#x51FA;&#x73B0;&#x5728;&#x6574;&#x4E2A;&#x516C;&#x53F8;&#x5C42;&#x9762;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#x5B58;&#x5728;&#x5171;&#x7528;&#x67D0;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x7684;&#x8BC9;&#x6C42;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4E2D;&#x5C0F;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x5C31;&#x5C11;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x5982;&#x679C;&#x53BB;&#x5F3A;&#x884C;&#x5EFA;&#x8BBE;&#x4E2D;&#x53F0;&#xFF0C;&#x53CD;&#x5012;&#x662F;&#x4E00;&#x79CD;&#x8D44;&#x6E90;&#x6D6A;&#x8D39;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x516C;&#x53F8;&#x800C;&#x8A00;&#xFF0C;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x5EFA;&#x8BBE;&#x4E2D;&#x53F0;&#x8BC9;&#x6C42;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x963F;&#x91CC;&#xFF0C;&#x817E;&#x8BAF;&#xFF0C;&#x767E;&#x5EA6;&#xFF0C;&#x5B57;&#x8282;&#x7B49;&#x516C;&#x53F8;&#x4F1A;&#x5EFA;&#x8BBE;&#x4E2D;&#x53F0;&#x3002;</code></pre><h2 id="&#x5173;&#x4E8E;&#x4E2D;&#x53F0;&#x7684;&#x672A;&#x6765;"><a href="#&#x5173;&#x4E8E;&#x4E2D;&#x53F0;&#x7684;&#x672A;&#x6765;" class="headerlink" title="&#x5173;&#x4E8E;&#x4E2D;&#x53F0;&#x7684;&#x672A;&#x6765;"></a>&#x5173;&#x4E8E;&#x4E2D;&#x53F0;&#x7684;&#x672A;&#x6765;</h2><pre><code>&#x6211;&#x4EEC;&#x5E38;&#x542C;&#x5230;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x5927;&#x524D;&#x53F0;&#xFF0C;&#x5C0F;&#x4E2D;&#x53F0;&#x201D;&#xFF0C;&#x524D;&#x53F0;&#x670D;&#x52A1;&#x76F4;&#x63A5;&#x5BF9;&#x63A5;&#x524D;&#x7AEF;&#xFF0C;&#x4F1A;&#x6C47;&#x805A;&#x591A;&#x4E2A;&#x4E2D;&#x53F0;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x672C;&#x8EAB;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x4E2D;&#x53F0;&#x5C31;&#x53EA;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x90E8;&#x5206;&#x516C;&#x5171;&#x670D;&#x52A1;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E48;&#x8BF4;&#x4E5F;&#x4E0D;&#x662F;&#x8BF4;&#x4E2D;&#x53F0;&#x4E0D;&#x597D;&#xFF0C;&#x5404;&#x6709;&#x6240;&#x4E13;&#x561B;&#x3002;&#x968F;&#x7740;&#x56FD;&#x5185;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6781;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5404;&#x5782;&#x76F4;&#x4E1A;&#x52A1;&#x90FD;&#x6709;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5DE8;&#x5934;&#xFF0C;&#x6BD4;&#x5982;&#x51FA;&#x884C;&#x7684;&#x6EF4;&#x6EF4;&#xFF0C;&#x6E38;&#x620F;&#x7684;&#x817E;&#x8BAF;&#x548C;&#x7F51;&#x6613;&#xFF0C;&#x77ED;&#x89C6;&#x9891;&#x7684;&#x5FEB;&#x624B;&#x548C;&#x5B57;&#x8282;&#xFF0C;&#x7535;&#x5546;&#x7684;&#x963F;&#x91CC;&#x548C;&#x62FC;&#x5915;&#x5915;&#xFF0C;&#x8981;&#x60F3;&#x5728;&#x8FD9;&#x4E2A;&#x5927;&#x73AF;&#x5883;&#x751F;&#x5B58;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x5FEB;&#x901F;&#x9A8C;&#x8BC1;&#x7684;&#x65B0;&#x4E1A;&#x52A1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x6709;&#x57FA;&#x7840;&#x516C;&#x5171;&#x80FD;&#x529B;&#x7684;&#x652F;&#x6491;&#x3002;&#x5728;&#x672A;&#x6765;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4E2D;&#x53F0;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8981;&#x4E0D;&#x65AD;&#x5B8C;&#x5584;&#x548C;&#x5EFA;&#x8BBE;&#x7684;&#x3002;</code></pre><p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/76029d74f4ac4634be2f078daa0fe237.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/架构/" rel="tag"># 架构</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="6982911253261844517.html" rel="next" title="Serverless真的是云计算未来发展方向吗？">
                <i class="fa fa-chevron-left"></i> Serverless真的是云计算未来发展方向吗？
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="6983824498201985037.html" rel="prev" title="聊一聊关于聊天记录的存储">
                聊一聊关于聊天记录的存储 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#中台缘起阿里"><span class="nav-number">1.</span> <span class="nav-text">中台缘起阿里</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#浅谈中台"><span class="nav-number">2.</span> <span class="nav-text">浅谈中台</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#中台现状"><span class="nav-number">3.</span> <span class="nav-text">中台现状</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于中台的未来"><span class="nav-number">4.</span> <span class="nav-text">关于中台的未来</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
