<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,代码规范,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4EE3;&amp;#x7801;&amp;#x6DF7;&amp;#x4E71;&amp;#x7684;&amp;#x5E38;&amp;#x89C1;&amp;#x95EE;&amp;#x9898;&amp;#x5F88;&amp;#x591A;&amp;#x65F6;&amp;#x5019;&amp;#x6211;&amp;#x4EEC;&amp;#x9879;&amp;#x76EE;&amp;#x8FED;&amp;#x4EE3;&amp;#x5230;&amp;#x540E;&amp;#x671F;&amp;#xFF0C;&amp;#x9879;&amp;#x76EE;">
<meta name="keywords" content="后端,代码规范">
<meta property="og:type" content="article">
<meta property="og:title" content="聊一聊代码规范 代码混乱的常见问题">
<meta property="og:url" content="https://dev.newban.cn/7026254990406582308.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4EE3;&amp;#x7801;&amp;#x6DF7;&amp;#x4E71;&amp;#x7684;&amp;#x5E38;&amp;#x89C1;&amp;#x95EE;&amp;#x9898;&amp;#x5F88;&amp;#x591A;&amp;#x65F6;&amp;#x5019;&amp;#x6211;&amp;#x4EEC;&amp;#x9879;&amp;#x76EE;&amp;#x8FED;&amp;#x4EE3;&amp;#x5230;&amp;#x540E;&amp;#x671F;&amp;#xFF0C;&amp;#x9879;&amp;#x76EE;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2024-04-28T07:40:21.446Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="聊一聊代码规范 代码混乱的常见问题">
<meta name="twitter:description" content="&amp;#x4EE3;&amp;#x7801;&amp;#x6DF7;&amp;#x4E71;&amp;#x7684;&amp;#x5E38;&amp;#x89C1;&amp;#x95EE;&amp;#x9898;&amp;#x5F88;&amp;#x591A;&amp;#x65F6;&amp;#x5019;&amp;#x6211;&amp;#x4EEC;&amp;#x9879;&amp;#x76EE;&amp;#x8FED;&amp;#x4EE3;&amp;#x5230;&amp;#x540E;&amp;#x671F;&amp;#xFF0C;&amp;#x9879;&amp;#x76EE;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7026254990406582308.html">





  <title>聊一聊代码规范 代码混乱的常见问题 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">聊一聊代码规范 代码混乱的常见问题</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-03T16:18:40+08:00">
                2021-11-03
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x7684;&#x5E38;&#x89C1;&#x95EE;&#x9898;"><a href="#&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x7684;&#x5E38;&#x89C1;&#x95EE;&#x9898;" class="headerlink" title="&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x7684;&#x5E38;&#x89C1;&#x95EE;&#x9898;"></a>&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x7684;&#x5E38;&#x89C1;&#x95EE;&#x9898;</h1><p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9879;&#x76EE;&#x8FED;&#x4EE3;&#x5230;&#x540E;&#x671F;&#xFF0C;&#x9879;&#x76EE;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x6DF7;&#x4E71;&#xFF0C;&#x5F80;&#x5F80;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x4EBA;&#x80FD;&#x77E5;&#x9053;&#x67D0;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5E72;&#x561B;&#x7684;&#x548C;&#x8BE5;&#x5982;&#x4F55;&#x53BB;&#x6539;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5E72;&#x8106;&#x8C01;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x53EA;&#x80FD;&#x9760;&#x901A;&#x8FC7;&#x6CE8;&#x91CA;&#x53BB;&#x731C;&#x6D4B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x539F;&#x56E0;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7684;&#x4EBA;&#x4E8B;&#x53D8;&#x52A8;&#xFF0C;&#x5BFC;&#x81F4;&#x539F;&#x5148;&#x5199;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x4E0D;&#x518D;&#x7BA1;&#x7406;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x5B9E;&#x5728;&#x662F;&#x5C4E;&#x6CA1;&#x4EBA;&#x634B;&#x7684;&#x6E05;&#x3002;&#x5F80;&#x5F80;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x7C7B;&#x4EE3;&#x7801;&#x4E3A;&#x201C;&#x7956;&#x4F20;&#x4EE3;&#x7801;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x7956;&#x5B97;&#x4F20;&#x4E0B;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x4E00;&#x6837;&#xFF0C;&#x6CA1;&#x4EBA;&#x61C2;&#x6CA1;&#x4EBA;&#x6562;&#x52A8;&#x3002;&#x7956;&#x4F20;&#x4EE3;&#x7801;&#x4E00;&#x591A;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x5C4E;&#x4E00;&#x6837;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x518D;&#x8FD9;&#x57FA;&#x7840;&#x4E0A;&#x8FED;&#x4EE3;&#x5C31;&#x5982;&#x540C;&#x5C4E;&#x6D77;&#x7FFB;&#x817E;&#xFF0C;&#x6076;&#x5FC3;&#x522B;&#x4EBA;&#x4E5F;&#x6076;&#x5FC3;&#x81EA;&#x5DF1;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x53EF;&#x6015;&#x7684;&#x6076;&#x5FC3;&#x5FAA;&#x73AF;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x53BB;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x5462;&#xFF1F;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x4E0B;&#x8FD9;&#x7C7B;&#x4EE3;&#x7801;&#x7684;&#x901A;&#x75C5;</p>
<h2 id="&#x4EE3;&#x7801;&#x53C8;&#x81ED;&#x53C8;&#x957F;"><a href="#&#x4EE3;&#x7801;&#x53C8;&#x81ED;&#x53C8;&#x957F;" class="headerlink" title="&#x4EE3;&#x7801;&#x53C8;&#x81ED;&#x53C8;&#x957F;"></a>&#x4EE3;&#x7801;&#x53C8;&#x81ED;&#x53C8;&#x957F;</h2><p>&#x6211;&#x89C1;&#x8FC7;&#x6700;&#x957F;&#x7684;&#x65B9;&#x6CD5;&#x662F;5000&#x591A;&#x884C;&#xFF0C;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x6CA1;&#x4EBA;&#x6562;&#x52A8;&#xFF0C;&#x53EA;&#x6562;&#x5F80;&#x4E0B;&#x52A0; if else&#xFF0C;&#x6BCF;&#x6B21;&#x9700;&#x8981;&#x6539;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x5F00;&#x53D1;&#x90FD;&#x6218;&#x6218;&#x5162;&#x5162;&#xFF0C;&#x751F;&#x6015;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x83AB;&#x540D;&#x5176;&#x5999;&#x7684;bug&#x3002;java &#x53EF;&#x662F;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x6709;5000&#x591A;&#x884C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5F88;&#x53EF;&#x6076;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x6211;&#x60F3;&#x4E00;&#x5F00;&#x59CB;&#x4EE3;&#x7801;&#x957F;&#x5EA6;&#x53EF;&#x80FD;&#x6CA1;&#x8FD9;&#x4E48;&#x5938;&#x5F20;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x5BFC;&#x81F4;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x7684;&#xFF1F;&#x4E00;&#x4E2A;&#x662F;&#x5F53;&#x521D;&#x5199;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x672C;&#x8EAB;&#x5199;&#x7684;&#x662F;&#x76F4;&#x6765;&#x76F4;&#x53BB;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x5806;if else &#xFF1B;&#x540E;&#x9762;&#x8FED;&#x4EE3;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x9762;&#x5BF9;&#x8FD9;&#x4E48;&#x957F;&#x7684;&#x4EE3;&#x7801;&#x77AC;&#x95F4;&#x5931;&#x53BB;&#x4E86;&#x4ECE;&#x5934;&#x8BFB;&#x5230;&#x5C3E;&#x7684;&#x8010;&#x5FC3;&#xFF0C;&#x76F4;&#x63A5;&#x7EE7;&#x7EED;&#x5728;&#x540E;&#x9762;&#x52A0; if else &#x8FED;&#x4EE3;&#xFF0C;&#x6700;&#x540E;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x7F1D;&#x5408;&#x602A;&#x4E00;&#x6837;&#x7684;&#x73A9;&#x610F;&#x3002;</p>
<p>&#x597D;&#x7684; sql &#x53EF;&#x4EE5;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x592A;&#x8FC7;&#x590D;&#x6742;sql &#x672C;&#x8EAB;&#x5C31;&#x4F1A;&#x7ED9;&#x540E;&#x6765;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9020;&#x6210;&#x9605;&#x8BFB;&#x56F0;&#x96BE;&#xFF0C;&#x7ED3;&#x679C;&#x53C8;&#x662F;&#x53D8;&#x6210;&#x4E00;&#x6761;&#x65E0;&#x4EBA;&#x6562;&#x52A8;&#x7684;&#x7956;&#x4F20;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x5C11;&#x516C;&#x53F8;&#x6781;&#x5EA6;&#x62B5;&#x5236;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x5F53;&#x7136;&#x4E0D;&#x5C11;&#x94F6;&#x884C;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x6709;&#x7528;&#x6B66;&#x4E4B;&#x5730;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x53C8;&#x81ED;&#x53C8;&#x957F;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5C31;&#x7B49;&#x7740;&#x53D8;&#x6210;&#x7956;&#x4F20;&#x4EE3;&#x7801;&#x5427;&#x3002;&#x5F53;&#x5E74;&#x6211;&#x89C1;&#x5230;&#x4E00;&#x4E2A;60&#x591A;&#x4E2A;join&#x7684;sql&#xFF0C;&#x770B;&#x5230;&#x7B2C;&#x4E00;&#x773C;&#x5C31;&#x60CA;&#x4E3A;&#x5929;&#x4EBA;&#x4ECE;&#x6B64;&#x96BE;&#x4EE5;&#x5FD8;&#x6000;&#xFF0C;&#x5F53;&#x7136;&#x90A3;&#x6BB5;sql&#x4E5F;&#x6210;&#x4E86;&#x6CA1;&#x4EBA;&#x6562;&#x53BB;&#x52A8;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#x3002;</p>
<h2 id="&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E0D;&#x660E;&#x6240;&#x4EE5;"><a href="#&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E0D;&#x660E;&#x6240;&#x4EE5;" class="headerlink" title="&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E0D;&#x660E;&#x6240;&#x4EE5;"></a>&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E0D;&#x660E;&#x6240;&#x4EE5;</h2><p>&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4E0D;&#x660E;&#x6240;&#x4EE5;&#x662F;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x5F88;&#x5BB9;&#x6613;&#x53BB;&#x72AF;&#x7684;&#x6BDB;&#x75C5;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x81F4;&#x547D;&#x5374;&#x70E6;&#x4EBA;&#x7684;&#x6BDB;&#x75C5;&#x3002;&#x5728;&#x4EE3;&#x7801;&#x4E0A;&#x7684;&#x4F53;&#x73B0;&#x662F;&#xFF0C;&#x903B;&#x8F91;&#x5224;&#x65AD;&#x5199;&#x7684;&#x6BD4;&#x8F83;&#x53CD;&#x4EBA;&#x7C7B;&#x5404;&#x79CD;&#x53CC;&#x91CD;&#x5426;&#x5B9A;&#x662F;&#x80AF;&#x5B9A;&#xFF0C;&#x4E0D;&#x628A;&#x4F60;&#x7ED5;&#x6655;&#x4E0D;&#x7F62;&#x4F11;&#x3002;&#x6216;&#x8005;&#x662F;&#x5199;&#x8D77;&#x4EE3;&#x7801;&#x6765;&#x4E1C;&#x4E00;&#x6994;&#x5934;&#x897F;&#x4E00;&#x68D2;&#x69CC;&#xFF0C;&#x8BA9;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x60F3;&#x5E72;&#x561B;&#x3002;&#x5BFC;&#x81F4;&#x8FD9;&#x4E2A;&#x7684;&#x539F;&#x56E0;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x9700;&#x6C42;&#x7406;&#x89E3;&#x4E0A;&#x51FA;&#x73B0;&#x504F;&#x5DEE;&#xFF0C;&#x505A;&#x5230;&#x540E;&#x9762;&#x53D1;&#x73B0;&#x4E0D;&#x5BF9;&#x52B2;&#xFF0C;&#x518D;&#x56DE;&#x53BB;&#x6539;&#x53C8;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x786C;&#x7740;&#x5934;&#x76AE;&#x5F80;&#x4E0B;&#x5199;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x5F2F;&#x5F2F;&#x7ED5;&#x7ED5;&#xFF1B;&#x8FD8;&#x6709;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x9505;&#x662F;&#x5728;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x4EFB;&#x610F;&#x53D8;&#x66F4;&#x9700;&#x6C42;&#xFF0C;&#x60F3;&#x4E00;&#x51FA;&#x662F;&#x4E00;&#x51FA;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x5948;&#x53EA;&#x80FD;&#x8DDF;&#x7740;&#x60F3;&#x4E00;&#x51FA;&#x5199;&#x4E00;&#x51FA;&#x3002;&#x8FD8;&#x7528;&#x53EF;&#x80FD;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x7C7B;&#x547D;&#x540D;&#x592A;&#x827A;&#x672F;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x56DB;&#x5DDD;&#x65B9;&#x8A00;&#x62FC;&#x97F3;&#x8FD9;&#x79CD;&#x6CA1;&#x6709;&#x5341;&#x5E74;&#x8111;&#x8840;&#x6813;&#x60F3;&#x4E0D;&#x51FA;&#x7684;&#x547D;&#x540D;&#x54B1;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#x3002;&#x5C31;&#x8BF4;&#x90A3;&#x79CD;&#x56FD;&#x4EA7;&#x51CC;&#x51CC;&#x6F06;&#x5F0F;&#x7684;&#x65E0;&#x5398;&#x5934;&#x547D;&#x540D;&#x2014;&#x2014;&#x8FD9;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x4E2A;&#x522E;&#x80E1;&#x5200;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E2A;&#x5439;&#x98CE;&#x673A;&#xFF0C;&#x5C31;&#x8FD9;&#x79CD;&#x4E0D;&#x77E5;&#x9053;&#x8BA9;&#x4EBA;&#x8BF4;&#x4EC0;&#x4E48;&#x597D;&#x3002;</p>
<h2 id="&#x89C4;&#x5212;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;"><a href="#&#x89C4;&#x5212;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;" class="headerlink" title="&#x89C4;&#x5212;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;"></a>&#x89C4;&#x5212;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;</h2><p>&#x5410;&#x69FD;&#x4E86;&#x4E00;&#x5806;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x95EE;&#x9898;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8BF4;&#x8BF4;&#x5982;&#x4F55;&#x53BB;&#x89C4;&#x8303;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x505A;&#x5230;&#x5C31;&#x7B97;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x6362;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x9879;&#x76EE;&#x8F6C;&#x624B;&#x7ED9;&#x4ED6;&#x4EBA;&#x4E86;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8BA9;&#x540E;&#x9762;&#x7684;&#x5F00;&#x53D1;&#x53EF;&#x4EE5;&#x65E0;&#x788D;&#x7684;&#x53BB;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x7136;&#x5404;&#x4E2A;&#x516C;&#x53F8;/&#x56E2;&#x961F;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#xFF0C;&#x6BD4;&#x5982;&#x9879;&#x76EE;&#x7684;&#x7ED3;&#x6784;&#x3001;&#x4EE3;&#x7801;&#x547D;&#x540D;&#x98CE;&#x683C;&#x3001;&#x4EE3;&#x7801;&#x683C;&#x5F0F;&#x7B49;&#x7B49;&#x3002;&#x4E0D;&#x540C;&#x56E2;&#x961F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x4F46;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#x7684;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#x6765;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x601D;&#x60F3;&#x3002;</p>
<h2 id="&#x82B1;&#x53F6;&#x8BBA;"><a href="#&#x82B1;&#x53F6;&#x8BBA;" class="headerlink" title="&#x82B1;&#x53F6;&#x8BBA;"></a>&#x82B1;&#x53F6;&#x8BBA;</h2><p>&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x662F;&#x6211;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x4E2D;&#x6700;&#x6D45;&#x663E;&#x4E5F;&#x662F;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x53EA;&#x8981;&#x7A0D;&#x5FAE;&#x52A8;&#x52A8;&#x8111;&#x5B50;&#x5C31;&#x80FD;&#x60F3;&#x51FA;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x51FA;&#x6765;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x505A;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x5728;&#x5199;crud&#xFF0C;&#x611F;&#x89C9;&#x4F3C;&#x4E4E;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x6CA1;&#x4EC0;&#x4E48;&#x89C4;&#x8303;&#x597D;&#x8BF4;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5BF9;&#x4E00;&#x6BB5;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5206;&#x4E3A;&#x56DB;&#x7C7B;&#xFF1A;</p>
<ol>
<li>&#x6570;&#x636E;&#x6821;&#x9A8C;</li>
<li>&#x4E1A;&#x52A1;&#x903B;&#x8F91;</li>
<li>&#x6570;&#x636E;&#x8F6C;&#x6362;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x4EA4;&#x4E92;&#xFF08;&#x67E5;&#x8BE2;&#x4E0E;&#x6301;&#x4E45;&#x5316;&#xFF09;</li>
</ol>
<p>&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x6700;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x903B;&#x8F91;&#x5224;&#x65AD;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4EA4;&#x4E92;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x89C6;&#x5176;&#x4E3A;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x65B9;&#x6CD5;&#x4EE5;&#x7B80;&#x5316;&#x6A21;&#x578B;&#xFF0C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7B97;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x800C;&#x8A00;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x5173;&#x5FC3;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x548C;&#x6570;&#x636E;&#x7684;&#x8F6C;&#x6362;&#xFF08;DTO&#x8F6C;VO&#x7B49;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x5206;&#x51FA;&#x4E00;&#x4E2A;&#x4E3B;&#x6B21;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x628A;&#x4E3B;&#x903B;&#x8F91;&#x7ED9;&#x51F8;&#x663E;&#x51FA;&#x6765;&#xFF0C;&#x6700;&#x597D;&#x4E00;&#x773C;&#x770B;&#x53BB;&#x5C31;&#x80FD;&#x8BA9;&#x4EBA;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x8FD9;&#x4E2A;&#x7C7B;&#x5E72;&#x4E86;&#x5565;&#xFF0C;&#x6B65;&#x9AA4;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x91CD;&#x8981;&#x4F46;&#x5FC5;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x6211;&#x79F0;&#x5176;&#x4E3A;&#x53F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E3B;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x6211;&#x79F0;&#x5176;&#x4E3A;&#x82B1;&#x3002;&#x53F6;&#x662F;&#x4E3A;&#x4E86;&#x886C;&#x6258;&#x82B1;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C06;&#x90A3;&#x4E9B;&#x53F6;&#x5B50;&#x4EE3;&#x7801;&#x7CBE;&#x7B80;&#x6216;&#x8005;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x9690;&#x85CF;&#x53F6;&#x5B50;&#x4EE3;&#x7801;&#xFF0C;&#x7A81;&#x51FA;&#x4E3B;&#x5E72;&#x903B;&#x8F91;&#x7684;&#x4E00;&#x4E9B;&#x624B;&#x6CD5;</p>
<h3 id="1&#xFF09;Converter&#xFF08;&#x8F6C;&#x6362;&#x5668;&#xFF09;"><a href="#1&#xFF09;Converter&#xFF08;&#x8F6C;&#x6362;&#x5668;&#xFF09;" class="headerlink" title="1&#xFF09;Converter&#xFF08;&#x8F6C;&#x6362;&#x5668;&#xFF09;"></a>1&#xFF09;Converter&#xFF08;&#x8F6C;&#x6362;&#x5668;&#xFF09;</h3><p>&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F7F;&#x7528; bean &#x62F7;&#x8D1D;&#x4F7F;&#x7528;&#x7684;&#x662F; BeanUtils &#x8FD9;&#x4E2A;&#x7C7B;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x7136;&#x800C;&#x4E00;&#x4E9B;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x7684;&#x5B9E;&#x4F53;&#x8F6C;&#x6362;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x5C31;&#x65E0;&#x6CD5;&#x80DC;&#x4EFB;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x624B;&#x52A8;&#x7684; get set ,&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;get set &#x65B9;&#x6CD5;&#x63A9;&#x76D6;&#x4E86;&#x4E3B;&#x5E72;&#x903B;&#x8F91;&#xFF0C;&#x8BA9;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x4E0D;&#x6E05;&#x6670;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x5EFA;&#x8BAE;&#x5728;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4E2D;&#x5F15;&#x5165; 1&#xFF09;Converter &#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x6765;&#x4E13;&#x95E8;&#x8D1F;&#x8D23;&#x6570;&#x636E;&#x7684;&#x4F20;&#x9012;&#x4E0E;&#x8F6C;&#x6362;&#x3002;</p>
<h3 id="2&#xFF09;manager-&#x5C42;"><a href="#2&#xFF09;manager-&#x5C42;" class="headerlink" title="2&#xFF09;manager &#x5C42;"></a>2&#xFF09;manager &#x5C42;</h3><p>&#x65E0;&#x8BBA;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x6301;&#x4E45;&#x5C42;&#x6846;&#x67B6;&#x662F;&#x54EA;&#x4E00;&#x79CD;&#xFF0C;jpa &#x6216;&#x8005; mybatis &#x6211;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x90FD;&#x5E94;&#x8BE5;&#x5BF9;&#x6301;&#x4E45;&#x5C42;&#x7684;&#x90E8;&#x5206;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x5C01;&#x88C5;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x963F;&#x91CC;&#x89C4;&#x8303;&#x91CC;&#x9762;&#x63D0;&#x5021;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x597D;&#x5904;&#x662F;&#x660E;&#x663E;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x65F6;&#x5F80;&#x5F80;&#x8981; set &#x4E00;&#x4E9B;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x6216;&#x8005;&#x5BF9;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x5F80;&#x5F80;&#x8FD9;&#x7C7B;&#x64CD;&#x4F5C;&#x5728;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x6709;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x91CD;&#x590D;&#x6027;&#x3002;&#x5982;&#x679C;&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x653E;&#x5230;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#xFF0C;&#x5C11;&#x91CF;&#x8FD8;&#x597D;&#xFF0C;&#x591A;&#x4E86;&#x7684;&#x8BDD;&#x5C31;&#x663E;&#x5F97;&#x5F88;&#x81C3;&#x80BF;&#x4E86;&#x3002;&#x5982;&#x679C;&#x628A;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x79FB;&#x5230;manager&#x5C42;&#x91CC;&#x9762;&#x53BB;&#xFF0C;&#x4E0D;&#x4EC5;&#x4E3B;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x88AB;&#x5E72;&#x6270;&#xFF0C;&#x8FD8;&#x80FD;&#x63D0;&#x9AD8;&#x4E00;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x590D;&#x7528;&#x7387;&#x3002;</p>
<h3 id="3&#xFF09;&#x65B9;&#x6CD5;&#x7B80;&#x5355;&#x5C01;&#x88C5;"><a href="#3&#xFF09;&#x65B9;&#x6CD5;&#x7B80;&#x5355;&#x5C01;&#x88C5;" class="headerlink" title="3&#xFF09;&#x65B9;&#x6CD5;&#x7B80;&#x5355;&#x5C01;&#x88C5;"></a>3&#xFF09;&#x65B9;&#x6CD5;&#x7B80;&#x5355;&#x5C01;&#x88C5;</h3><p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x7AEF;&#x903B;&#x8F91;&#x8981;&#x5206;&#x6210;&#x4E09;&#x5927;&#x6B65;&#xFF0C;&#x800C;&#x6BCF;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x53C8;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x5C0F;&#x6B65;&#x9AA4;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x62C6;&#x5206;&#x6210;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x5B8C;&#x6210;&#x5404;&#x81EA;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x624B;&#x6CD5;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x60F3;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD9;&#x91CC;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x662F;&#x7B80;&#x5316;&#x590D;&#x6742;&#x65B9;&#x6CD5;&#x5C01;&#x88C5;&#x7684;&#x795E;&#x5668;&#x2014;&#x2014;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F; stream &#x6D41;&#x548C; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x5C01;&#x88C5;&#x9002;&#x7528;&#x7684;&#x573A;&#x666F;&#x662F;&#xFF1A;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x6BD4;&#x8F83;&#x56FA;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x53D8;&#x5316;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B; java.util.function &#x8FD9;&#x4E2A;&#x5305;&#x7684;&#x6E90;&#x7801;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x5305;&#x4E0B;&#x9762;&#x5168;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x88AB;&#x79F0;&#x4E3A;&#x51FD;&#x6570;&#x5F0F;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5F0F;&#x63A5;&#x53E3;&#x603B;&#x4F53;&#x4E0A;&#x5206;&#x4E3A;&#x56DB;&#x7C7B;&#xFF1A;</p>
<p>Function &#x7C7B;&#x578B;&#xFF1A;&#x4F20;&#x5165;&#x4E00;&#x4E2A;bean &#x8FD4;&#x56DE;&#x53E6;&#x5916;&#x4E00;&#x4E2A;bean<br>Consumer &#x7C7B;&#x578B;&#xFF1A;&#x4F20;&#x5165;&#x4E00;&#x4E2A;bean &#x65E0;&#x8FD4;&#x56DE;&#x503C;<br>Predicate &#x7C7B;&#x578B;&#xFF1A;&#x4F20;&#x5165;&#x4E00;&#x4E2A;bean &#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;<br>Supplier &#x7C7B;&#x578B;&#xFF1A;&#x6CA1;&#x6709;&#x5165;&#x53C2;&#xFF0C;&#x6709;&#x51FA;&#x53C2;<br>&#x4EE5; Consumer &#x7684;&#x4F7F;&#x7528;&#x4E3A;&#x4F8B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;public User getUser(Consumer&lt;User&gt; consumer){</span><br><span class="line">    User user=new User();</span><br><span class="line">    consumer.accept(user);</span><br><span class="line">    user=userMapper.getUser(user);</span><br><span class="line">    return user;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">public void doSomething1(){</span><br><span class="line">    User user=getUser(user-&gt;{user.setId(1L)});</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">public void doSomething2(){</span><br><span class="line">    User user=getUser(user-&gt;{user.setName(&quot;xxx&quot;)});</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x60F3;&#x8C61;&#x7A7A;&#x95F4;&#x5F88;&#x5927;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x5F97;&#x5F53;&#x5FC5;&#x5B9A;&#x4F1A;&#x7B80;&#x5316;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x590D;&#x7528;&#x7387;&#x3002;&#x4F46;&#x662F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x5F0F;&#x8981;&#x7559;&#x610F;&#x6570;&#x636E;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x65E5;&#x5FD7;&#x548C;&#x6CE8;&#x91CA;&#x7684;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;</p>
<h3 id="1&#xFF09;&#x65E5;&#x5FD7;"><a href="#1&#xFF09;&#x65E5;&#x5FD7;" class="headerlink" title="1&#xFF09;&#x65E5;&#x5FD7;"></a>1&#xFF09;&#x65E5;&#x5FD7;</h3><p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x660E;&#x767D;&#x65E5;&#x5FD7;&#x662F;&#x7ED9;&#x4EBA;&#x770B;&#x7684;&#xFF0C;&#x4F60;&#x52A0;&#x8FD9;&#x6BB5;&#x65E5;&#x5FD7;&#x65F6;&#x8981;&#x8003;&#x8651;&#x6E05;&#x695A;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x53BB;&#x67E5;&#x8FD9;&#x6BB5;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x6BB5;&#x65E5;&#x5FD7;&#x6709;&#x6CA1;&#x6709;&#x7528;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x67E5;&#x9605;&#x65E5;&#x5FD7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x8BCD;&#x53BB;&#x641C;&#x7D22;&#xFF1B;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x6253;&#x7684;&#x65E5;&#x5FD7;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x4E0D;&#x8981;&#x548C;&#x5176;&#x4ED6;&#x65E5;&#x5FD7;&#x91CD;&#x590D;&#xFF0C;&#x4E0D;&#x8981;&#x8FC7;&#x957F;&#xFF0C;&#x4FBF;&#x4E8E;&#x641C;&#x7D22;&#x624D;&#x662F;&#x738B;&#x9053;&#x3002;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x65E5;&#x5FD7;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x8FFD;&#x6EAF;bug&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x539F;&#x5219;&#x5C31;&#x662F;&#x80FD;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x51FA;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6216;&#x8005;&#x6D41;&#x7A0B;&#x7684;&#x8D70;&#x5411;&#xFF0C;&#x5BF9;&#x6B64;&#x6211;&#x5EFA;&#x8BAE;&#x6253;&#x65E5;&#x5FD7;&#x7684;&#x5730;&#x65B9;&#xFF1A;</p>
<p>&#x6570;&#x636E;&#x66F4;&#x65B0;&#xFF1A;&#x6211;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x77E5;&#x9053;&#x5199;&#x5E93;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#xFF1B;<br>&#x6761;&#x4EF6;&#x5206;&#x652F;&#xFF1A;&#x4FBF;&#x4E8E;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x4E1A;&#x52A1;&#x8D70;&#x7684;&#x54EA;&#x4E00;&#x6761;&#x903B;&#x8F91;&#xFF1B;<br>&#x6279;&#x91CF;&#x5199;&#x5E93;&#xFF1A;&#x6253;&#x4E0A;&#x6570;&#x636E;&#x91CF;&#x5927;&#x5C0F;&#x7684;&#x65E5;&#x5FD7;&#xFF0C;&#x4FBF;&#x4E8E;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x3002;<br>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x90FD;&#x5E94;&#x8BE5;&#x6253;&#x4E0A;&#x65E5;&#x5FD7;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E24;&#x6761;&#x65E5;&#x5FD7;&#x5C31;&#x80FD;&#x5206;&#x6790;&#x51FA;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x70B9;&#x5728;&#x54EA;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5176;&#x4ED6;&#x7684;&#x65E5;&#x5FD7;&#x5C31;&#x663E;&#x5F97;&#x591A;&#x4F59;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x6211;&#x4EEC;&#x6253;&#x5B8C;&#x65E5;&#x5FD7;&#x4E4B;&#x540E;&#x5E94;&#x8BE5;&#x5728;&#x672C;&#x5730;&#x73AF;&#x5883;&#x8FFD;&#x6EAF;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x65E5;&#x5FD7;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x80FD;&#x8BFB;&#x61C2;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x662F;&#x5426;&#x5C11;&#x4E86;&#x91CD;&#x8981;&#x53C2;&#x6570;&#x3002;</p>
<h3 id="2&#xFF09;&#x6CE8;&#x91CA;"><a href="#2&#xFF09;&#x6CE8;&#x91CA;" class="headerlink" title="2&#xFF09;&#x6CE8;&#x91CA;"></a>2&#xFF09;&#x6CE8;&#x91CA;</h3><p>&#x6700;&#x57FA;&#x672C;&#x7684;&#x4E24;&#x4E2A;&#x6CE8;&#x91CA;&#x2014;&#x2014;&#x7C7B;&#x6CE8;&#x91CA;&#xFF0C;&#x65B9;&#x6CD5;&#x6CE8;&#x91CA;&#x76F8;&#x5173;&#x89C4;&#x8303;&#x963F;&#x91CC;&#x5F00;&#x53D1;&#x624B;&#x518C;&#x4E0A;&#x5C31;&#x6709;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x590D;&#x8FF0;&#x4E86;&#xFF0C;&#x6211;&#x5206;&#x4EAB;&#x4E0B;&#x6211;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x4E2A;&#x4EBA;&#x4E60;&#x60EF;&#x3002;<br>&#x65B9;&#x6CD5;&#x6CE8;&#x91CA;&#x4E0A;&#x9664;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x6211;&#x8FD8;&#x4F1A;&#x5C06;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x7684;&#x539F;&#x6587;&#x8D34;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x4E0A;&#x53BB;&#x518D;&#x5199;&#x4E0A;&#x65E5;&#x671F;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x8BA9;&#x522B;&#x4EBA;&#x660E;&#x767D;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x8981;&#x6C42;&#x5E72;&#x5565;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8BE5;&#x5E72;&#x5565;&#xFF0C;&#x800C;&#x4E14;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5077;&#x5077;&#x6539;&#x9700;&#x6C42;&#x4F60;&#x8FD8;&#x80FD;&#x6709;&#x8FFD;&#x67E5;&#x7684;&#x6839;&#x636E;&#xFF0C;&#x6709;&#x4E2A;&#x5C0F;&#x672C;&#x672C;&#x5077;&#x5077;&#x8BB0;&#x5F55;&#x4ED6;&#x7684;&#x7F6A;&#x884C;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x6211;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x6211;&#x5077;&#x5E08;&#x6765;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;pulic void test(){</span><br><span class="line">    /** 1. &#x4ECE;excel &#x83B7;&#x53D6; vo*/</span><br><span class="line">    Workbook workBook = getWorkBook(wookbookStream);</span><br><span class="line">    //&#x83B7;&#x53D6;&#x6210;&#x5458;&#x4FE1;&#x606F;</span><br><span class="line">    Sheet userSheet = workBook.getSheetAt(3);</span><br><span class="line">     Map&lt;String, UserVO&gt; userVOMap = getUserForExcel(file, userSheet);</span><br><span class="line">    // &#x83B7;&#x53D6;&#x9879;&#x76EE;vo</span><br><span class="line">    Sheet projectSheet = workBook.getSheetAt(0);</span><br><span class="line">    ProjectVO projectVO = getProjectForExcel(file, isInsert, userVOMap);</span><br><span class="line">    // &#x83B7;&#x53D6;&#x4EFB;&#x52A1;vo</span><br><span class="line">    Sheet taskSheet = workBook.getSheetAt(1);</span><br><span class="line">    Map&lt;String, TaskVO&gt; taskVOMap = getTaskListForExcel(file, taskSheet, userVOMap);</span><br><span class="line">    /** 2. &#x63D2;&#x5165;&#x6570;&#x636E; */</span><br><span class="line">    if (isInsert.get()){</span><br><span class="line">        ......</span><br><span class="line">    }</span><br><span class="line">   /** 3.&#x5199;&#x5165;&#x5F02;&#x5E38;&#x4FE1;&#x606F; */</span><br><span class="line">    if (!isInsert.get()) {</span><br><span class="line">        .....</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E3B;&#x5E72;&#x7684;&#x6B65;&#x9AA4; &#x6211;&#x7528; /** 1. <em>/ /*\</em> 2. <em>/ javadoc&#x7684;&#x6CE8;&#x91CA;&#x6765;&#x6807;&#x6CE8;&#x4E86;&#xFF0C;&#x800C;&#x666E;&#x901A;&#x7684;&#x6CE8;&#x91CA;&#x6211;&#x7528; // &#x6807;&#x6CE8;&#xFF0C;&#x56E0;&#x4E3A;idea &#x5728;&#x7EAF;&#x9ED1;&#x4E3B;&#x9898;&#x4E0B;&#x4F1A;&#x7ED9; /*\</em> &#x8FD9;&#x6837;&#x7684;&#x6CE8;&#x91CA;&#x914D;&#x4E0A;&#x7EFF;&#x8272;&#xFF0C;&#x4F1A;&#x6BD4;&#x8F83;&#x663E;&#x773C;&#x3002;&#x6211;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x5F3A;&#x8C03;&#x6211;&#x4EE3;&#x7801;&#x90A3;&#x4E9B;&#x662F;&#x82B1;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x53F6;&#x5B50;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E0D;&#x5927;&#x7B26;&#x5408;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#xFF0C;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x7406;&#x6027;&#x53D6;&#x820D;&#xFF0C;&#x8FD9;&#x79CD;&#x624B;&#x6CD5;&#x672A;&#x5FC5;&#x597D;&#x3002;</p>
<h2 id="&#x516D;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;"><a href="#&#x516D;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;" class="headerlink" title="&#x516D;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;"></a>&#x516D;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;</h2><p>&#x5BF9;&#x4E8E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x516D;&#x5927;&#x57FA;&#x672C;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5F00;&#x53D1;&#x51C6;&#x5219;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x5927;&#x5728;&#x610F;&#x8FD9;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x53C8;&#x81ED;&#x53C8;&#x957F;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x5BF9;&#x4E8E;&#x7C7B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x627F;&#x62C5;&#x7684;&#x804C;&#x8D23;&#x8D8A;&#x591A;&#xFF0C;&#x5B83;&#x88AB;&#x590D;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#xFF0C;&#x91CD;&#x6784;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x8D77;&#x6765;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x91CD;&#x91CD;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x8BA9;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x53EA;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x4EE3;&#x7801;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x624B;&#x6CD5;&#x5C31;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x63D0;&#x9AD8;&#x5176;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x53BB;&#x5B9E;&#x73B0;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x5C31;&#x80FD;&#x63D0;&#x524D;&#x89E3;&#x51B3;&#x6389;&#x8BB8;&#x591A;&#x672A;&#x77E5;&#x9690;&#x60A3;&#xFF0C;&#x800C;&#x4E14;&#x8FD0;&#x7528;&#x5F97;&#x5F53;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FD8;&#x80FD;&#x6EE1;&#x8DB3;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x4E0E;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#xFF0C;&#x5176;&#x5B9E;service&#x5C42;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x6709;&#x90A3;&#x4E48;&#x70B9;&#x5473;&#x9053;&#x4E86;&#xFF0C;&#x800C;&#x4E14;spring&#x7684;&#x7279;&#x6027;&#x4E5F;&#x652F;&#x6301;&#x63A5;&#x53E3;&#x6CE8;&#x5165;List&#x548C;map&#xFF0C;&#x7136;&#x800C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x591A;&#x5E74;&#x7684;&#x540C;&#x5B66;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x5728;&#x8BB8;&#x591A;&#x573A;&#x666F;&#x4E0B;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;map&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x7684; if else &#x5206;&#x652F;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x547D;&#x540D; &#x2018;&#x6F5C;&#x89C4;&#x5219;&#x2019;<br>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x547D;&#x540D;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x79CD;&#x6CE8;&#x91CA;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x547D;&#x540D;&#x662F;&#x6307;&#x5927;&#x5BB6;&#x7EA6;&#x5B9A;&#x4FD7;&#x6210;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x3002;&#x5982;&#x679C;&#x4F60;&#x591A;&#x7559;&#x5FC3;&#x5404;&#x4E2A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x3002;&#x963F;&#x91CC;&#x5F00;&#x53D1;&#x624B;&#x518C;&#x91CC;&#x9762;&#x4E5F;&#x5217;&#x4E3E;&#x4E0D;&#x5C11;&#x547D;&#x540D;&#x524D;&#x7F00;&#x4E0E;&#x540E;&#x7F00;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x5176;&#x5B9E;&#x5404;&#x4E2A;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x89C4;&#x5B9A;&#x4E00;&#x4E9B;&#x547D;&#x540D;&#x89C4;&#x5219;&#xFF0C;&#x964D;&#x4F4E;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x7684;&#x6210;&#x672C;&#x3002;&#x5173;&#x4E8E;&#x6211;&#x7684;&#x6587;&#x7AE0; &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6742;&#x8C08;</p>
<p>&#x4ECB;&#x7ECD;&#x8FC7;&#x90E8;&#x5206;&#x547D;&#x540D;&#x89C4;&#x5219;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;&#x3002;</p>
<h2 id="&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x53CA;&#x7248;&#x672C;&#x63A7;&#x5236;"><a href="#&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x53CA;&#x7248;&#x672C;&#x63A7;&#x5236;" class="headerlink" title="&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x53CA;&#x7248;&#x672C;&#x63A7;&#x5236;"></a>&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x53CA;&#x7248;&#x672C;&#x63A7;&#x5236;</h2><p>&#x6B63;&#x786E;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53CA;&#x65F6;&#x7684;&#x7F15;&#x6E05;&#x4EE3;&#x7801;&#x7684;&#x4FEE;&#x6539;&#x5386;&#x53F2;&#xFF0C;&#x4ECE;&#x800C;&#x5FEB;&#x901F;&#x7684;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x3002;&#x4EE5;git&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5C31;&#x662F;&#x51E0;&#x4E2A;&#x5B57;&#x800C;&#x5DF2;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x53BB;&#x5B9A;&#x4F4D;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4FEE;&#x6539;&#x5386;&#x53F2;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x7684;&#x4FEE;&#x6539;&#x65E5;&#x5FD7;&#x8981;&#x8BA9;&#x522B;&#x4EBA;&#x80FD;&#x770B;&#x61C2;&#x5C31;&#x5F97;&#x6309;&#x4E00;&#x5B9A;&#x7684;&#x683C;&#x5F0F;&#x6765;&#x5199;&#x4E86;&#x3002;Git Commit message&#x7684; Angular&#x89C4;&#x8303;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; commit message &#x683C;&#x5F0F;&#x6709;3&#x4E2A;&#x5185;&#x5BB9;&#xFF1A;</p>
<p>Header Header&#x90E8;&#x5206;&#x6709;3&#x4E2A;&#x5B57;&#x6BB5;&#xFF1A; type(&#x5FC5;&#x9700;), scope(&#x53EF;&#x9009;), subject(&#x5FC5;&#x9700;)<br>Body &#x90E8;&#x5206;&#x662F;&#x5BF9;&#x672C;&#x6B21; commit &#x7684;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x591A;&#x884C;&#x3002;<br>Footer&#x4E0D;&#x5E38;&#x7528;&#xFF0C;&#x53EF;&#x4E3A;&#x7A7A; &#x5305;&#x62EC;&#x4E0D;&#x517C;&#x5BB9;&#x53D8;&#x52A8;&#x3001;&#x5173;&#x95ED;issue&#x3002;<br>&#x8FD9;&#x91CC;&#x7531;&#x4E8E;&#x7BC7;&#x5E45;&#x95EE;&#x9898;&#x4E0D;&#x7EC6;&#x8BF4;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x53EF;&#x4EE5;&#x767E;&#x5EA6;&#x67E5;&#x67E5;&#x8D44;&#x6599;&#x3002;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x6309;&#x7167;&#x8FD9;&#x4E48;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x5219;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x89C4;&#x8303;&#x6765;&#x7BA1;&#x7406;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x800C;&#x8A00;&#xFF0C;gitflow &#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x3002;&#x53EF;&#x4EE5;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x7BA1;&#x7406;&#x597D;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x652F;&#x4EE3;&#x7801;&#xFF0C;&#x907F;&#x514D;&#x56E2;&#x961F;&#x7684;&#x4EBA;&#x7531;&#x4E8E;&#x8BEF;&#x64CD;&#x4F5C;&#x800C;&#x5BFC;&#x81F4;&#x67D0;&#x4E2A;&#x91CD;&#x8981;&#x5206;&#x652F;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x4E0B;&#x9762;&#x8D34;&#x51FA;gitflow &#x6D41;&#x7A0B;&#x56FE;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x540C;&#x6837;&#x4E0D;&#x4F1A;&#x4ECB;&#x7ECD;&#x592A;&#x591A;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x5C0F;&#x4F19;&#x4F34;&#x53BB;&#x767E;&#x5EA6;&#x5427;</p>
<p>xxx</p>
<h2 id="&#x5E2E;&#x52A9;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x5DE5;&#x5177;"><a href="#&#x5E2E;&#x52A9;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x5DE5;&#x5177;" class="headerlink" title="&#x5E2E;&#x52A9;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x5DE5;&#x5177;"></a>&#x5E2E;&#x52A9;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x5DE5;&#x5177;</h2><p>&#x672C;&#x8282;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;idea&#x63D2;&#x4EF6;&#x548C;&#x6846;&#x67B6;&#xFF0C;&#x5F53;&#x7136;&#x5927;&#x540D;&#x9F0E;&#x9F0E;&#x7684; &#x963F;&#x91CC;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x63D2;&#x4EF6;&#x54B1;&#x5C31;&#x4E0D;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x5BB6;&#x591A;&#x5C11;&#x4E86;&#x89E3;&#x3002;&#x4E0D;&#x8FC7;&#x672C;&#x4EBA;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x4E00;&#x4E9B;&#x56E2;&#x961F;&#xFF0C;&#x4E00;&#x662F;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x89C4;&#x8303;&#x592A;&#x8FC7;&#x4E25;&#x683C;&#xFF0C;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7D20;&#x8D28;&#x8981;&#x6C42;&#x592A;&#x9AD8;&#xFF0C;&#x4E8C;&#x662F;&#x6709;&#x7684;&#x56E2;&#x961F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x8303;&#x89C4;&#x5219;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x53EF;&#x80FD;&#x548C;&#x963F;&#x91CC;&#x89C4;&#x8303;&#x51B2;&#x7A81;&#xFF0C;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x3002;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x63D2;&#x4EF6;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5408;&#x4E00;&#x4E9B;&#x5C0F;&#x4F19;&#x4F34;&#x3002;&#x6211;&#x5217;&#x4E3E;&#x51FA;&#x6765;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x5BFB;&#x601D;&#x5427;&#x3002;</p>
<p>mapstruct<br>&#x5BF9;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#x662F;&#x5F88;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x82B1;&#x53F6;&#x8BBA;&#x4E2D;&#x7684; &#x201C;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x201D; &#x7684;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x5C11;&#x516C;&#x53F8;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x6982;&#x5FF5;&#x2014;&#x2014;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x4F5C;&#x7528;&#x662F;&#x5C06; DO&#x8F6C;VO &#x6216;&#x8005; VO&#x8F6C;DTO&#x7B49;&#xFF0C;&#x4E00;&#x822C;&#x8FD9;&#x7C7B;&#x7C7B;&#x90FD;&#x662F;&#x4EE5; converter &#x7ED3;&#x5C3E;&#x3002;&#x800C;mapstruct&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#x671F;&#x751F;&#x6210;&#x5B57;&#x8282;&#x7801;&#x6765;&#x81EA;&#x52A8;&#x7684;&#x751F;&#x6210;bean&#x7684;&#x8F6C;&#x6362;&#x7C7B;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x5C06;&#x4E00;&#x4E2A;bean&#x7684;&#x6570;&#x636E;&#x8D4B;&#x503C;&#x7ED9;&#x53E6;&#x5916;&#x4E00;&#x4E2A;bean&#x53EA;&#x9700;&#x8981;&#x53BB;&#x5B9A;&#x4E49;&#x63A5;&#x53E3;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x6837;&#x65E2;&#x51CF;&#x8F7B;&#x4E86;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8FD8;&#x5C06;&#x65E0;&#x610F;&#x4E49;&#x7684;get&#x548C;set&#x65B9;&#x6CD5;&#x4ECE;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x5254;&#x9664;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x5B57;&#x8282;&#x7801;&#x7F13;&#x5B58;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x8FC7;&#x7C7B;&#x4F3C;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x5B57;&#x8282;&#x7801;&#x5DE5;&#x5177;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x2014;&#x2014;mapstruct &#x662F;&#x6839;&#x636E;&#x63A5;&#x53E3;&#x53BB;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7C7B;&#x7684;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x66F4;&#x65B0;&#x4E86;&#x63A5;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x6709;&#x53EF;&#x80FD;&#x6CA1;&#x91CD;&#x65B0;&#x751F;&#x6210;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x53EA;&#x6709;&#x7528;idea&#x8C03;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x6709;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x5FC5;&#x592A;&#x62C5;&#x5FC3;&#x3002;</p>
<p>checkStyle<br>idea checkStyle &#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x7EDF;&#x4E00;&#x56E2;&#x961F;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x548C;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#xFF0C;&#x964D;&#x4F4E;&#x56E2;&#x961F;&#x7684;&#x4EA4;&#x6D41;&#x6210;&#x672C;&#xFF0C;&#x4E00;&#x822C;&#x914D;&#x5408; save actions Reborn &#x98DF;&#x7528;&#x66F4;&#x4F73;&#x3002;&#x5173;&#x4E8E;checkStyle&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7F51;&#x4E0A;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x8D34;&#x51FA;&#x6765;&#x5360;&#x7BC7;&#x5E45;&#x4E86;&#x3002;</p>
<p>git flow<br>&#x524D;&#x6587;&#x63D0;&#x5230;&#x8FC7;git flow &#x7ED9;&#x56E2;&#x961F;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#xFF0C;idea&#x4E5F;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x63D2;&#x4EF6;&#x2014;&#x2014;git Flow Integration&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x6765;&#x89C4;&#x8303;&#x6211;&#x4EEC;&#x7684;&#x6D41;&#x7A0B;&#xFF1A;</p>
<p>gitflow&#x63D2;&#x4EF6;</p>
<p>&#x5F00;&#x53D1;&#x65B0;&#x529F;&#x80FD;&#x9009;&#x62E9; start Feature &#x62C9;&#x53D6;&#x5206;&#x652F;&#xFF0C;&#x4FEE;&#x590D;bug &#x9009;&#x62E9; Start Bugfix &#x62C9;&#x53D6;&#x5206;&#x652F;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x6B64;&#x5916;&#x8FD8;&#x6709; push on finish&#x7B49;&#x529F;&#x80FD;&#xFF0C;&#x5C0F;&#x4F19;&#x4F34;&#x5982;&#x679C;&#x611F;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x767E;&#x5EA6;&#x3002;</p>
<p>Git Commit Template<br>&#x8FD9;&#x4E2A;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x89C4;&#x8303;git commit &#x7684;&#x4E00;&#x4E2A;idea&#x63D2;&#x4EF6;&#x5C0F;&#x5DE5;&#x5177;&#x4E86;&#xFF0C;github&#x4E0A;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x5F00;&#x6E90;&#x63D2;&#x4EF6;&#x3002;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x63D2;&#x4EF6;&#xFF0C;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6210;&#x672C;&#x4E5F;&#x4E0D;&#x9AD8;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x7684;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x770B;&#x6CD5;&#x5C31;&#x804A;&#x5230;&#x8FD9;&#x4E86;&#xFF0C;&#x559C;&#x6B22;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x54E6;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/2f4c8440e0ed581b3e555f376edfd759.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-代码规范/" rel="tag"># 后端,代码规范</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7026191070924898335.html" rel="next" title="Docker从入门到干事，看这一篇就够了 前言 安装dock">
                <i class="fa fa-chevron-left"></i> Docker从入门到干事，看这一篇就够了 前言 安装dock
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7026265564179873805.html" rel="prev" title="Springboot + mybatis-plus + dy">
                Springboot + mybatis-plus + dy <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#代码混乱的常见问题"><span class="nav-number">1.</span> <span class="nav-text">代码混乱的常见问题</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#代码又臭又长"><span class="nav-number">1.1.</span> <span class="nav-text">代码又臭又长</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#代码逻辑不明所以"><span class="nav-number">1.2.</span> <span class="nav-text">代码逻辑不明所以</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#规划代码的核心思想"><span class="nav-number">1.3.</span> <span class="nav-text">规划代码的核心思想</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#花叶论"><span class="nav-number">1.4.</span> <span class="nav-text">花叶论</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#1）Converter（转换器）"><span class="nav-number">1.4.1.</span> <span class="nav-text">1）Converter（转换器）</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#2）manager-层"><span class="nav-number">1.4.2.</span> <span class="nav-text">2）manager 层</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#3）方法简单封装"><span class="nav-number">1.4.3.</span> <span class="nav-text">3）方法简单封装</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1）日志"><span class="nav-number">1.4.4.</span> <span class="nav-text">1）日志</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#2）注释"><span class="nav-number">1.4.5.</span> <span class="nav-text">2）注释</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#六大基本原则"><span class="nav-number">1.5.</span> <span class="nav-text">六大基本原则</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#代码提交及版本控制"><span class="nav-number">1.6.</span> <span class="nav-text">代码提交及版本控制</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#帮助代码规范的工具"><span class="nav-number">1.7.</span> <span class="nav-text">帮助代码规范的工具</span></a></li></ol></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
