<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="架构,后端,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x5F00;&amp;#x5934;&amp;#x5148;&amp;#x6765;&amp;#x4E2A;&amp;#x5C0F;&amp;#x6545;&amp;#x4E8B;&amp;#xFF1A;&amp;#x5F20;&amp;#x4E09;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x5728;&amp;#x91D1;&amp;#x4E5D;&amp;#x94F6;&amp;#x5341;&amp;#x7684;&amp;#x5B63;">
<meta name="keywords" content="架构,后端">
<meta property="og:type" content="article">
<meta property="og:title" content="为何项目做到最后都成为“屎山”，代码无法改动">
<meta property="og:url" content="https://dev.newban.cn/7026904237040746532.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x5F00;&amp;#x5934;&amp;#x5148;&amp;#x6765;&amp;#x4E2A;&amp;#x5C0F;&amp;#x6545;&amp;#x4E8B;&amp;#xFF1A;&amp;#x5F20;&amp;#x4E09;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x5728;&amp;#x91D1;&amp;#x4E5D;&amp;#x94F6;&amp;#x5341;&amp;#x7684;&amp;#x5B63;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/1fc9ea98aa1605b1cc3e8d84b375a9830e6fbf1cb3939a58324aad15cc387934">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/3f1cc046474b1100cc663deaadf8b1fcdee1b5480132d876bade188192e64897">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/661c20dc56f29e4e28c17a4da7efa65d0e809043507ac7dcfed109fc5e31905b">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/fec9ffdaab7e572829b5374057785f2cc7db2d25b22fec276ceca69fc30ef8b4">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/1573df8a47d8a779bd2324226c64ea33b4417cb2a7edd46dede1db54a0446af1">
<meta property="og:updated_time" content="2024-04-28T07:22:46.636Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="为何项目做到最后都成为“屎山”，代码无法改动">
<meta name="twitter:description" content="&amp;#x5F00;&amp;#x5934;&amp;#x5148;&amp;#x6765;&amp;#x4E2A;&amp;#x5C0F;&amp;#x6545;&amp;#x4E8B;&amp;#xFF1A;&amp;#x5F20;&amp;#x4E09;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x5728;&amp;#x91D1;&amp;#x4E5D;&amp;#x94F6;&amp;#x5341;&amp;#x7684;&amp;#x5B63;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/1fc9ea98aa1605b1cc3e8d84b375a9830e6fbf1cb3939a58324aad15cc387934">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7026904237040746532.html">





  <title>为何项目做到最后都成为“屎山”，代码无法改动 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">为何项目做到最后都成为“屎山”，代码无法改动</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-05T10:18:01+08:00">
                2021-11-05
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5F00;&#x5934;&#x5148;&#x6765;&#x4E2A;&#x5C0F;&#x6545;&#x4E8B;&#xFF1A;&#x5F20;&#x4E09;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x91D1;&#x4E5D;&#x94F6;&#x5341;&#x7684;&#x5B63;&#x8282;&#x53BB;&#x4E86;&#x4E00;&#x5BB6;&#x65B0;&#x516C;&#x53F8;&#x5C31;&#x804C;&#x3002;&#x65B0;&#x7684;&#x516C;&#x53F8;&#x770B;&#x8D77;&#x6765;&#x524D;&#x666F;&#x4E0D;&#x9519;&#xFF0C;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#x4E5F;&#x5C5E;&#x4E8E;&#x884C;&#x4E1A;&#x524D;&#x6CBF;&#xFF0C;&#x5F20;&#x4E09;&#x53D1;&#x8A93;&#x81EA;&#x5DF1;&#x8981;&#x5728;&#x6B64;&#x4E00;&#x5C55;&#x9E3F;&#x56FE;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7CBE;&#x6E5B;&#x7684;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x4E3A;&#x516C;&#x53F8;&#x7684;&#x4E0A;&#x5E02;&#x6DFB;&#x7816;&#x52A0;&#x74E6;&#x3002;</p>
<p>&#x5F20;&#x4E09;&#x5C31;&#x804C;&#x7684;&#x7B2C;&#x4E00;&#x5929;&#xFF0C;&#x516C;&#x53F8;&#x5C31;&#x5F00;&#x653E;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x4ED6;&#x719F;&#x6089;&#x8D77;&#x516C;&#x53F8;&#x7684;&#x6838;&#x5FC3;&#x9879;&#x76EE;&#x3002;&#x7ED3;&#x679C;&#x5374;&#x60CA;&#x5446;&#x4E86;&#xFF0C;&#x5F20;&#x4E09;&#x53D1;&#x73B0;&#x516C;&#x53F8;&#x7684;&#x9879;&#x76EE;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x573A;&#xFF0C;&#x5404;&#x79CD;&#x4EE3;&#x7801;&#x5806;&#x6210;&#x5C71;&#xFF0C;&#x800C;&#x4ED6;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x53BB;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x8001;&#x9879;&#x76EE;&#xFF0C;&#x5728;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x5F20;&#x4E09;&#x5185;&#x5FC3;&#x7684;&#x5E7B;&#x60F3;&#x77AC;&#x95F4;&#x7834;&#x706D;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x9879;&#x76EE;&#x4E4B;&#x540E;&#xFF0C;&#x4E8B;&#x60C5;&#x51FA;&#x73B0;&#x4E86;&#x8F6C;&#x673A;&#x3002;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x65B0;&#x9879;&#x76EE;&#x4E0B;&#x6765;&#xFF0C;&#x8001;&#x677F;&#x4EFB;&#x547D;&#x5F20;&#x4E09;&#x4E3A;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x4ED6;&#x5185;&#x5FC3;&#x72C2;&#x559C;&#xFF0C;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x8BA9;&#x4EE3;&#x7801;&#x663E;&#x5F97;&#x4F18;&#x96C5;&#xFF0C;&#x8DDF;&#x70C2;&#x4EE3;&#x7801;&#x8BF4;&#x518D;&#x89C1;&#x3002;&#x201D;</p>
<p>&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x5F20;&#x4E09;&#x7528;&#x4E86;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x75AF;&#x72C2;&#x62BD;&#x8C61;&#x4E1A;&#x52A1;&#xFF0C;&#x8D8A;&#x505A;&#x8D8A;&#x6709;&#x52B2;&#xFF0C;&#x611F;&#x89C9;&#x4E00;&#x8EAB;&#x7684;&#x624D;&#x5B66;&#x7EC8;&#x4E8E;&#x6709;&#x4E86;&#x5C55;&#x793A;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x4F46;&#x9879;&#x76EE;&#x662F;&#x591A;&#x4EBA;&#x5408;&#x4F5C;&#x7684;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x548C;&#x9879;&#x76EE;&#x7684;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#xFF0C;&#x5F88;&#x591A;&#x65B0;&#x4EBA;&#x4E0D;&#x518D;&#x6309;&#x7167;&#x9884;&#x5B9A;&#x7684;&#x89C4;&#x8303;&#x6765;&#x5F00;&#x53D1;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x5982;&#x96E8;&#x540E;&#x6625;&#x7B0B;&#x822C;&#x4E00;&#x4E2A;&#x4E2A;&#x5F80;&#x5916;&#x9762;&#x5192;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x4EE3;&#x7801;&#x91CC;&#x586B;&#x5145;&#x4E86;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;if&#x8BED;&#x53E5;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5F20;&#x4E09;&#x5F00;&#x59CB;&#x624B;&#x52A8;&#x5730;&#x9650;&#x5236;&#x90A3;&#x4E9B;&#x4E0D;&#x7B26;&#x5408;&#x89C4;&#x8303;&#x7684;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x3002;&#x53EF;&#x662F;&#x9879;&#x76EE;&#x65F6;&#x95F4;&#x7684;&#x538B;&#x529B;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5F20;&#x4E09;&#x6700;&#x7EC8;&#x8FEB;&#x4E8E;&#x4EA4;&#x4ED8;&#x538B;&#x529B;&#x53C8;&#x653E;&#x5F00;&#x4E86;&#x9650;&#x5236;&#x3002;&#x867D;&#x7136;&#x9879;&#x76EE;&#x987A;&#x5229;&#x7684;&#x4EA4;&#x4ED8;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x5947;&#x602A;&#x7684;&#x4EE3;&#x7801;&#x5374;&#x6C38;&#x4E45;&#x7684;&#x7559;&#x5728;&#x4E86;&#x9879;&#x76EE;&#x4E2D;&#x3002;</p>
<p>&#x6162;&#x6162;&#x7684;&#xFF0C;&#x539F;&#x59CB;&#x7CBE;&#x7F8E;&#x7684;&#x8BBE;&#x8BA1;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x81C3;&#x80BF;&#xFF0C;&#x903B;&#x8F91;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x65E0;&#x6BD4;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x6562;&#x53BB;&#x91CD;&#x6784;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x91CD;&#x6784;&#x4E86;&#x3002;&#x7EC8;&#x4E8E;&#xFF0C;&#x5F20;&#x4E09;&#x5B9E;&#x5728;&#x65E0;&#x6CD5;&#x5FCD;&#x53D7;&#xFF0C;&#x8F9E;&#x804C;&#x53BB;&#x4E86;&#x4E00;&#x5BB6;&#x65B0;&#x516C;&#x53F8;&#x5C31;&#x804C;&#xFF0C;&#x65B0;&#x7684;&#x516C;&#x53F8;&#x770B;&#x8D77;&#x6765;&#x524D;&#x666F;&#x4E0D;&#x9519;&#xFF0C;&#x505A;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x662F;&#x884C;&#x4E1A;&#x524D;&#x6CBF;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5F20;&#x4E09;&#x518D;&#x6B21;&#x53D1;&#x8A93;&#x81EA;&#x5DF1;&#x8981;&#x5728;&#x65B0;&#x516C;&#x53F8;&#x4E00;&#x5C55;&#x9E3F;&#x56FE;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7CBE;&#x6E5B;&#x7684;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x4E3A;&#x516C;&#x53F8;&#x7684;&#x4E0A;&#x5E02;&#x6DFB;&#x7816;&#x52A0;&#x74E6;&#x2026;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x6545;&#x4E8B;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x5185;&#x4E00;&#x904D;&#x4E00;&#x904D;&#x5730;&#x4E0A;&#x6F14;&#xFF0C;&#x4F3C;&#x4E4E;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6F14;&#x8FDB;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x8865;&#x4E01;&#x6253;&#x5230;&#x6700;&#x540E;&#x90FD;&#x4F1A;&#x53D8;&#x6210;&#x201C;&#x5C4E;&#x5C71;&#x578B;&#x201D;&#x9879;&#x76EE;&#xFF0C;&#x5145;&#x65A5;&#x7740;&#x5404;&#x79CD;&#x5386;&#x53F2;&#x9057;&#x7559;&#x95EE;&#x9898;&#xFF0C;&#x65B0;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x8D8A;&#x6765;&#x8D8A;&#x6162;&#xFF0C;&#x6700;&#x7EC8;&#x65E0;&#x6CD5;&#x6F14;&#x8FDB;&#x8D70;&#x5411;&#x9879;&#x76EE;&#x7684;&#x7EC8;&#x7ED3;&#x3002;&#x6709;&#x4E9B;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x4F1A;&#x4E3A;&#x5EF6;&#x957F;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x5728;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x8058;&#x8BF7;&#x8D44;&#x6DF1;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x719F;&#x8BFB;&#x300A;&#x91CD;&#x6784;&#x300B;&#xFF0C;&#x7528;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x53BB;&#x5EF6;&#x7F13;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><strong>&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#x662F;&#x5565;</strong></p>
<p><strong>&#x50CF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x4E00;&#x6837;&#xFF0C;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x4E5F;&#x662F;&#x6709;&#x67B6;&#x6784;&#x7684;&#x3002;</strong></p>
<p>&#x5728;&#x505A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x5374;&#x5728;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x95F4;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x8D70;&#x5411;&#x201C;&#x5C4E;&#x5C71;&#x578B;&#x201D;&#x9879;&#x76EE;&#x3002;&#x6309;&#x7167;&#x7814;&#x53D1;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x95EE;&#x9898;&#x7684;&#x6839;&#x6E90;&#x662F;&#x62BD;&#x8C61;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x4E0D;&#x884C;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x6765;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x8058;&#x8BF7;&#x4E86;&#x8D44;&#x6DF1;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#x540E;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x9879;&#x76EE;&#x4F3C;&#x4E4E;&#x53D8;&#x5F97;&#x597D;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x53EA;&#x662F;&#x5EF6;&#x7F13;&#x4E86;&#x800C;&#x5DF2;&#xFF0C;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x9636;&#x6BB5;&#x4E5F;&#x53EA;&#x80FD;&#x629B;&#x5F03;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x590D;&#x76D8;&#x540E;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x90FD;&#x5728;&#x89E3;&#x51B3;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5FFD;&#x7565;&#x4E86;&#x4EA7;&#x54C1;&#x5C42;&#x9762;&#x3002;&#x6309;&#x7167;&#x7F51;&#x4E0A;&#x7684;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#x5C31;&#x662F;&#x5728;&#x5145;&#x5206;&#x7406;&#x89E3;&#x4EA7;&#x54C1;&#x7528;&#x6237;&#x9700;&#x6C42;&#x57FA;&#x7840;&#x4E0A;&#x5BF9;&#x4EA7;&#x54C1;&#x6570;&#x636E;&#x6D41;&#x8F6C;&#x7684;&#x903B;&#x8F91;&#x68B3;&#x7406;&#x3002;</p>
<p>&#x800C;&#x6211;&#x5BF9;&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#x7684;&#x7406;&#x89E3;&#x662F;&#x4ECE;**&#x201C;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;**&#x5F00;&#x59CB;&#x7684;&#x3002;&#x7F16;&#x7A0B;&#x662F;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x63CF;&#x8FF0;&#x73B0;&#x5B9E;&#x4E8B;&#x7269;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x903B;&#x8F91;&#x3002;&#x5728;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x5728;&#x8111;&#x6D77;&#x4E2D;&#x6784;&#x601D;&#x51FA;&#x4E8B;&#x4EF6;&#x7684;&#x5168;&#x8C8C;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x903B;&#x8F91;&#x7684;&#x8BED;&#x8A00;&#x5C06;&#x5B83;&#x63CF;&#x8FF0;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5728;&#x897F;&#x65B9;&#x7684;&#x54F2;&#x5B66;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x5927;&#x6982;&#x610F;&#x601D;&#x662F;&#x4EBA;&#x4EEC;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x8111;&#x6D77;&#x4E2D;&#x9884;&#x5148;&#x6784;&#x5EFA;&#x51FA;&#x4E8B;&#x7269;&#x7684;&#x672C;&#x4F53;&#xFF0C;&#x518D;&#x5230;&#x73B0;&#x5B9E;&#x4E2D;&#x5BF9;&#x9884;&#x5148;&#x6784;&#x5EFA;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x6A21;&#x4EFF;&#x3002;&#x8FD9;&#x4E0E;&#x6211;&#x4EEC;&#x7F16;&#x7A0B;&#x7684;&#x8FC7;&#x7A0B;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x90A3;&#x4E48;&#x4EA7;&#x54C1;&#x662F;&#x5426;&#x4E5F;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1F;</p>
<p>&#x56DE;&#x60F3;&#x8D77;&#x4EE5;&#x524D;&#x505A;&#x9879;&#x76EE;&#x65F6;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x53D1;&#x73B0;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x591A;&#x6216;&#x5C11;&#x90FD;&#x9700;&#x8981;&#x5728;&#x8111;&#x6D77;&#x4E2D;&#x6784;&#x5EFA;&#x51FA;&#x4EA7;&#x54C1;&#x7684;&#x8FD0;&#x884C;&#x8F68;&#x8FF9;&#x3002;&#x4F46;&#x662F;&#x5728;&#x505A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F5C;&#x4E3A;&#x7814;&#x53D1;&#x7684;&#x6211;&#x4EEC;&#x90FD;&#x5728;&#x60F3;&#x5982;&#x4F55;&#x7528;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5374;&#x5FFD;&#x7565;&#x4E86;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EFB;&#x4F55;&#x4EA7;&#x54C1;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5BA2;&#x6237;&#x7684;&#x95EE;&#x9898;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x89E3;&#x51B3;&#x5BA2;&#x6237;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6839;&#x672C;&#xFF0C;&#x65E0;&#x8BBA;&#x7528;&#x4EC0;&#x4E48;&#x624B;&#x6BB5;&#x2026;&#x2026;</p>
<p><strong>&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x67B6;&#x6784;</strong></p>
<p>&#x5728;&#x8BBE;&#x8BA1;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x89E3;&#x51B3;&#x4EBA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x9002;&#x5408;&#x505A;&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#xFF1F;</p>
<p>&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#x5C31;&#x662F;&#x5728;<strong>&#x5145;&#x5206;&#x7406;&#x89E3;&#x4EA7;&#x54C1;&#x7528;&#x6237;&#x9700;&#x6C42;</strong>&#x57FA;&#x7840;&#x4E0A;&#x5BF9;&#x4EA7;&#x54C1;&#x6570;&#x636E;&#x6D41;&#x8F6C;&#x7684;<strong>&#x903B;&#x8F91;&#x68B3;&#x7406;</strong>&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4EBA;&#x9700;&#x8981;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x7D20;&#x8D28;&#xFF1A;</p>
<ul>
<li>&#x80FD;&#x591F;&#x8C03;&#x7814;&#x5E76;&#x7406;&#x89E3;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x80FD;&#x529B;</li>
<li>&#x80FD;&#x591F;&#x77E5;&#x9053;&#x4EA7;&#x54C1;&#x7684;&#x6838;&#x5FC3;&#x4EF7;&#x503C;</li>
<li>&#x80FD;&#x591F;&#x7406;&#x89E3;&#x4EA7;&#x54C1;&#x8FD0;&#x884C;&#x539F;&#x7406;</li>
<li>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x601D;&#x7EF4;</li>
</ul>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x7D20;&#x8D28;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x4E86;&#x3002;</p>
<p><strong>&#x6784;&#x5EFA;&#x7406;&#x5FF5;&#x4E16;&#x754C;</strong></p>
<p>&#x6784;&#x5EFA;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5C06;&#x73B0;&#x5B9E;&#x4E2D;&#x5C06;&#x8981;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x601D;&#x7EF4;&#x5C06;&#x4E8B;&#x60C5;&#x8F6C;&#x6362;&#x6210;&#x7EAF;&#x7CB9;&#x7684;&#x903B;&#x8F91;&#x63CF;&#x8FF0;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EB;<strong>&#x62BD;&#x8C61;</strong>&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x6D41;&#x91CF;&#x6CBB;&#x7406;&#x7C7B;&#x578B;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x62BD;&#x8C61;&#x8FC7;&#x7A0B;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x6D41;&#x91CF;&#x6CBB;&#x7406;&#x57FA;&#x672C;&#x5206;&#x4E3A;2&#x4E2A;&#x5927;&#x7684;&#x5185;&#x5BB9;&#xFF0C;<strong>&#x6D41;&#x91CF;&#x76D1;&#x63A7;&#x548C;&#x6D41;&#x91CF;&#x7BA1;&#x7406;</strong>&#xFF0C;&#x8FD9;&#x662F;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x800C;&#x4F20;&#x7EDF;&#x7684;&#x6D41;&#x91CF;&#x6CBB;&#x7406;&#x5DE5;&#x5177;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x91C7;&#x7528;SDK&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x4EEC;&#x666E;&#x904D;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x4FB5;&#x5165;&#x6027;&#x5F3A;</li>
<li>&#x6CBB;&#x7406;&#x529F;&#x80FD;&#x4E0D;&#x5168;</li>
<li>&#x5185;&#x5BB9;&#x591A;&#x3001;&#x95E8;&#x69DB;&#x9AD8;</li>
<li>&#x4E2D;&#x95F4;&#x4EF6;&#x6F14;&#x53D8;&#x56F0;&#x96BE;</li>
<li>&#x7248;&#x672C;&#x788E;&#x7247;&#x5316;&#x4E25;&#x91CD;</li>
<li>&#x5347;&#x7EA7;&#x6210;&#x672C;&#x9AD8;</li>
</ul>
<p>&#x5982;&#x679C;&#x80FD;&#x89E3;&#x51B3;&#x6B64;&#x7C7B;&#x578B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x4F1A;&#x4F7F;&#x5F97;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x5728;&#x6D41;&#x91CF;&#x6CBB;&#x7406;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E0A;&#x4F1A;&#x4F18;&#x4E8E;SDK&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x662F;&#x6BD4;&#x8F83;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#xFF1A;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x4EA7;&#x54C1;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5347;&#x7EA7;&#x4E14;&#x4FB5;&#x5165;&#x6027;&#x5F31;&#xFF0C;&#x52BF;&#x5FC5;&#x4E0D;&#x80FD;&#x4E0E;&#x5BA2;&#x6237;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x5F3A;&#x7ED1;&#x5B9A;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x4E0E;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#xFF0C;&#x53C8;&#x80FD;&#x591F;&#x505A;&#x5230;&#x6D41;&#x91CF;&#x76D1;&#x63A7;&#xFF0C;&#x6D41;&#x91CF;&#x7BA1;&#x7406;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x53EA;&#x80FD;&#x53BB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x9762;&#x627E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x80FD;&#x64CD;&#x7EB5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4F7F;&#x5F97;&#x6D41;&#x91CF;&#x5728;&#x8FDB;&#x5165;&#x670D;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x8FDB;&#x5165;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5C31;&#x505A;&#x5230;&#x4E86;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x3002;</p>
<p>&#x601D;&#x8DEF;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x6837;:&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDB;&#x6765;&#xFF0C;&#x5148;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8F6C;&#x53D1;&#x5230;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x5230;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x6700;&#x540E;&#x7A0B;&#x5E8F;&#x8F6C;&#x53D1;&#x5230;&#x771F;&#x6B63;&#x7684;&#x670D;&#x52A1;&#x4E2D;&#xFF0C;&#x6D41;&#x91CF;&#x76D1;&#x63A7;&#x5C31;&#x505A;&#x5B8C;&#x4E86;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E0A;&#x62A5;&#x6570;&#x636E;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5177;&#x5907;&#x6301;&#x4E45;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x5F53;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53EB;sidecar&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x7528;sidecar&#x79F0;&#x547C;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x597D;&#x4E86;&#xFF0C;&#x5B58;&#x50A8;&#x7684;&#x90A3;&#x4E2A;&#x5C31;&#x53EB;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/1fc9ea98aa1605b1cc3e8d84b375a9830e6fbf1cb3939a58324aad15cc387934" alt></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x63A8;&#x5BFC;&#x4E00;&#x4E0B;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x8981;&#x505A;&#x5230;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;sidecar&#xFF0C;&#x6BD5;&#x7ADF;&#x6D41;&#x91CF;&#x5DF2;&#x7ECF;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8F6C;&#x53D1;&#x5230;&#x4E86;sidecar&#x4E0A;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x8FC7;&#x5904;&#x7406;&#x4E4B;&#x540E;&#x518D;&#x8F6C;&#x53D1;&#x5230;&#x771F;&#x6B63;&#x7684;&#x670D;&#x52A1;&#x5F53;&#x4E2D;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53E6;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x6765;&#x544A;&#x8BC9;sidecar&#x8981;&#x600E;&#x4E48;&#x5BF9;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x6BD5;&#x7ADF;&#x6BCF;&#x4E2A;sidecar&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x7B56;&#x7565;&#x5185;&#x5BB9;&#x9700;&#x8981;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x4E0D;&#x7136;&#x627E;&#x4E0D;&#x5230;&#x4E0E;sidecar&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x53EB;&#x505A;&#x63A7;&#x5236;&#x7AEF;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6D41;&#x7A0B;&#x5927;&#x6982;&#x53D8;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x7AEF;&#x914D;&#x7F6E;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7B56;&#x7565;&#xFF0C;&#x63A7;&#x5236;&#x7AEF;&#x5C06;&#x7B56;&#x7565;&#x4E0B;&#x53D1;&#x5230;sidecar&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x6D41;&#x91CF;&#x8BF7;&#x6C42;&#x8FC7;&#x6765;&#xFF0C;&#x88AB;&#x64CD;&#x7EB5;&#x7CFB;&#x7EDF;&#x8F6C;&#x53D1;&#x5230;sidecar&#xFF0C;sidecar&#x5148;&#x4E0A;&#x62A5;&#x6D41;&#x91CF;&#x6570;&#x636E;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x6D41;&#x91CF;&#x7B56;&#x7565;&#x5BF9;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x771F;&#x6B63;&#x7684;&#x670D;&#x52A1;&#x4E2D;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/3f1cc046474b1100cc663deaadf8b1fcdee1b5480132d876bade188192e64897" alt></p>
<p>&#x5728;&#x5B8C;&#x5168;&#x7406;&#x60F3;&#x7684;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x4E86;&#x6D41;&#x91CF;&#x6CBB;&#x7406;&#x7684;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x76F8;&#x6BD4;SDK&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x5177;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#xFF0C;&#x7EAF;&#x7CB9;&#x7684;&#x903B;&#x8F91;&#x63CF;&#x8FF0;&#x3002;</p>
<p><strong>&#x9A8C;&#x8BC1;&#x7406;&#x5FF5;&#x4E16;&#x754C;</strong></p>
<p>&#x201C;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x662F;&#x5426;&#x6B63;&#x786E;&#x7684;&#x552F;&#x4E00;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x662F;&#x5B83;&#x662F;&#x5426;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#x63CF;&#x8FF0;&#x4E86;&#x73B0;&#x5B9E;&#xFF0C;&#x5C31;&#x50CF;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x601D;&#x7EF4;&#x91CC;&#x9762;&#x7684;&#x7C7B;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x62BD;&#x8C61;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x77E5;&#x9053;&#x62BD;&#x8C61;&#x7684;&#x597D;&#x4E0D;&#x597D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x968F;&#x4FBF;&#x627E;&#x51E0;&#x4E2A;&#x4EBA;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x903B;&#x8F91;&#x8BF4;&#x4E00;&#x904D;&#xFF0C;&#x5982;&#x679C;&#x8868;&#x8FF0;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x987A;&#x7545;&#x7684;&#xFF0C;&#x5BF9;&#x65B9;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x611F;&#x89C9;&#x5230;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x9057;&#x6F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x62BD;&#x8C61;&#x5C31;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x3002;</p>
<p>&#x5728;&#x505A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C3D;&#x91CF;&#x7684;&#x63CF;&#x8FF0;&#x7ED9;&#x4E0D;&#x540C;&#x5C97;&#x4F4D;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x8FB9;&#x52A0;&#x6DF1;&#x56E2;&#x961F;&#x6210;&#x5458;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x8868;&#x8FF0;&#x6765;&#x5B8C;&#x5584;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5B8C;&#x5584;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p><strong>&#x5982;&#x4F55;&#x843D;&#x5730;</strong></p>
<p>&#x5F53;&#x201D;&#x7406;&#x5FF5;&#x4E16;&#x754C;&#x201D;&#x88AB;&#x5EFA;&#x7ACB;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x6A21;&#x4EFF;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5B66;&#x5F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x8131;&#x79BB;&#x8BBE;&#x8BA1;&#xFF0C;&#x5230;&#x5B9E;&#x64CD;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x4E00;&#x822C;&#x9879;&#x76EE;&#x5206;2&#x7C7B;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x5B58;&#x91CF;&#x9879;&#x76EE;&#x3002;</p>
<p><strong>&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x7684;&#x9879;&#x76EE;</strong></p>
<p>&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x7684;&#x9879;&#x76EE;&#x5728;&#x52A8;&#x624B;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x9762;&#x4E34;2&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x54EA;&#x5F00;&#x59CB;&#xFF1F;&#x8981;&#x6A21;&#x4EFF;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF1F;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/661c20dc56f29e4e28c17a4da7efa65d0e809043507ac7dcfed109fc5e31905b" alt></p>
<p>&#x901A;&#x8FC7;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x5207;&#x7684;&#x57FA;&#x77F3;&#x3002;</p>
<p>1.&#x64CD;&#x7EB5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4F7F;&#x5F97;&#x6D41;&#x91CF;&#x5728;&#x8FDB;&#x5165;&#x670D;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x8FDB;&#x5165;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x7684;sidecar&#x4E2D;</p>
<p>2.sidecar</p>
<p>3.&#x6570;&#x636E;&#x5E93;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x5916;&#x90E8;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x5E72;&#x6270;&#x7684;&#x65F6;&#x5019;<strong>&#x6D41;&#x91CF;&#x76D1;&#x63A7;&#x529F;&#x80FD;</strong>&#x80AF;&#x5B9A;&#x8981;&#x4F18;&#x5148;&#x4E8E;<strong>&#x6D41;&#x91CF;&#x63A7;&#x5236;</strong>&#x529F;&#x80FD;&#x505A;&#xFF0C;&#x8FD9;&#x662F;&#x4ECE;&#x54EA;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x505A;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x4E3B;&#x8981;&#x4F9D;&#x6258;&#x4E8E;&#x65F6;&#x95F4;&#xFF0C;&#x4EBA;&#x5458;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x770B;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x628A;&#x63E1;&#x3002;&#x4F46;&#x65E0;&#x8BBA;&#x505A;&#x591A;&#x5C11;&#xFF0C;&#x53EA;&#x8981;&#x65B9;&#x5411;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x5BF9;&#x6574;&#x4E2A; &#x4EA7;&#x54C1;&#x7684;&#x8FED;&#x4EE3;&#x90FD;&#x662F;&#x5177;&#x6709;&#x6B63;&#x5411;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x670D;&#x52A1;&#x5212;&#x5206;&#x53D8;&#x5F97;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x5728;&#x4EA4;&#x7ED9;&#x7814;&#x53D1;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x8FB9;&#x754C;&#x4E5F;&#x6709;&#x660E;&#x786E;&#x7684;&#x89C4;&#x5B9A;&#x3002;&#x5C31;&#x7B97;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x51FA;&#x73B0;&#x65B0;&#x5165;&#x804C;&#x6216;&#x8005;&#x6C34;&#x5E73;&#x826F;&#x83A0;&#x4E0D;&#x9F50;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x5185;&#x6240;&#x80FD;&#x9020;&#x6210;&#x7684;&#x7834;&#x574F;&#x529B;&#x4E5F;&#x6709;&#x9650;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x6574;&#x4E2A;&#x4EA7;&#x54C1;&#x9020;&#x6210;&#x7ED3;&#x6784;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x672A;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5F3A;&#x7684;&#x7814;&#x53D1;&#x91CD;&#x65B0;&#x5199;&#x4E00;&#x904D;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x90FD;&#x89E3;&#x51B3;&#x4E86;&#x3002;</p>
<p><strong>&#x5B58;&#x91CF;&#x9879;&#x76EE;</strong></p>
<p>&#x5B58;&#x91CF;&#x9879;&#x76EE;&#x7684;&#x843D;&#x5730;&#x5C31;&#x5341;&#x5206;&#x7684;&#x590D;&#x6742;&#xFF0C;&#x5386;&#x53F2;&#x9057;&#x7559;&#x5BB3;&#x4EBA;&#x4E0D;&#x6D45;&#x2026;&#x2026;</p>
<p>&#x5927;&#x7684;&#x601D;&#x8DEF;&#x5E94;&#x8BE5;&#x662F;&#x5148;&#x7528;&#x201D;&#x62BD;&#x8C61;&#x201D;&#x6620;&#x7167;&#x73B0;&#x5B9E;&#xFF0C;&#x770B;&#x770B;&#x5230;&#x5E95;&#x73B0;&#x5728;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x5B8C;&#x5168;&#x7B26;&#x5408;&#x201D;&#x62BD;&#x8C61;&#x201D;&#x7684;&#x201D;&#x6D41;&#x7A0B;&#x201D;&#xFF0C;&#x5148;&#x641E;&#x6E05;&#x695A;&#x73B0;&#x72B6;&#x518D;&#x60F3;&#x529E;&#x6CD5;&#x4FEE;&#x679D;&#x526A;&#x53F6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x65B0;&#x7684;&#x9700;&#x6C42;&#x5230;&#x6765;&#x65F6;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x5148;&#x62BD;&#x8C61;&#xFF0C;&#x4EFB;&#x4F55;&#x6B63;&#x5F53;&#x7684;&#x9700;&#x6C42;&#x90FD;&#x662F;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x4E0D;&#x7B26;&#x5408;&#x903B;&#x8F91;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x9700;&#x6C42;&#x6316;&#x6398;&#x7684;&#x4E0D;&#x591F;&#xFF0C;&#x4E0D;&#x80FD;&#x76F2;&#x76EE;&#x7684;&#x52A0;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5BF9;sidecar&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x90A3;&#x6D41;&#x7A0B;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x8FD9;&#x6837;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/fec9ffdaab7e572829b5374057785f2cc7db2d25b22fec276ceca69fc30ef8b4" alt></p>
<p>&#x4F46;&#x662F;&#x76D1;&#x63A7;&#x5355;&#x72EC;&#x62CE;&#x51FA;&#x6765;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#xFF1F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x8BDD;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x53D8;&#x6210;&#x8FD9;&#x6837;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/1573df8a47d8a779bd2324226c64ea33b4417cb2a7edd46dede1db54a0446af1" alt></p>
<p>&#x8FD9;2&#x79CD;&#x5F62;&#x6001;&#x6CA1;&#x6709;&#x4F18;&#x52A3;&#x4E4B;&#x5206;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x505A;&#x9009;&#x62E9;&#x3002;</p>
<p><strong>&#x603B;&#x7ED3;</strong></p>
<p>&#x5982;&#x679C;&#x6709;&#x4E86;&#x89E3;&#x5230;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x9886;&#x57DF;&#x7684;&#x670B;&#x53CB;&#x5E94;&#x8BE5;&#x5F88;&#x65E9;&#x5C31;&#x53D1;&#x73B0;&#xFF0C;&#x4E0A;&#x8BC9;&#x8BF4;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F31;&#x9E21;&#x7248;Istio&#x7684;&#x8BDE;&#x751F;&#x3002;</p>
<p>&#x6211;&#x5C1D;&#x8BD5;&#x7740;&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;&#xFF0C;&#x7EAF;&#x7CB9;&#x7684;&#x903B;&#x8F91;&#x63A8;&#x5BFC;Istio&#x7684;&#x67B6;&#x6784;&#x3002;&#x5F88;&#x591A;&#x6709;&#x540D;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E3A;&#x4EC0;&#x4E48;&#x5386;&#x7ECF;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x53CD;&#x800C;&#x8D8A;&#x6765;&#x8D8A;&#x7CBE;&#x70BC;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x4E00;&#x5B9A;&#x6709;&#x503C;&#x5F97;&#x63A2;&#x8BA8;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x672C;&#x6587;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6838;&#x5FC3;&#x8FD8;&#x5F97;&#x770B;&#x4EBA;&#xFF0C;&#x4E00;&#x7FA4;&#x5927;&#x4F6C;&#xFF0C;&#x65E0;&#x8BBA;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x7CBE;&#x7F8E;&#x800C;&#x4F18;&#x96C5;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/f7a2d4c25b99f5b1b5309c7d2a3536a9.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/架构-后端/" rel="tag"># 架构,后端</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7026866523981479949.html" rel="next" title="还在用new Date计算任务执行时间？强烈建议使用这个AP">
                <i class="fa fa-chevron-left"></i> 还在用new Date计算任务执行时间？强烈建议使用这个AP
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7026922999571808269.html" rel="prev" title="深入理解JVM">
                深入理解JVM <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
