<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="Redis,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x53C2;&amp;#x4E0E;11&amp;#x6708;&amp;#x66F4;&amp;#x6587;&amp;#x6311;&amp;#x6218;&amp;#x7684;&amp;#x7B2C;6&amp;#x5929;&amp;#xFF0C;&amp;#x6D3B;&amp;#x52A8;&amp;#x8BE6;&amp;#x60C5;&amp;#x67E5;&amp;#x770B;&amp;#xFF1A;2021&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;">
<meta name="keywords" content="Redis">
<meta property="og:type" content="article">
<meta property="og:title" content="Redis常见的问题：缓存雪崩、缓存击穿、缓存穿透难题 （六">
<meta property="og:url" content="https://dev.newban.cn/7027440894378770439.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x53C2;&amp;#x4E0E;11&amp;#x6708;&amp;#x66F4;&amp;#x6587;&amp;#x6311;&amp;#x6218;&amp;#x7684;&amp;#x7B2C;6&amp;#x5929;&amp;#xFF0C;&amp;#x6D3B;&amp;#x52A8;&amp;#x8BE6;&amp;#x60C5;&amp;#x67E5;&amp;#x770B;&amp;#xFF1A;2021&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/0aed6dcd47e9a61b65d8e3c1fbf31b4a966c295c8d0f65f6617d5ce9bfbad6d4">
<meta property="og:updated_time" content="2024-04-28T10:05:32.967Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Redis常见的问题：缓存雪崩、缓存击穿、缓存穿透难题 （六">
<meta name="twitter:description" content="&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x53C2;&amp;#x4E0E;11&amp;#x6708;&amp;#x66F4;&amp;#x6587;&amp;#x6311;&amp;#x6218;&amp;#x7684;&amp;#x7B2C;6&amp;#x5929;&amp;#xFF0C;&amp;#x6D3B;&amp;#x52A8;&amp;#x8BE6;&amp;#x60C5;&amp;#x67E5;&amp;#x770B;&amp;#xFF1A;2021&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/0aed6dcd47e9a61b65d8e3c1fbf31b4a966c295c8d0f65f6617d5ce9bfbad6d4">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7027440894378770439.html">





  <title>Redis常见的问题：缓存雪崩、缓存击穿、缓存穿透难题 （六 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">Redis常见的问题：缓存雪崩、缓存击穿、缓存穿透难题 （六</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-06T21:06:52+08:00">
                2021-11-06
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;6&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a></p>
<p>Redis &#x7F13;&#x5B58;&#x5F02;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x6709;&#x7F13;&#x5B58;&#x96EA;&#x5D29;&#x3001;&#x7F13;&#x5B58;&#x51FB;&#x7A7F;&#x3001;&#x7F13;&#x5B58;&#x7A7F;&#x900F;&#x3002;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x4E00;&#x65E6;&#x53D1;&#x751F;&#xFF0C;&#x8BF7;&#x6C42;&#x91CF;&#x5C31;&#x4F1A;&#x5806;&#x79EF;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x3002;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x7684;&#x5E76;&#x53D1;&#x91CF;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x5B95;&#x673A;&#x6216;&#x662F;&#x6545;&#x969C;&#x3002;</p>
<h2 id="&#x7F13;&#x5B58;&#x96EA;&#x5D29;"><a href="#&#x7F13;&#x5B58;&#x96EA;&#x5D29;" class="headerlink" title="&#x7F13;&#x5B58;&#x96EA;&#x5D29;"></a>&#x7F13;&#x5B58;&#x96EA;&#x5D29;</h2><p>&#x7F13;&#x5B58;&#x96EA;&#x5D29;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5E94;&#x7528;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x5728;Redis&#x7F13;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#xFF0C;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x4F1A;&#x53D1;&#x9001;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5C42;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x7684;&#x538B;&#x529B;&#x6FC0;&#x589E;&#x3002;</p>
<p>&#x5F15;&#x53D1;&#x96EA;&#x5D29;&#x7684;&#x539F;&#x56E0;&#x6709;&#x4E24;&#x4E2A;&#x3002;</p>
<p>&#x4E00;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x7F13;&#x5B58;&#x4E2D;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7F13;&#x5B58;&#x540C;&#x65F6;&#x8FC7;&#x671F;&#x5931;&#x6548;&#xFF0C;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x5904;&#x7406;&#xFF1B;</p>
<p>&#x8FD8;&#x6709;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;Redis&#x7F13;&#x5B58;&#x5B9E;&#x4F8B;&#x53D1;&#x751F;&#x6545;&#x969C;&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x7F13;&#x5B58;&#x540C;&#x65F6;&#x5931;&#x6548;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x4E00;&#x662F;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x7ED9;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x8BBE;&#x7F6E;&#x76F8;&#x540C;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x4E1A;&#x52A1;&#x5C42;&#x4E0A;&#x6709;&#x8981;&#x6C42;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x540C;&#x65F6;&#x5931;&#x6548;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8BBE;&#x7F6E;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x65F6;&#xFF0C;&#x7ED9;&#x8FD9;&#x4E2A;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x52A0;&#x4E0A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x4F8B;&#x5982;&#x968F;&#x673A;&#x4E2A;1-3&#x5206;&#x949F;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x540C;&#x65F6;&#x8FC7;&#x671F;&#x5931;&#x6548;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4FDD;&#x8BC1;&#x4E86;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5728;&#x76F8;&#x8FD1;&#x7684;&#x65F6;&#x95F4;&#x5931;&#x6548;&#xFF0C;&#x4ECD;&#x7136;&#x6EE1;&#x8DB3;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x4E8C;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x964D;&#x7EA7;&#x53BB;&#x5E94;&#x5BF9;&#x7F13;&#x5B58;&#x96EA;&#x5D29;&#x3002;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#x3002;</p>
<ul>
<li>&#x9488;&#x5BF9;&#x975E;&#x6838;&#x5FC3;&#x6570;&#x636E;&#xFF0C;&#x6682;&#x505C;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x9884;&#x5B9A;&#x4E49;&#x3001;&#x7A7A;&#x503C;&#x6216;&#x662F;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF1B;</li>
<li>&#x9488;&#x5BF9;&#x6838;&#x5FC3;&#x6570;&#x636E;&#xFF0C;&#x4ECD;&#x7136;&#x8D70;&#x7F13;&#x5B58;&#xFF0C;&#x7F13;&#x5B58;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x7EE7;&#x7EED;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x662F;&#x56E0;&#x4E3A;&#x5B9E;&#x4F8B;&#x53D1;&#x751F;&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4F9D;&#x9760;Redis&#x7F13;&#x5B58;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;&#x53D1;&#x73B0;&#x8282;&#x70B9;&#x5B95;&#x673A;&#xFF0C;&#x5C06;&#x8BE5;&#x8282;&#x70B9;&#x5207;&#x6362;&#x4E3A;&#x5176;&#x5B83;&#x8282;&#x70B9;&#x3002;</p>
<h2 id="&#x7F13;&#x5B58;&#x51FB;&#x7A7F;"><a href="#&#x7F13;&#x5B58;&#x51FB;&#x7A7F;" class="headerlink" title="&#x7F13;&#x5B58;&#x51FB;&#x7A7F;"></a>&#x7F13;&#x5B58;&#x51FB;&#x7A7F;</h2><p>&#x7F13;&#x5B58;&#x51FB;&#x7A7F;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x9488;&#x5BF9;&#x67D0;&#x4E2A;&#x8BBF;&#x95EE;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x7684;&#x70ED;&#x70B9;&#x6570;&#x636E;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8BBF;&#x95EE;&#x8BE5;&#x6570;&#x636E;&#x7684;&#x8BF7;&#x6C42;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x7ED9;&#x6570;&#x636E;&#x5E93;&#x5C42;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x538B;&#x529B;&#x6FC0;&#x589E;&#xFF0C;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x7F13;&#x5B58;&#x51FB;&#x7A7F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#x5728;&#x70ED;&#x70B9;&#x6570;&#x636E;&#x8FC7;&#x671F;&#x5931;&#x6548;&#x65F6;&#x3002;</p>
<p><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;</strong>&#x662F;&#xFF0C;&#x9488;&#x5BF9;&#x70ED;&#x70B9;&#x6570;&#x636E;&#x4E0D;&#x8BBE;&#x7F6E;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x70ED;&#x70B9;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x4E86;&#x3002;</p>
<h2 id="&#x7F13;&#x5B58;&#x7A7F;&#x900F;"><a href="#&#x7F13;&#x5B58;&#x7A7F;&#x900F;" class="headerlink" title="&#x7F13;&#x5B58;&#x7A7F;&#x900F;"></a>&#x7F13;&#x5B58;&#x7A7F;&#x900F;</h2><p>&#x7F13;&#x5B58;&#x7A7F;&#x900F;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x8BBF;&#x95EE;&#x7684;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x65E2;&#x4E0D;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x4E5F;&#x4E0D;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BF7;&#x6C42;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x8BBF;&#x95EE;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x3002;&#x5982;&#x679C;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8BE5;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#x8FDB;&#x6765;&#xFF0C;&#x7F13;&#x5B58;&#x5C31;&#x6210;&#x4E86;&#x6446;&#x8BBE;&#xFF0C;&#x8BF7;&#x6C42;&#x76F4;&#x63A5;&#x5230;&#x4E86;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5176;&#x5B83;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x53D1;&#x751F;&#x7F13;&#x5B58;&#x7A7F;&#x900F;&#x7684;&#x573A;&#x666F;&#x662F;&#xFF0C;</p>
<ul>
<li>&#x6076;&#x610F;&#x653B;&#x51FB;&#xFF0C;&#x4E13;&#x95E8;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x6570;&#x636E;&#xFF1B;</li>
<li>&#x4E1A;&#x52A1;&#x8BF7;&#x6C42;&#x7684;&#x8BEF;&#x64CD;&#x4F5C;&#xFF0C;&#x7F13;&#x5B58;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x8BEF;&#x5220;&#x9664;&#x4E86;&#xFF0C;&#x5BFC;&#x81F4;&#x90FD;&#x6CA1;&#x6709;&#x6570;&#x636E;&#xFF1B;</li>
<li>&#x65B0;&#x4E1A;&#x52A1;&#x4E0A;&#x7EBF;&#x65F6;&#xFF0C;&#x7F13;&#x5B58;&#x548C;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x6CA1;&#x6709;&#x7528;&#x6237;&#x7684;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#xFF1B;</li>
</ul>
<p>&#x9488;&#x5BF9;&#x7F13;&#x5B58;&#x7A7F;&#x900F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF1A;</p>
<ul>
<li><strong>&#x7F13;&#x5B58;&#x7A7A;&#x503C;&#x6216;&#x7F3A;&#x7701;&#x503C;</strong>&#x3002;&#x5F53;&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5728;&#x7F13;&#x5B58;&#x548C;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x4E00;&#x4E2A;&#x7A7A;&#x503C;&#x6216;&#x7F3A;&#x7701;&#x503C;&#xFF0C;&#x9632;&#x6B62;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5230;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x3002;&#x5F53;&#x540E;&#x7EED;&#x65B0;&#x589E;&#x4E86;&#x8BE5;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x9700;&#x8981;&#x5C06;&#x8BE5;&#x7A7A;&#x503C;&#x7F13;&#x5B58;&#x7ED9;&#x79FB;&#x9664;&#x6389;&#x3002;</li>
<li><strong>&#x4F7F;&#x7528;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;</strong>&#x3002;&#x5229;&#x7528;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x7279;&#x70B9;&#x53EF;&#x4EE5;&#x6821;&#x9A8C;&#x6570;&#x636E;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF0C;&#x6BCF;&#x65B0;&#x589E;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5728;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x505A;&#x4E2A;&#x6807;&#x8BB0;&#x3002;&#x8FD9;&#x6837;&#x5F53;&#x7F13;&#x5B58;&#x7F3A;&#x5931;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5148;&#x901A;&#x8FC7;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x8BE5;&#x6570;&#x636E;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x53BB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BBF;&#x95EE;&#x4E86;&#x3002;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Redis</code>&#x5B9E;&#x73B0;&#x3002;</li>
<li><strong>&#x524D;&#x7AEF;&#x62E6;&#x622A;&#x6076;&#x610F;&#x8BF7;&#x6C42;</strong>&#x3002;&#x5F53;&#x6709;&#x6076;&#x610F;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5728;&#x524D;&#x7AEF;&#x9488;&#x5BF9;&#x8BF7;&#x6C42;&#x7684;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x5408;&#x6CD5;&#x6027;&#x68C0;&#x6D4B;&#xFF0C;&#x8FC7;&#x6EE4;&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x4E0D;&#x5408;&#x7406;&#x3001;&#x53C2;&#x6570;&#x975E;&#x6CD5;&#x503C;&#x3001;&#x5B57;&#x6BB5;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x6076;&#x610F;&#x8BF7;&#x6C42;&#x3002;&#x4E0D;&#x8BA9;&#x5B83;&#x4EEC;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7F13;&#x5B58;&#x7A7F;&#x900F;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/0aed6dcd47e9a61b65d8e3c1fbf31b4a966c295c8d0f65f6617d5ce9bfbad6d4" alt> </p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/761ae716b3bf85c3009907fe2dcac976.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/Redis/" rel="tag"># Redis</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7027393621322104839.html" rel="next" title="懒人必备代码生成器 添加依赖 测试代码">
                <i class="fa fa-chevron-left"></i> 懒人必备代码生成器 添加依赖 测试代码
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7027449531054702606.html" rel="prev" title="Spring配置数据源 1 数据源（连接池）的作用 2">
                Spring配置数据源 1 数据源（连接池）的作用 2 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#缓存雪崩"><span class="nav-number">1.</span> <span class="nav-text">缓存雪崩</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#缓存击穿"><span class="nav-number">2.</span> <span class="nav-text">缓存击穿</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#缓存穿透"><span class="nav-number">3.</span> <span class="nav-text">缓存穿透</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
