<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="云原生,数据库,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x7B80;&amp;#x4ECB;&amp;#xFF1A;&amp;#x4ECE;&amp;#x6C7D;&amp;#x8F66;&amp;#x884C;&amp;#x4E1A;&amp;#x7684;&amp;#x53D8;&amp;#x5316;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5373;&amp;#x53EF;&amp;#x521D;&amp;#x6B65;&amp;#x770B;&amp;#x51FA;&amp;#x82AF;&amp;#x7247;&amp;#x7684;&amp;#x91CD;&amp;#x8981;">
<meta name="keywords" content="云原生,数据库">
<meta property="og:type" content="article">
<meta property="og:title" content="新能源汽车太猛了，这些卡脖子技术你了解吗？">
<meta property="og:url" content="https://dev.newban.cn/7036268749346832415.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x7B80;&amp;#x4ECB;&amp;#xFF1A;&amp;#x4ECE;&amp;#x6C7D;&amp;#x8F66;&amp;#x884C;&amp;#x4E1A;&amp;#x7684;&amp;#x53D8;&amp;#x5316;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5373;&amp;#x53EF;&amp;#x521D;&amp;#x6B65;&amp;#x770B;&amp;#x51FA;&amp;#x82AF;&amp;#x7247;&amp;#x7684;&amp;#x91CD;&amp;#x8981;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/46b82fcdaae67739b166d850d842ebbeedf3454413978de43ce466da90f71092">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/d73235d7b09155403ab9a6ead8287dcdcb3e6a31abdce0c0ab34fd4baf3472f0">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/84395b63b751460ae37c771701f74a009a8832e4127ca8594cedf46cb646beff">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/329fda2f909ae69cf153be17c462e98663850ba31cdfcfdb13cb2a19ab1dfb85">
<meta property="og:updated_time" content="2024-04-28T07:23:00.216Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="新能源汽车太猛了，这些卡脖子技术你了解吗？">
<meta name="twitter:description" content="&amp;#x7B80;&amp;#x4ECB;&amp;#xFF1A;&amp;#x4ECE;&amp;#x6C7D;&amp;#x8F66;&amp;#x884C;&amp;#x4E1A;&amp;#x7684;&amp;#x53D8;&amp;#x5316;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5373;&amp;#x53EF;&amp;#x521D;&amp;#x6B65;&amp;#x770B;&amp;#x51FA;&amp;#x82AF;&amp;#x7247;&amp;#x7684;&amp;#x91CD;&amp;#x8981;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/46b82fcdaae67739b166d850d842ebbeedf3454413978de43ce466da90f71092">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7036268749346832415.html">





  <title>新能源汽车太猛了，这些卡脖子技术你了解吗？ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">新能源汽车太猛了，这些卡脖子技术你了解吗？</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-30T15:57:20+08:00">
                2021-11-30
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x7B80;&#x4ECB;&#xFF1A;&#x4ECE;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x5373;&#x53EF;&#x521D;&#x6B65;&#x770B;&#x51FA;&#x82AF;&#x7247;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x82AF;&#x7247;&#x5BF9;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x5177;&#x4F53;&#x6709;&#x54EA;&#x4E9B;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x5462;&#xFF1F;</p>
<p>&#x6839;&#x636E;&#x5168;&#x7403;&#x6C7D;&#x8F66;&#x54A8;&#x8BE2;&#x673A;&#x6784;Auto Forecast Solutions&#x7EDF;&#x8BA1;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x622A;&#x81F3;10&#x6708;10&#x65E5;&#xFF0C;&#x7531;&#x4E8E;&#x82AF;&#x7247;&#x77ED;&#x7F3A;&#xFF0C;&#x5168;&#x7403;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x5DF2;&#x7D2F;&#x8BA1;&#x51CF;&#x4EA7;934.5&#x4E07;&#x8F86;&#xFF0C;&#x6BD4;&#x524D;&#x4E00;&#x5468;&#x589E;&#x52A0;&#x4E86;&#x7EA6;25&#x4E07;&#x8F86;&#xFF0C;&#x5176;&#x4E2D;&#x4E2D;&#x56FD;&#x5E02;&#x573A;&#x51CF;&#x4EA7;1.3&#x4E07;&#x8F86;&#x6C7D;&#x8F66;&#xFF0C;&#x7EA6;&#x5360;5.2%&#x5DE6;&#x53F3;&#x3002;&#x4ECE;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x82AF;&#x7247;&#x4F5C;&#x4E3A;&#x6C7D;&#x8F66;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF0C;&#x5E02;&#x573A;&#x7684;&#x4F9B;&#x5E94;&#x4E0D;&#x8DB3;&#x5DF2;&#x7ECF;&#x5F71;&#x54CD;&#x5230;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x9500;&#x91CF;&#x3002;</p>
<p>&#x4ECE;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x5373;&#x53EF;&#x521D;&#x6B65;&#x770B;&#x51FA;&#x82AF;&#x7247;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x82AF;&#x7247;&#x5BF9;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x5177;&#x4F53;&#x6709;&#x54EA;&#x4E9B;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x76F8;&#x6BD4;&#x6D88;&#x8D39;&#x7535;&#x5B50;&#x7C7B;&#x82AF;&#x7247;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x5BFF;&#x547D;&#x3001;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x53CA;&#x89C4;&#x683C;&#x6807;&#x51C6;&#x65B9;&#x9762;&#x5BF9;&#x6C7D;&#x8F66;&#x82AF;&#x7247;&#x53C8;&#x66F4;&#x9AD8;&#x8981;&#x6C42;&#x3002;&#x82AF;&#x7247;&#x7684;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x65F6;&#x95F4;&#x957F;&#xFF0C;&#x96BE;&#x5EA6;&#x5927;&#xFF0C;&#x4E14;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x6700;&#x4E25;&#x82DB;&#x7684;&#x884C;&#x4E1A;&#x81EA;&#x77E5;&#x8BA4;&#x8BC1;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/46b82fcdaae67739b166d850d842ebbeedf3454413978de43ce466da90f71092" alt></p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x6C7D;&#x8F66;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E3B;&#x8981;&#x5E94;&#x7528;&#x7684;&#x662F;&#x8F66;&#x89C4;&#x7EA7;&#x82AF;&#x7247;&#x5C06;&#x82AF;&#x7247;&#x6309;&#x529F;&#x80FD;&#x5212;&#x5206;&#xFF0C;&#x8F66;&#x89C4;&#x7EA7;&#x82AF;&#x7247;&#x53EF;&#x5206;&#x4E3A;&#x529F;&#x80FD;&#x578B;&#x82AF;&#x7247;&#x3001;&#x529F;&#x7387;&#x534A;&#x5BFC;&#x4F53;&#x548C;&#x4F20;&#x611F;&#x5668;&#x82AF;&#x7247;&#x4E09;&#x5927;&#x7C7B;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x529F;&#x7387;&#x534A;&#x5BFC;&#x4F53;&#x5305;&#x62EC;IGBT&#x3001;&#x573A;&#x6548;&#x5E94;&#x6676;&#x4F53;&#x7BA1;&#xFF08;MOSFET&#xFF09;&#x548C;&#x7535;&#x6E90;&#x7BA1;&#x7406;&#x82AF;&#x7247;&#xFF0C;&#x5728;&#x6C7D;&#x6CB9;&#x8F66;&#x4E2D;&#x5360;&#x6BD4;&#x7EA6;40%&#x5DE6;&#x53F3;&#xFF0C;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x4E2D;&#x5360;&#x6BD4;&#x4E3A;50%&#xFF0C;&#x662F;&#x76EE;&#x524D;&#x6700;&#x7D27;&#x7F3A;&#x540C;&#x65F6;&#x6700;&#x5177;&#x589E;&#x957F;&#x6F5C;&#x529B;&#x7684;&#x82AF;&#x7247;&#x3002;&#x5176;&#x4E2D;&#xFF0C;IGBT&#x4F5C;&#x4E3A;&#x65B0;&#x80FD;&#x6E90;&#x8F66;&#x4E3B;&#x5BFC;&#x578B;&#x529F;&#x7387;&#x5668;&#x4EF6;&#xFF0C;&#x88AB;&#x8A89;&#x4E3A;&#x662F;&#x7535;&#x529B;&#x7535;&#x5B50;&#x884C;&#x4E1A;&#x7684;CPU&#xFF0C;&#x7EA6;&#x5360;&#x6574;&#x8F66;&#x6210;&#x672C;&#x7684;7%-10%&#xFF0C;&#x4EC5;&#x6B21;&#x4E8E;&#x9502;&#x7535;&#x6C60;&#xFF0C;&#x80FD;&#x591F;&#x6839;&#x636E;&#x4FE1;&#x53F7;&#x6307;&#x4EE4;&#x6765;&#x8C03;&#x8282;&#x7535;&#x8DEF;&#x7684;&#x7535;&#x538B;&#x3001;&#x7535;&#x6D41;&#x3001;&#x9891;&#x7387;&#x548C;&#x76F8;&#x4F4D;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x7CBE;&#x51C6;&#x8C03;&#x63A7;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x7406;&#x89E3;&#x4E3A;IGBT&#x662F;&#x7535;&#x529B;&#x7535;&#x5B50;&#x884C;&#x4E1A;&#x7406;&#x60F3;&#x7684;&#x5F00;&#x5173;&#x5668;&#x4EF6;&#x3002;</p>
<p>&#x5BF9;&#x65B0;&#x80FD;&#x6E90;&#x8F66;&#x6765;&#x8BF4;&#xFF0C;IGBT&#x4F18;&#x5F02;&#x7684;&#x5F00;&#x5173;&#x7279;&#x6027;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EA4;&#x76F4;&#x6D41;&#x8F6C;&#x6362;&#x3001;&#x7535;&#x538B;&#x8F6C;&#x6362;&#x548C;&#x9891;&#x7387;&#x8F6C;&#x6362;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF0C;&#x5F53;&#x7535;&#x52A8;&#x8F66;&#x5145;&#x7535;&#x65F6;&#xFF0C;&#x901A;&#x8FC7; IGBT&#x5C06;&#x5916;&#x90E8;&#x7535;&#x6E90;&#x8F6C;&#x53D8;&#x6210;&#x76F4;&#x6D41;&#x7535;&#xFF0C;&#x5728;&#x7535;&#x52A8;&#x8F66;&#x5239;&#x8F66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x8FC7; IGBT &#x628A;&#x76F4;&#x6D41;&#x7535;&#x8F6C;&#x53D8;&#x6210;&#x4EA4;&#x6D41;&#x7535;&#x673A;&#x4F7F;&#x7528;&#x7684;&#x4EA4;&#x6D41;&#x7535;&#xFF0C;&#x540C;&#x65F6;&#x7CBE;&#x786E;&#x8C03;&#x6574;&#x7535;&#x538B;&#x548C;&#x9891;&#x7387;&#xFF0C;&#x9A71;&#x52A8;&#x7535;&#x52A8;&#x8F66;&#x884C;&#x9A76;&#x3002;&#x4E00;&#x53F0;&#x7535;&#x8F66;&#x7684;&#x52A0;&#x901F;&#x80FD;&#x529B;&#x3001;&#x6700;&#x9AD8;&#x65F6;&#x901F;&#x3001;&#x80FD;&#x6E90;&#x6548;&#x7387;&#x4E3B;&#x8981;&#x770B;&#x8F66;&#x89C4;&#x7EA7;&#x529F;&#x7387;&#x5668;&#x4EF6;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;IGBT&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x7535;&#x63A7;&#x3001;&#x8F66;&#x8F7D;&#x7A7A;&#x8C03;&#x3001;&#x5145;&#x7535;&#x6869;&#x9006;&#x53D8;&#x5668;&#x4E09;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x5F53;&#x4E2D;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/d73235d7b09155403ab9a6ead8287dcdcb3e6a31abdce0c0ab34fd4baf3472f0" alt></p>
<p>&#x667A;&#x80FD;&#x5316;&#x53D1;&#x5C55;&#x8FC5;&#x901F;&#xFF0C;&#x82AF;&#x7247;&#x662F;&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;&#xFF0C;&#x53EF;&#x8C13;&#x638C;&#x63E1;&#x7CBE;&#x6DF1;&#x7684;&#x82AF;&#x7247;&#x6280;&#x672F;&#x5C31;&#x662F;&#x638C;&#x63E1;&#x79D1;&#x6280;&#x9886;&#x57DF;&#x7684;&#x8BDD;&#x8BED;&#x6743;&#x3002;&#x6545;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5728;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#xFF0C;&#x4EFB;&#x4F55;&#x667A;&#x80FD;&#x5316;&#x8BBE;&#x5907;&#xFF08;&#x4F8B;&#x5982;&#x667A;&#x80FD;&#x624B;&#x673A;&#x3001;&#x667A;&#x80FD;&#x5BB6;&#x5177;&#x3001;&#x667A;&#x80FD;&#x5B89;&#x9632;&#x7B49;&#xFF09;&#x90FD;&#x79BB;&#x4E0D;&#x5F00;&#x82AF;&#x7247;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x82AF;&#x7247;&#x5F00;&#x53D1;&#x4E5F;&#x6210;&#x4E3A;&#x4EBA;&#x4EEC;&#x65E5;&#x76CA;&#x5173;&#x5FC3;&#x7684;&#x7126;&#x70B9;&#x8BDD;&#x9898;&#x3002;&#x5728;&#x4ECA;&#x5E74;&#x7684;&#x4E91;&#x6816;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#x81EA;&#x7814;&#x4E91;&#x82AF;&#x7247;&#x501A;&#x5929;710&#xFF0C;&#x8FD9;&#x662F;&#x963F;&#x91CC;&#x4E91;&#x63A8;&#x8FDB;&#x201C;&#x4E00;&#x4E91;&#x591A;&#x82AF;&#x201D;&#x7B56;&#x7565;&#x7684;&#x91CD;&#x8981;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x963F;&#x91CC;&#x7B2C;&#x4E00;&#x9897;&#x4E3A;&#x4E91;&#x800C;&#x751F;&#x7684;CPU&#x82AF;&#x7247;&#xFF0C;&#x5C06;&#x5728;&#x963F;&#x91CC;&#x4E91;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x3002;&#x7531;&#x6B64;&#x770B;&#x6765;&#xFF0C;&#x82AF;&#x7247;&#x5F00;&#x53D1;&#x7684;&#x672A;&#x6765;&#x66F4;&#x52A0;&#x503C;&#x5F97;&#x671F;&#x5F85;&#xFF01;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/84395b63b751460ae37c771701f74a009a8832e4127ca8594cedf46cb646beff" alt></p>
<p>&#x5173;&#x952E;&#x6280;&#x672F;&#x7684;&#x8FDB;&#x6B65;&#x662F;&#x65E0;&#x6570;&#x4F01;&#x4E1A;&#x65E0;&#x9650;&#x8FFD;&#x6C42;&#x7684;&#x661F;&#x8FB0;&#x5927;&#x6D77;&#x3002;</p>
<p>&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x79BB;&#x4E0D;&#x5F00;&#x5E95;&#x5C42;&#x5173;&#x952E;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5982;&#x4F55;&#x4F7F;&#x5173;&#x952E;&#x6280;&#x672F;&#x5177;&#x6709;&#x66F4;&#x4F18;&#x6027;&#x80FD;&#x662F;&#x79D1;&#x6280;&#x4F01;&#x4E1A;&#x65E0;&#x9650;&#x8FFD;&#x6C42;&#x7684;&#x65B9;&#x5411;&#x3002;SaaS&#x7CFB;&#x7EDF;&#xFF08;&#x8F6F;&#x4EF6;&#x53CA;&#x670D;&#x52A1;&#xFF09;&#x4F5C;&#x4E3A;&#x65B0;&#x65F6;&#x4EE3;&#x4E92;&#x8054;&#x7F51;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x548C;&#x5E94;&#x7528;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#xFF0C;&#x662F;21&#x4E16;&#x7EAA;&#x5F00;&#x59CB;&#x5174;&#x8D77;&#x7684;&#x4E00;&#x79CD;&#x5B8C;&#x5168;&#x521B;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x3002;&#x5176;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x4EA4;&#x4ED8;&#x65B9;&#x5F0F;&#xFF0C;&#x4F7F;&#x5F97;&#x8F6F;&#x4EF6;&#x8FDB;&#x4E00;&#x6B65;&#x56DE;&#x5F52;&#x670D;&#x52A1;&#x672C;&#x8D28;&#x3002;SaaS&#x6539;&#x53D8;&#x4E86;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x670D;&#x52A1;&#x7684;&#x63D0;&#x4F9B;&#x65B9;&#x5F0F;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x672C;&#x5730;&#x90E8;&#x7F72;&#x6240;&#x9700;&#x7684;&#x5927;&#x91CF;&#x524D;&#x671F;&#x6295;&#x5165;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x7A81;&#x51FA;&#x4FE1;&#x606F;&#x5316;&#x8F6F;&#x4EF6;&#x7684;&#x670D;&#x52A1;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x7F51;&#x7AD9;&#x8003;&#x9A8C;&#x7684;&#x662F;&#x5176;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#x53CA;&#x5FEB;&#x901F;&#x6027;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x57FA;&#x7840;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x5E95;&#x5C42;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x3010;&#x963F;&#x91CC;&#x4E91;&#x5EFA;&#x7AD9;&#x3011;&#x662F;&#x57FA;&#x4E8E;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x6807;&#x51C6;&#x5316;&#x5728;&#x7EBF;&#x4EA4;&#x4ED8;SaaS&#x7CFB;&#x7EDF;&#xFF0C;&#x96C6;&#x6210;&#x963F;&#x91CC;&#x4E91;&#x5168;&#x5957;&#x4E91;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x6807;&#x914D;&#x963F;&#x91CC;&#x4E91;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x65E0;&#x9700;&#x989D;&#x5916;&#x4ED8;&#x8D39;&#x5373;&#x53EF;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x963F;&#x91CC;&#x4E91;&#x670D;&#x52A1;&#xFF1B;&#x63D0;&#x4F9B;&#x963F;&#x91CC;&#x4E91;&#x81EA;&#x7814;&#x7684;&#x4E91;&#x76FE;&#x5B89;&#x5168;&#x670D;&#x52A1;&#xFF0C;&#x6700;&#x5927;&#x5316;&#x7684;&#x5BF9;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x9632;&#x62A4;&#xFF0C;&#x6709;&#x6548;&#x62B5;&#x5FA1;&#x6076;&#x610F;&#x653B;&#x51FB;&#xFF0C;&#x786E;&#x4FDD;&#x7F51;&#x7AD9;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF1B;&#x6807;&#x914D;&#x5168;&#x7403;CDN&#x7F51;&#x7EDC;&#x52A0;&#x901F;&#x670D;&#x52A1;&#xFF0C;&#x786E;&#x4FDD;&#x7F51;&#x7AD9;&#x5FEB;&#x901F;&#x6253;&#x5F00;&#x3002;&#x5168;&#x65B9;&#x4F4D;&#x4FDD;&#x969C;&#x4E86;&#x5BA2;&#x6237;&#x5EFA;&#x7F51;&#x7AD9;&#x7684;&#x5FEB;&#x901F;&#x3001;&#x7A33;&#x5B9A;&#x3001;&#x5B89;&#x5168;&#x9700;&#x6C42;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p5/raw/master/img/329fda2f909ae69cf153be17c462e98663850ba31cdfcfdb13cb2a19ab1dfb85" alt></p>
<p><a href="/external_links/57713de9f14668acc5d0fa84169855ca.html" target="blank" rel="noopener">&#x539F;&#x6587;&#x94FE;&#x63A5;</a></p>
<p>&#x672C;&#x6587;&#x4E3A;&#x963F;&#x91CC;&#x4E91;&#x539F;&#x521B;&#x5185;&#x5BB9;&#xFF0C;&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/ce256012ff59ba1ad916653dca2343cf.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/云原生-数据库/" rel="tag"># 云原生,数据库</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7036265613035044877.html" rel="next" title="从双十一的物流大战，看全球通信网络的低延迟优化">
                <i class="fa fa-chevron-left"></i> 从双十一的物流大战，看全球通信网络的低延迟优化
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7036269712610689060.html" rel="prev" title="创新模式驱动生产力提升，融云社交场景化 SDK 探索">
                创新模式驱动生产力提升，融云社交场景化 SDK 探索 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
