<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,Java,程序员,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x770B;&amp;#x5230;&amp;#x4E0D;&amp;#x5C11;&amp;#x79C1;&amp;#x4FE1;&amp;#x95EE;&amp;#x6211;&amp;#x4E3A;&amp;#x5565;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E00;&amp;#x56DE;&amp;#x590D;">
<meta name="keywords" content="后端,Java,程序员">
<meta property="og:type" content="article">
<meta property="og:title" content="30岁之前透支，30岁之后还债。">
<meta property="og:url" content="https://dev.newban.cn/7300564263344128051.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x770B;&amp;#x5230;&amp;#x4E0D;&amp;#x5C11;&amp;#x79C1;&amp;#x4FE1;&amp;#x95EE;&amp;#x6211;&amp;#x4E3A;&amp;#x5565;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E00;&amp;#x56DE;&amp;#x590D;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/ec47cdce7f86af561c3d435f822ce5e703878d64dbc57539a14effbc13ed0c78">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/7a46e5d1e24228896906c7230081fdb94dc5afefba2c8f9a9fca9586d97bc49d">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3564e3bfc3201c03e4c268c19ff69efc5ac3e5e830a4e373501f98f047c079f8">
<meta property="og:updated_time" content="2024-04-27T06:25:44.457Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="30岁之前透支，30岁之后还债。">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x770B;&amp;#x5230;&amp;#x4E0D;&amp;#x5C11;&amp;#x79C1;&amp;#x4FE1;&amp;#x95EE;&amp;#x6211;&amp;#x4E3A;&amp;#x5565;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E00;&amp;#x56DE;&amp;#x590D;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/ec47cdce7f86af561c3d435f822ce5e703878d64dbc57539a14effbc13ed0c78">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7300564263344128051.html">





  <title>30岁之前透支，30岁之后还债。 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">30岁之前透支，30岁之后还债。</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2023-11-13T09:32:29+08:00">
                2023-11-13
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x770B;&#x5230;&#x4E0D;&#x5C11;&#x79C1;&#x4FE1;&#x95EE;&#x6211;&#x4E3A;&#x5565;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x4E00;&#x4E00;&#x56DE;&#x590D;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x8EAB;&#x4F53;&#x62B1;&#x6059;&#xFF0C;&#x5FC3;&#x60C5;&#x6C89;&#x91CD;&#xFF0C;&#x52A0;&#x4E0A;&#x5E94;&#x4ED8;&#x4E8E;&#x5DE5;&#x4F5C;&#xFF0C;&#x5468;&#x65CB;&#x4E8E;&#x5BB6;&#x5EAD;&#xFF0C;&#x81EA;&#x7136;&#x6324;&#x538B;&#x4E86;&#x81EA;&#x6211;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x601D;&#x6765;&#x60F3;&#x53BB;&#xFF0C;&#x91CD;&#x65B0;&#x6267;&#x952E;&#xFF0C;&#x51B3;&#x5B9A;&#x4E45;&#x8FDD;&#x5730;&#x53C8;&#x4E00;&#x6B21;&#x5199;&#x70B9;&#x5206;&#x4EAB;&#xFF0C;&#x5949;&#x529D;&#x5927;&#x5BB6;&#x73CD;&#x60DC;&#x8EAB;&#x4F53;&#xFF0C;&#x6109;&#x60A6;&#x751F;&#x6D3B;&#x3002;</p>
<p>&#x6109;&#x60A6;&#x4E8C;&#x5B57;&#x8BF4;&#x6765;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5404;&#x4F4D;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x5954;&#x6CE2;&#x4E8E;&#x73B0;&#x5B9E;&#xFF0C;&#x52B3;&#x7D2F;&#x4E8E;&#x751F;&#x6D3B;&#xFF0C;&#x5C82;&#x662F;&#x4E09;&#x8A00;&#x4E24;&#x8BED;&#x5C31;&#x80FD;&#x6539;&#x53D8;&#x7684;&#x3002;</p>
<h3 id="&#x75C5;&#x6765;&#x5982;&#x5C71;&#x5012;"><a href="#&#x75C5;&#x6765;&#x5982;&#x5C71;&#x5012;" class="headerlink" title="&#x75C5;&#x6765;&#x5982;&#x5C71;&#x5012;"></a>&#x75C5;&#x6765;&#x5982;&#x5C71;&#x5012;</h3><p>&#x6211;&#x53C8;&#x75C5;&#x4E86;&#xFF0C;&#x6709;&#x4E9B;&#x610F;&#x5916;&#x548C;&#x7A81;&#x7136;&#x7684;&#xFF0C;&#x4EE4;&#x6211;&#x63AA;&#x624B;&#x4E0D;&#x53CA;&#x3002;</p>
<p>&#x4E00;&#x5929;&#x65E9;&#x4E0A;&#x6211;&#x8D77;&#x6765;&#xFF0C;&#x8116;&#x5B50;&#x6709;&#x4E9B;&#x9178;&#xFF0C;&#x5C31;&#x4F38;&#x624B;&#x63C9;&#x63C9;&#x634F;&#x634F;&#xFF0C;&#x5FFD;&#x7136;&#x53D1;&#x73B0;&#x8116;&#x9888;&#x5DE6;&#x4FA7;&#x6709;&#x4E00;&#x4E2A;&#x80BF;&#x5757;&#xFF0C;&#x4ED4;&#x7EC6;&#x62FF;&#x634F;&#xFF0C;&#x53D1;&#x73B0;&#x7ADF;&#x7136;&#x662F;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x800C;&#x4E14;&#x786C;&#x90A6;&#x90A6;&#x7684;&#xFF0C;&#x4F34;&#x6709;&#x8F7B;&#x5FAE;&#x7684;&#x75BC;&#x75DB;&#x611F;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#x65E9;&#x4E0A;&#x5BF9;&#x7740;&#x955C;&#x5B50;&#x62CD;&#x4E0B;&#x6765;&#x7684;&#x80BF;&#x5757;&#xFF0C;&#x6211;&#x8FD8;&#x4FDD;&#x7559;&#x4E86;&#x7167;&#x7247;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/ec47cdce7f86af561c3d435f822ce5e703878d64dbc57539a14effbc13ed0c78" alt="1.jpg"></p>
<p>&#x7ACB;&#x9A6C;&#x4FBF;&#x4E00;&#x8EAB;&#x51B7;&#x6C57;&#x5192;&#x51FA;&#xFF0C;&#x6211;&#x4ECE;&#x672A;&#x7ECF;&#x5386;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53BB;&#x5E74;&#x8EAB;&#x4F53;&#x6BD5;&#x7ADF;&#x51FA;&#x8FC7;&#x95EE;&#x9898;&#xFF0C;&#x4E24;&#x76F8;&#x53E0;&#x52A0;&#x4E4B;&#x4E0B;&#xFF0C;&#x5185;&#x5FC3;&#x66F4;&#x662F;&#x96BE;&#x4EE5;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x662F;&#x5468;&#x4E00;&#xFF0C;&#x6000;&#x7740;&#x5FD0;&#x5FD1;&#x7684;&#x5FC3;&#x60C5;&#x53BB;&#x4E0A;&#x73ED;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4E00;&#x76F4;&#x90FD;&#x6709;&#x4E9B;&#x795E;&#x7ECF;&#x516E;&#x516E;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8EAB;&#x4F53;&#x51FA;&#x4E86;&#x5927;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x6211;&#x6709;&#x6587;&#x7AE0;&#x8BB2;&#x8FC7;&#x81EA;&#x5DF1;&#x53BB;&#x5E74;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x68C0;&#x67E5;&#x51FA;&#x8840;&#x8102;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x505C;&#x66F4;&#x534A;&#x5E74;&#x4E4B;&#x4E45;&#xFF0C;&#x8C03;&#x517B;&#x4E86;&#x4E00;&#x756A;&#xFF0C;&#x624D;&#x771F;&#x6B63;&#x611F;&#x89C9;&#x5230;&#x8EAB;&#x4F53;&#x6709;&#x6240;&#x6062;&#x590D;&#xFF0C;&#x6839;&#x636E;&#x6211;&#x53D1;&#x6587;&#x7684;&#x65E5;&#x671F;&#x53EF;&#x89C1;&#x4E00;&#x4E8C;&#x3002;</p>
<p>&#x6062;&#x590D;&#x66F4;&#x65B0;&#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x62A5;&#x590D;&#x5F0F;&#x5730;&#x5199;&#x4F5C;&#x548C;&#x5206;&#x4EAB;&#xFF0C;&#x4E00;&#x5EA6;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5730;&#x6392;&#x5230;&#x699C;&#x5355;&#x7B2C;&#x4E8C;&#xFF0C;&#x4ECA;&#x5929;&#x767B;&#x5F55;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x5728;&#x6708;&#x699C;&#x524D;&#x4E09;&#x6CA1;&#x4E0B;&#x6765;&#xFF0C;&#x4E5F;&#x662F;&#x610F;&#x5916;&#x3002;</p>
<p>&#x8BDD;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x4EBA;&#x4E00;&#x65E6;&#x8EAB;&#x4F53;&#x5192;&#x51FA;&#x70B9;&#x75C5;&#x75DB;&#xFF0C;&#x6574;&#x4E2A;&#x5FC3;&#x60C5;&#x90FD;&#x663E;&#x5F97;&#x4F4E;&#x6C89;&#x840E;&#x9761;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x80FD;&#x5728;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x53CD;&#x5E94;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x6211;&#x662F;&#x786C;&#x7740;&#x5934;&#x76AE;&#x4E0A;&#x73ED;&#x7684;&#xFF0C;&#x62BD;&#x7A7A;&#x7F51;&#x4E0A;&#x67E5;&#x4E86;&#x4E0B;&#x597D;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x4E2A;&#x5FC3;&#x7406;&#x51C6;&#x5907;&#x3002;</p>
<blockquote>
<p>&#x767E;&#x5EA6;&#x4E00;&#x641C;&#x4FBF;&#x662F;&#x7EDD;&#x75C7;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x591A;&#x5E74;&#x524D;&#x5C31;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x4F46;&#x75C5;&#x6025;&#x4E71;&#x6295;&#x533B;&#x679C;&#x7136;&#x662F;&#x4EBA;&#x4E4B;&#x672C;&#x6027;&#xFF0C;&#x6211;&#x6BC5;&#x7136;&#x51B3;&#x7136;&#x8FD8;&#x662F;&#x641C;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x5404;&#x79CD;&#x7532;&#x72B6;&#x817A;&#x4E4B;&#x7C7B;&#x7684;&#x5C31;&#x6765;&#x4E86;&#xFF0C;&#x518D;&#x641C;&#xFF0C;&#x6DCB;&#x5DF4;&#x7624;&#x4E5F;&#x6765;&#x4E86;&#xFF0C;&#x518D;&#x641C;&#xFF0C;&#x597D;&#x5BB6;&#x4F19;&#xFF0C;&#x76F4;&#x63A5;&#x6076;&#x6027;&#x80BF;&#x7624;&#x5341;&#x6709;&#x516B;&#x4E5D;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x9762;&#x5BF9;&#x672A;&#x77E5;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x63A5;&#x8FD1;&#x7EDD;&#x671B;&#x7684;&#x5FC3;&#x60C5;&#xFF0C;&#x60F3;&#x5FC5;&#x4E0D;&#x5C11;&#x4EBA;&#x6709;&#x7C7B;&#x4F3C;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x6211;&#xFF0C;&#x4E0B;&#x610F;&#x8BC6;&#x5148;&#x60F3;&#x5230;&#x7684;&#x7ADF;&#x7136;&#x4E0D;&#x662F;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x5B8C;&#x86CB;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x60F3;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x5BB6;&#x4E2D;&#x72EC;&#x5B50;&#xFF0C;&#x7236;&#x6BCD;&#x5E74;&#x8FC8;&#x8EAB;&#x4F53;&#x6709;&#x6059;&#xFF0C;&#x59BB;&#x5B50;&#x64CD;&#x52B3;&#xFF0C;&#x5B69;&#x5B50;&#x5C1A;&#x5C0F;&#xFF0C;&#x5BB6;&#x4E2D;&#x4E3B;&#x8981;&#x7ECF;&#x6D4E;&#x6765;&#x6E90;&#x4E5F;&#x662F;&#x6211;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x65E6;&#x5012;&#x4E0B;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x6562;&#x60F3;&#xFF0C;&#x5F80;&#x6DF1;&#x4E86;&#x4E00;&#x60F3;&#x5404;&#x79CD;&#x8D1F;&#x9762;&#x56E0;&#x5B50;&#x90FD;&#x8702;&#x62E5;&#x800C;&#x6765;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x548C;&#x6211;&#x7684;&#x6027;&#x683C;&#x76F8;&#x4F3C;&#xFF0C;&#x5C31;&#x662F;&#x8EAB;&#x4F53;&#x51FA;&#x4E86;&#x8FD9;&#x79CD;&#x672A;&#x77E5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x9762;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x53BB;&#x533B;&#x9662;&#x770B;&#x770B;&#xFF0C;&#x4E00;&#x9762;&#x53C8;&#x6015;&#x6298;&#x817E;&#x6765;&#x53BB;&#x6700;&#x540E;&#x62FF;&#x5230;&#x6700;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x53CD;&#x800C;&#x80FD;&#x6D3B;&#x4E45;&#x4E00;&#x70B9;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x5FC3;&#x60C5;&#x4E86;&#x3002;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x6211;&#x5927;&#x4F53;&#x662F;&#x4E2A;&#x80C6;&#x5B50;&#x8FD8;&#x7B97;&#x5927;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x731B;&#x7136;&#x95F4;&#x6297;&#x62D2;&#x53BB;&#x533B;&#x9662;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x53BB;&#x533B;&#x9662;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x610F;&#x8FD9;&#x4E2A;&#x80BF;&#x5757;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x6478;&#x6478;&#x5B83;&#x662F;&#x4E0D;&#x662F;&#x53D8;&#x5C0F;&#x4E86;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x5C0F;&#x5FC3;&#x5475;&#x62A4;&#x7740;&#x5B83;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x60F3;&#x5BF9;&#x5B83;&#x8BF4;&#x8BF4;&#x8BDD;&#x503E;&#x8BC9;&#x4E00;&#x4E0B;&#xFF0C;&#x50CF;&#x662F;&#x81EA;&#x5DF1;&#x5077;&#x517B;&#x7684;&#x5C0F;&#x60C5;&#x4EBA;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x53EA;&#x76FC;&#x7740;&#x67D0;&#x5929;&#x7761;&#x89C9;&#x9192;&#x6765;&#xFF0C;&#x7528;&#x624B;&#x4E00;&#x6478;&#xFF0C;&#x54C8;&#x54C8;&#x6CA1;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x6211;&#x5C31;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x4E00;&#x4E2A;&#x6708;&#x90FD;&#x8FD9;&#x6837;&#x60F6;&#x60F6;&#x4E0D;&#x53EF;&#x7EC8;&#x65E5;&#x5730;&#x5EA6;&#x8FC7;&#xFF0C;&#x76F4;&#x5230;&#x8FD9;&#x5468;&#x516D;&#x624D;&#x88AB;&#x59BB;&#x5B50;&#x8D76;&#x53BB;&#x533B;&#x9662;&#x505A;&#x4E86;&#x68C0;&#x67E5;&#x3002;</p>
<h3 id="&#x900F;&#x652F;&#x548C;&#x8FD8;&#x503A;"><a href="#&#x900F;&#x652F;&#x548C;&#x8FD8;&#x503A;" class="headerlink" title="&#x900F;&#x652F;&#x548C;&#x8FD8;&#x503A;"></a>&#x900F;&#x652F;&#x548C;&#x8FD8;&#x503A;</h3><blockquote>
<p>30&#x5C81;&#x4E4B;&#x524D;&#x900F;&#x652F;&#xFF0C;30&#x5C81;&#x4E4B;&#x540E;&#x8FD8;&#x503A;&#x3002;</p>
</blockquote>
<p>&#x8BF4;&#x6765;&#x597D;&#x7B11;&#xFF0C;&#x6478;&#x5230;&#x80BF;&#x5757;&#x7684;&#x7B2C;&#x4E8C;&#x5929;&#x5427;&#xFF0C;&#x8FD8;&#x6709;&#x670B;&#x53CB;&#x79C1;&#x4FE1;&#x627E;&#x6211;&#x5408;&#x4F5C;&#xFF0C;&#x6362;&#x505A;&#x5E73;&#x65F6;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x6B23;&#x7136;&#x63A5;&#x53D7;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x6587;&#x7A3F;&#x3002;</p>
<p>&#x4F46;&#x8EAB;&#x4F53;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x7D22;&#x7136;&#x65E0;&#x5473;&#x4E86;&#xFF0C;&#x518D;&#x6B21;&#x771F;&#x5207;&#x5730;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x79CD;&#x88AB;&#x73B0;&#x5B9E;&#x6253;&#x788E;&#x4E00;&#x5207;&#x6B32;&#x671B;&#x7684;&#x6495;&#x88C2;&#x611F;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/7a46e5d1e24228896906c7230081fdb94dc5afefba2c8f9a9fca9586d97bc49d" alt="2.png"></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;30&#x5C81;&#x4E4B;&#x540E;&#x8EAB;&#x4F53;&#x6162;&#x6162;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E24;&#x5E74;&#x6211;&#x6709;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x601D;&#x8003;&#x8FC7;&#x3002;</p>
<p>&#x5230;&#x5E95;&#x8FD8;&#x662F;30&#x5C81;&#x4E4B;&#x524D;&#x900F;&#x652F;&#x592A;&#x591A;&#x4E86;&#xFF0C;30&#x5C81;&#x4E4B;&#x540E;&#x4F60;&#x4F9D;&#x7136;&#x517B;&#x6210;30&#x5C81;&#x4E4B;&#x524D;&#x7684;&#x751F;&#x6D3B;&#x4E60;&#x60EF;&#xFF0C;&#x65E0;&#x5F02;&#x4E8E;&#x81EA;&#x6740;&#x884C;&#x4E3A;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x628A;&#x8EAB;&#x4F53;&#x6BD4;&#x4F5C;&#x4E00;&#x6839;&#x6A61;&#x76AE;&#x7B4B;&#xFF0C;&#x5B83;&#x5927;&#x6982;&#x53EA;&#x80FD;&#x626F;&#x90A3;&#x4E48;&#x957F;&#xFF0C;&#x6211;&#x957F;&#x671F;&#x5C06;&#x5B83;&#x626F;&#x90A3;&#x4E48;&#x90A3;&#x4E48;&#x957F;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x5B83;&#x6CA1;&#x4E8B;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x6B21;&#x6211;&#x5C06;&#x5B83;&#x626F;&#x90A3;&#x4E48;&#x90A3;&#x4E48;&#x90A3;&#x4E48;&#x957F;&#xFF0C;&#x7830;&#x7684;&#x4E00;&#x58F0;&#x5B83;&#x5C31;&#x65AD;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x90FD;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x7684;&#x8FD9;&#x6839;&#x6A61;&#x76AE;&#x7B4B;&#x5230;&#x5E95;&#x80FD;&#x626F;&#x591A;&#x957F;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x6CA1;&#x65AD;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x89C9;&#x5F97;&#x5B83;&#x8FD8;&#x80FD;&#x626F;&#x5F88;&#x957F;&#xFF0C;&#x4EE3;&#x4EF7;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x9700;&#x65AD;&#x4E00;&#x6B21;&#xFF0C;&#x4F60;&#x518D;&#x4E5F;&#x65E0;&#x6CD5;&#x91CD;&#x6765;&#x4E86;&#x3002;</p>
</blockquote>
<p>30&#x5C81;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x52AA;&#x529B;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#xFF0C;&#x71AC;&#x591C;&#x90A3;&#x662F;&#x5BB6;&#x5E38;&#x4FBF;&#x996D;&#xFF0C;&#x7761;&#x4E00;&#x89C9;&#x4FBF;&#x751F;&#x9F99;&#x6D3B;&#x864E;&#x3002;</p>
<p>&#x6211;&#x5C31;&#x50CF;&#x4EE5;&#x524D;&#x4E0A;&#x5B66;&#x7684;&#x4E09;&#x597D;&#x5B66;&#x751F;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x5B66;&#x6821;&#x6211;&#x624E;&#x624E;&#x5B9E;&#x5B9E;&#xFF0C;&#x653E;&#x5B66;&#x4E86;&#x6211;&#x8FD8;&#x8FDB;&#x8865;&#x4E60;&#x73ED;&#xFF0C;&#x8865;&#x4E60;&#x73ED;&#x56DE;&#x6765;&#x4E86;&#x6211;&#x8FD8;&#x4E0A;&#x7F51;&#x5B66;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x56DE;&#x5934;&#x60F3;&#x60F3;&#xFF0C;&#x771F;&#x7279;&#x4E48;&#x79BB;&#x8C31;&#x554A;&#xFF0C;&#x6211;&#x4E0A;&#x5B66;&#x90FD;&#x6CA1;&#x8FD9;&#x6837;&#xFF0C;&#x8D70;&#x4E0A;&#x793E;&#x4F1A;&#x4E86;&#x7ADF;&#x7136;&#x4ED8;&#x51FA;&#x4E86;&#x4E4B;&#x524D;&#x5728;&#x5B66;&#x6821;&#x51E0;&#x500D;&#x7684;&#x52AA;&#x529B;&#x3002;</p>
<p>&#x65E9;&#x77E5;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x597D;&#x597D;&#x4E0A;&#x5B66;&#x8BFB;&#x4E66;&#x6700;&#x540E;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x66F4;&#x4F18;&#x8D28;&#x7684;&#x5708;&#x5B50;&#xFF0C;&#x4E0D;&#x5C31;&#x5C11;&#x8D70;&#x5F88;&#x591A;&#x5F2F;&#x8DEF;&#x4E86;&#x5417;&#xFF0C;&#x4F46;&#x662F;&#x8C01;&#x53C8;&#x4F1A;&#x542C;&#x5F53;&#x5E74;&#x7684;&#x8001;&#x5E08;&#x548C;&#x7236;&#x6BCD;&#x4E00;&#x756A;&#x80BA;&#x8151;&#x4E4B;&#x8A00;&#x5462;&#x3002;</p>
<p>&#x57CB;&#x6028;&#x8FC7;&#x53BB;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF0C;&#x53EA;&#x80FD;&#x5076;&#x5C14;&#x501F;&#x7740;&#x90FD;&#x5E02;&#x5C0F;&#x8BF4;&#x5E7B;&#x60F3;&#x4E00;&#x4E0B;&#x5E26;&#x7740;&#x8BB0;&#x5FC6;&#x91CD;&#x751F;&#x56DE;&#x6821;&#x56ED;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x7EC6;&#x6570;&#x4E0B;&#x6765;&#xFF0C;&#x6211;30&#x5C81;&#x4E4B;&#x524D;&#x71AC;&#x8FC7;&#x7684;&#x591C;&#x6BD4;&#x6211;&#x52A0;&#x7684;&#x73ED;&#x8FD8;&#x591A;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5929;&#x5929;&#x52A0;&#x73ED;&#xFF0C;&#x4F46;&#x597D;&#x50CF;&#x771F;&#x7684;&#x5929;&#x5929;&#x71AC;&#x591C;&#x3002;</p>
<p>&#x53EF;&#x6211;&#x8EAB;&#x4F53;&#x4E00;&#x70B9;&#x95EE;&#x9898;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4E0D;&#x662F;&#x90A3;&#x79CD;&#x88AB;&#x547D;&#x8FD0;&#x629B;&#x5F03;&#x7684;&#x4EBA;&#xFF0C;&#x5185;&#x5FC3;&#x4E00;&#x76F4;&#x8FD9;&#x4E48;&#x4FA5;&#x5E78;&#xFF0C;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x4E5F;&#x548C;&#x6211;&#x4E00;&#x6837;&#x5462;&#x3002;</p>
<p>30&#x5C81;&#x4E4B;&#x540E;&#xFF0C;&#x8BE5;&#x6765;&#x7684;&#x8FD8;&#x662F;&#x6765;&#x4E86;&#xFF0C;32&#x5C81;&#x90A3;&#x5E74;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x6B21;&#x54B3;&#x55FD;&#x5165;&#x9662;&#xFF0C;&#x53CD;&#x590D;&#x9AD8;&#x70E7;&#xFF0C;&#x9000;&#x4E86;&#x53C8;&#x53D1;&#x70E7;&#xFF0C;&#x533B;&#x751F;&#x4E00;&#x5EA6;&#x4EE5;&#x4E3A;&#x662F;&#x65B0;&#x51A0;&#xFF0C;&#x6216;&#x7ED3;&#x6838;&#xFF0C;&#x6216;&#x767D;&#x8840;&#x75C5;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x5168;&#x90E8;&#x68C0;&#x67E5;&#x4E86;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x53D1;&#x73B0;&#x5C31;&#x662F;&#x666E;&#x901A;&#x7684;&#x80BA;&#x90E8;&#x611F;&#x67D3;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x4E24;&#x74F6;&#x6297;&#x75C5;&#x6BD2;&#x7684;&#x70B9;&#x6EF4;&#xFF0C;&#x5927;&#x6982;&#x534A;&#x4E2A;&#x6708;&#x624D;&#x9010;&#x6E10;&#x6062;&#x590D;&#xFF0C;&#x4EBA;&#x90FD;&#x7626;&#x8131;&#x76F8;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EBA;&#x751F;&#x5934;&#x4E00;&#x6B21;&#x4F4F;&#x9662;&#xFF0C;&#x8EBA;&#x5728;&#x75C5;&#x5E8A;&#x4E0A;&#x50CF;&#x5E9F;&#x4EBA;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x7B49;&#x5230;33&#x5C81;&#x4E5F;&#x5C31;&#x662F;&#x53BB;&#x5E74;&#xFF0C;&#x5076;&#x7136;&#x5934;&#x6655;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x90A3;&#x79CD;&#x7729;&#x6655;&#xFF0C;&#x5929;&#x65CB;&#x5730;&#x8F6C;&#xFF0C;&#x72AF;&#x6076;&#x5FC3;&#xFF0C;&#x600E;&#x4E48;&#x7AD9;&#x600E;&#x4E48;&#x5750;&#x600E;&#x4E48;&#x8EBA;&#x90FD;&#x4E0D;&#x884C;&#xFF0C;&#x771F;&#x6B63;&#x8981;&#x6B7B;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x540E;&#x9762;&#x6211;&#x4E00;&#x5EA6;&#x4EE5;&#x4E3A;&#x662F;&#x5E74;&#x7EAA;&#x8F7B;&#x8F7B;&#x5F97;&#x4E86;&#x9AD8;&#x8840;&#x538B;&#xFF0C;&#x7ED3;&#x679C;&#x67E5;&#x4E86;&#x4E0B;&#x662F;&#x8840;&#x8102;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x4E0D;&#x7B97;&#x4E25;&#x91CD;&#xFF0C;&#x4F46;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x4E9B;&#x5FC3;&#x8111;&#x8840;&#x7BA1;&#x75BE;&#x75C5;&#x3002;</p>
<p>&#x6211;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#xFF0C;&#x8FD9;&#x53EF;&#x90FD;&#x662F;&#x8001;&#x5E74;&#x75C5;&#x554A;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;30&#x51E0;&#x5C81;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8BF4;&#x6765;&#x5C31;&#x6765;&#x4E86;&#xFF1F;</p>
<p>&#x8C03;&#x517B;&#x534A;&#x5E74;&#x591A;&#xFF0C;&#x8089;&#x773C;&#x53EF;&#x89C1;&#x8EAB;&#x4F53;&#x6709;&#x597D;&#x8F6C;&#xFF0C;&#x6211;&#x53C8;&#x5F00;&#x59CB;&#x6CA1;&#x5FCD;&#x4F4F;&#x71AC;&#x591C;&#x4E86;&#xFF0C;&#x60F3;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x8BFE;&#x9898;&#xFF0C;&#x60F3;&#x5206;&#x4EAB;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x60F3;&#x5F97;&#x592A;&#x591A;&#xFF0C;&#x81EA;&#x7136;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x591A;&#x3002;</p>
<p>&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x8FDE;&#x7EED;&#x71AC;&#x4E86;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x665A;&#x90FD;&#x662F;2&#x70B9;&#x5DE6;&#x53F3;&#x8EBA;&#x4E0B;&#xFF0C;&#x6709;&#x65F6;&#x4E2D;&#x5348;&#x8FD8;&#x4E0D;&#x5348;&#x4F11;&#xFF0C;&#x5237;&#x624B;&#x673A;&#x627E;&#x7D20;&#x6750;&#x3002;</p>
<p>&#x7EC8;&#x4E8E;&#xFF0C;&#x8116;&#x5B50;&#x4E0A;&#x8D77;&#x4E86;&#x80BF;&#x5757;&#xFF0C;&#x8BA9;&#x6211;&#x6574;&#x4E2A;&#x4EBA;&#x90FD;&#x8499;&#x5708;&#x4E86;&#xFF0C;&#x89C9;&#x5F97;&#x4E00;&#x5207;&#x52AA;&#x529B;&#x90FD;&#x662F;&#x5728;&#x73A9;&#x5F04;&#x81EA;&#x5DF1;&#xFF0C;&#x5FFD;&#x7136;&#x95F4;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x610F;&#x601D;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5C3D;&#x91CF;&#x628A;&#x8FD9;&#x79CD;&#x611F;&#x53D7;&#x63CF;&#x8FF0;&#x51FA;&#x6765;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x80FD;&#x770B;&#x660E;&#x767D;&#xFF0C;&#x771F;&#x5207;&#x4F53;&#x4F1A;&#x4E00;&#x4E8C;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;30&#x5C81;&#x4E4B;&#x540E;&#x6211;&#x4E00;&#x71AC;&#x591C;&#x5C31;&#x6709;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;30&#x5C81;&#x4E4B;&#x524D;&#x900F;&#x652F;&#x4E86;&#x5DF2;&#x7ECF;&#xFF0C;&#x4E00;&#x6765;&#x662F;&#x8EAB;&#x4F53;&#x8D1F;&#x8377;&#x8FBE;&#x5230;&#x4E34;&#x754C;&#xFF0C;&#x4E8C;&#x6765;&#x517B;&#x6210;&#x4E86;&#x591A;&#x5E74;&#x7684;&#x574F;&#x4E60;&#x60EF;&#xFF0C;&#x4E00;&#x65F6;&#x60F3;&#x6539;&#x8FD8;&#x6539;&#x4E0D;&#x8FC7;&#x6765;&#x3002;</p>
<blockquote>
<p>30&#x5C81;&#x4E4B;&#x524D;&#x771F;&#x522B;&#x73A9;&#x5F04;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x4E86;xdm&#xFF0C;&#x6A61;&#x76AE;&#x7B4B;&#x65AD;&#x4E86;&#x5C31;&#x771F;&#x65AD;&#x4E86;&#xFF0C;&#x63A5;&#x4E0D;&#x4E0A;&#x4E86;&#xFF0C;&#x63A5;&#x4E0A;&#x4E86;&#x4E5F;&#x6CA1;&#x4EE5;&#x524D;&#x7684;&#x5F39;&#x6027;&#x4E86;&#x3002;</p>
</blockquote>
<h3 id="&#x5065;&#x5EB7;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x5F8B;&#x548C;&#x5FC3;&#x60C5;"><a href="#&#x5065;&#x5EB7;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x5F8B;&#x548C;&#x5FC3;&#x60C5;" class="headerlink" title="&#x5065;&#x5EB7;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x5F8B;&#x548C;&#x5FC3;&#x60C5;"></a>&#x5065;&#x5EB7;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x5F8B;&#x548C;&#x5FC3;&#x60C5;</h3><blockquote>
<p>&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5065;&#x5EB7;&#x53D6;&#x51B3;&#x4E8E;&#x4E24;&#x70B9;&#xFF1A;&#x81EA;&#x5F8B;&#x548C;&#x5FC3;&#x60C5;&#x3002;</p>
</blockquote>
<p>30&#x5C81;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x5B66;&#x4F1A;&#x81EA;&#x5F8B;&#xFF0C;<code>&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x81EA;&#x5F8B;&#xFF0C;&#x751F;&#x6D3B;&#x4F5C;&#x606F;&#x81EA;&#x5F8B;&#xFF0C;&#x4E00;&#x65E5;&#x4E09;&#x9910;&#x81EA;&#x5F8B;</code>&#xFF0C;&#x517B;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x4E60;&#x60EF;&#xFF0C;30&#x5C81;&#x4E4B;&#x540E;&#x7684;&#x4F60;&#x4F1A;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x3002;</p>
<p>&#x81EA;&#x5F8B;&#x771F;&#x7684;&#x5F88;&#x96BE;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x6709;&#x5014;&#x5F3A;&#x5730;&#x9002;&#x5E94;&#x8FC7;&#xFF0C;&#x5374;&#x53C8;&#x60B2;&#x54C0;&#x5730;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x6B47;&#x65AF;&#x5E95;&#x91CC;&#x7684;&#x4EBA;&#xFF0C;&#x5FFD;&#x7136;&#x8BA9;&#x4F60;&#x6E29;&#x6587;&#x5C14;&#x96C5;&#xFF0C;&#x4F60;&#x53C8;&#x80FD;&#x575A;&#x6301;&#x591A;&#x4E45;&#x5462;&#x3002;</p>
<p>&#x6211;&#x7528;&#x5F88;&#x591A;&#x9E21;&#x6C64;&#x8BF4;&#x670D;&#x8FC7;&#x81EA;&#x5DF1;&#xFF0C;&#x5BF9;&#x4E8E;&#x5DF2;&#x7ECF;30&#x51E0;&#x5C81;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x53EA;&#x80FD;&#x7EF4;&#x6301;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x60F3;&#x770B;&#x7684;&#x591A;&#xFF0C;&#x60F3;&#x73A9;&#x7684;&#x591A;&#xFF0C;&#x60F3;&#x5B66;&#x7684;&#x4E5F;&#x591A;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x771F;&#x4E0D;&#x591F;&#x554A;&#xFF0C;&#x771F;&#x60F3;&#x5411;&#x5929;&#x518D;&#x501F;&#x4E94;&#x767E;&#x5E74;&#x3002;</p>
<p>&#x6211;&#x5E94;&#x8BE5;&#x7B97;&#x662F;&#x5E78;&#x8FD0;&#x7684;&#x90A3;&#x4E00;&#x7C7B;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x8FD9;&#x822C;&#x900F;&#x652F;&#x8EAB;&#x4F53;&#xFF0C;&#x6211;&#x8FD8;&#x6D3B;&#x7740;&#xFF0C;&#x4E5F;&#x6CA1;&#x7528;&#x4F59;&#x751F;&#x53BB;&#x76F4;&#x9762;&#x7EDD;&#x671B;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x7528;&#x8FD9;&#x4E24;&#x5E74;&#x7684;&#x8EAB;&#x4F53;&#x6545;&#x969C;&#x7ED9;&#x81EA;&#x5DF1;&#x4E0A;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x8BFE;&#xFF0C;&#x4EBA;&#x6B7B;&#x5982;&#x706F;&#x706D;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x80FD;&#x91CD;&#x6765;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x89C4;&#x5212;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x628A;&#x6BCF;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x7684;&#x597D;&#x597D;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x4FDD;&#x8BC1;&#x4E00;&#x65E5;&#x4E09;&#x9910;&#x4E0D;&#x843D;&#x4E0B;&#xFF0C;&#x5C11;&#x5403;&#x5916;&#x5356;&#xFF0C;&#x591A;&#x5403;&#x6C34;&#x679C;&#x852C;&#x83DC;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x4FDD;&#x8BC1;&#x6BCF;&#x665A;&#x5145;&#x8DB3;&#x7684;&#x7761;&#x7720;&#xFF0C;&#x65E9;&#x7761;&#x65E9;&#x8D77;&#xFF0C;&#x7EDD;&#x4E0D;&#x71AC;&#x591C;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x6BCF;&#x5929;&#x4E0B;&#x73ED;&#x548C;&#x653E;&#x5047;&#x62BD;&#x51FA;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x8FD0;&#x52A8;&#x548C;&#x953B;&#x70BC;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x662F;&#x8BF4;&#x7ED9;&#x81EA;&#x5DF1;&#x542C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5DF2;&#x7ECF;&#x900F;&#x652F;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x662F;&#x8BF4;&#x7ED9;&#x5728;&#x770B;&#x6587;&#x7AE0;&#x7684;&#x4F60;&#x4EEC;&#x542C;&#x7684;&#xFF0C;&#x8FD8;&#x5E74;&#x8F7B;&#x70B9;&#x7684;&#xFF0C;&#x8FD8;&#x6CA1;&#x900F;&#x652F;&#x7684;&#xFF0C;&#x8BF7;&#x7528;&#x6211;&#x7684;&#x73B0;&#x5728;&#x5F53;&#x505A;&#x4F60;&#x53EF;&#x80FD;&#x66F4;&#x574F;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x65E9;&#x70B9;&#x9192;&#x609F;&#xFF0C;&#x4E3A;&#x65F6;&#x4E0D;&#x665A;&#x3002;</p>
<p>&#x81EA;&#x5F8B;&#x5F88;&#x96BE;&#xFF0C;&#x4F46;&#x4E0D;&#x81EA;&#x5F8B;&#x53EF;&#x80FD;&#x7B49;&#x6B7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x96BE;&#x3002;</p>
<blockquote>
<p>&#x5DE5;&#x4F5C;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x907F;&#x514D;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EE5;&#x524D;&#x6709;&#x529D;&#x8FC7;&#x5927;&#x5BB6;&#xFF0C;&#x85AA;&#x6C34;&#x7684;&#x91CD;&#x8981;&#x6027;&#x53EA;&#x5360;&#x4E00;&#x534A;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8FFD;&#x5BFB;&#x4E00;&#x4EFD;&#x85AA;&#x6C34;&#x5C1A;&#x53EF;&#xFF0C;&#x4F46;&#x538B;&#x529B;&#x4E00;&#x5B9A;&#x5728;&#x627F;&#x53D7;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x56FD;&#x5185;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#x76F8;&#x5BF9;&#x53CB;&#x597D;&#x7684;&#x9014;&#x5F84;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x8FDB;&#x5165;IT&#x884C;&#x4E1A;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x6DAF;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x9636;&#x6BB5;&#x542C;&#x5230;&#x8FC7;&#x4F20;&#x667A;&#x64AD;&#x5BA2;&#x5F20;&#x5B5D;&#x7965;&#x8001;&#x5E08;&#x7684;&#x731D;&#x6B7B;&#xFF0C;&#x5DE5;&#x4F5C;&#x9636;&#x6BB5;&#x542C;&#x8BF4;&#x8FC7;&#x9644;&#x8FD1;&#x7684;4396&#x6E38;&#x620F;&#x516C;&#x53F8;&#x91CC;&#x9762;30&#x591A;&#x5C81;&#x7A0B;&#x5E8F;&#x5458;&#x731D;&#x6B7B;&#xFF0C;&#x4ECA;&#x5E74;&#x53C8;&#x542C;&#x5230;&#x4E86;&#x5DE6;&#x8033;&#x6735;&#x8017;&#x5B50;&#x5148;&#x751F;&#x7684;&#x79BB;&#x4E16;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x7740;&#xFF0C;&#x90A3;&#x4E00;&#x5929;&#xFF0C;&#x79BB;&#x6211;&#x548C;&#x4F60;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#x3002;</p>
<p>&#x5FC3;&#x60C5;&#x771F;&#x7684;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x81F3;&#x5C11;&#x80FD;&#x5FEB;&#x901F;&#x53CD;&#x5E94;&#x5728;&#x8EAB;&#x4F53;&#x4E0A;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x8FD9;&#x5468;&#x516D;&#x88AB;&#x59BB;&#x5B50;&#x529D;&#x8BF4;&#x53BB;&#x68C0;&#x67E5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5185;&#x5FC3;&#x4E00;&#x76F4;&#x662F;&#x7D27;&#x5F20;&#x7684;&#xFF0C;&#x59BB;&#x5B50;&#x6CA1;&#x53BB;&#xFF0C;&#x5C31;&#x5728;&#x5BB6;&#x966A;&#x7740;&#x5B69;&#x5B50;&#xFF0C;&#x8DDF;&#x6211;&#x8BF4;&#x4F60;&#x81EA;&#x5DF1;&#x53BB;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x574F;&#x6D88;&#x606F;&#x5C31;&#x522B;&#x56DE;&#x590D;&#x4E86;&#xFF0C;&#x7B49;&#x56DE;&#x6765;&#x518D;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#x90A3;&#x5C31;&#x53D1;&#x4E2A;&#x5FAE;&#x4FE1;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x6211;&#x7406;&#x89E3;&#x5979;&#x7684;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x70B9;&#x4E86;&#x70B9;&#x5934;&#x5C31;&#x9A91;&#x8F66;&#x53BB;&#x4E86;&#x533B;&#x9662;&#x3002;</p>
<p>&#x533B;&#x9662;&#x771F;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x597D;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x7ED9;&#x533B;&#x9662;&#x5E72;&#x6D3B;&#x7684;&#xFF0C;&#x6211;&#x5168;&#x8EAB;&#x4E0A;&#x4E0B;&#x90FD;&#x8BA8;&#x538C;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x6700;&#x714E;&#x71AC;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x505A;&#x5F69;&#x8D85;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x592A;&#x591A;&#xFF0C;&#x6211;&#x5F97;&#x6392;&#x961F;&#xFF0C;&#x76EF;&#x7740;&#x5927;&#x5C4F;&#x4E0A;&#x7684;&#x53F7;&#x5E8F;&#xFF0C;&#x6211;&#x8111;&#x5B50;&#x91CC;&#x60F3;&#x4E86;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x6700;&#x574F;&#x7684;&#x6253;&#x7B97;&#x90FD;&#x60F3;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x4EBA;&#x5C31;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x8D8A;&#x662F;&#x63A5;&#x8FD1;&#x9ED1;&#x6697;&#xFF0C;&#x8D8A;&#x662F;&#x80FD;&#x56DE;&#x5FC6;&#x8D77;&#x975E;&#x5E38;&#x591A;&#x7684;&#x5F80;&#x4E8B;&#xFF0C;&#x8FDE;&#x9AD8;&#x4E2D;&#x6253;&#x7BEE;&#x7403;&#x6325;&#x6D12;&#x6C57;&#x6C34;&#x7684;&#x6A21;&#x6837;&#x548C;&#x641E;&#x7B11;&#x7684;&#x6295;&#x7BEE;&#x59FF;&#x52BF;&#x90FD;&#x80FD;&#x60F3;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x558A;&#x5230;&#x6211;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FC3;&#x8DF3;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x9EBB;&#x6728;&#x5730;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x8EBA;&#x4E0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x533B;&#x751F;&#x62FF;&#x7740;&#x4EEA;&#x5668;&#x5BF9;&#x7740;&#x6211;&#x7684;&#x8116;&#x5B50;&#x626B;&#x63CF;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x6211;&#x662F;&#x8FD1;&#x4E00;&#x4E2A;&#x6708;&#x4EE5;&#x6765;&#x7B2C;&#x4E00;&#x6B21;&#x5185;&#x5FC3;&#x5E73;&#x9759;&#xFF0C;&#x5F53;&#x771F;&#x597D;&#x5947;&#x602A;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x968F;&#x7740;&#x533B;&#x751F;&#x4E00;&#x53E5;&#xFF1A;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x5C31;&#x4E00;&#x4E2A;&#x6DCB;&#x5DF4;&#x7ED3;&#x3002;</p>
<p>&#x72B9;&#x5982;&#x5BA1;&#x5224;&#x4E00;&#x822C;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x4E00;&#x4E0B;&#x65E0;&#x7F6A;&#x91CA;&#x653E;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#x542C;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#x7B80;&#x76F4;&#x72B9;&#x5982;&#x5929;&#x7C41;&#xFF0C;&#x8FD9;&#x4F1A;&#x513F;&#x60F3;&#x8D77;&#x6765;&#x8FD8;&#x611F;&#x89C9;&#x6BDB;&#x5B54;&#x90FD;&#x5728;&#x6B22;&#x5FEB;&#x5730;&#x6109;&#x60A6;&#x3002;</p>
<p>&#x6211;&#x95EE;&#x5979;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x80BF;&#x7624;&#x6216;&#x7532;&#x72B6;&#x817A;&#x5427;&#xFF0C;&#x5979;&#x8BF4;&#x4E0D;&#x662F;&#xFF0C;&#x5C31;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x6DCB;&#x5DF4;&#x7ED3;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x708E;&#x75C7;&#x5BFC;&#x81F4;&#x4E86;&#x589E;&#x751F;&#xFF0C;&#x8FD9;&#x79CD;&#x4E00;&#x822C;3&#x4E2A;&#x591A;&#x6708;&#x81F3;&#x534A;&#x5E74;&#x624D;&#x4F1A;&#x5B8C;&#x5168;&#x6D88;&#x6389;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5F53;&#x65F6;&#x62CD;&#x7684;&#x7ED3;&#x679C;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3564e3bfc3201c03e4c268c19ff69efc5ac3e5e830a4e373501f98f047c079f8" alt="3.jpg"></p>
<p>&#x62FF;&#x7ED9;&#x4E3B;&#x4EFB;&#x533B;&#x5E08;&#x770B;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x65B9;&#x4E5F;&#x8BF4;&#x4E00;&#x70B9;&#x4E8B;&#x6CA1;&#x6709;&#xFF0C;&#x53EA;&#x662F;&#x544A;&#x8BEB;&#x6211;&#x522B;&#x518D;&#x71AC;&#x591C;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4EBA;&#x751F;&#x8FD8;&#x4F1A;&#x7ED9;&#x6211;&#x51E0;&#x6B21;&#x673A;&#x4F1A;&#xFF0C;&#x4F46;&#x6211;&#x4ECE;20&#x51E0;&#x5C81;&#x5230;30&#x51E0;&#x5C81;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x91CD;&#x89C6;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8BA4;&#x771F;&#x601D;&#x8003;&#x8FC7;&#x3002;</p>
<p>&#x76F4;&#x5230;&#x6700;&#x8FD1;&#xFF0C;&#x6211;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x6D3B;&#x7740;&#x771F;&#x597D;&#x3002;</p>
<p>&#x5F53;&#x665A;&#x662F;&#x7761;&#x5F97;&#x6700;&#x8E0F;&#x5B9E;&#x7684;&#x4E00;&#x665A;&#xFF0C;&#x4E00;&#x70B9;&#x68A6;&#x90FD;&#x6CA1;&#x505A;&#xFF0C;&#x4E2D;&#x9014;&#x4E5F;&#x6CA1;&#x9192;&#xFF0C;&#x4E00;&#x89C9;&#x5230;&#x5929;&#x4EAE;&#x3002;</p>
<p>&#x66F4;&#x79BB;&#x8C31;&#x7684;&#x662F;&#xFF0C;&#x65E9;&#x4E0A;&#x6211;&#x6478;&#x4E86;&#x4E00;&#x4E0B;&#x8116;&#x5B50;&#xFF0C;&#x7ADF;&#x7136;&#x771F;&#x7684;&#x5C0F;&#x4E86;&#x70B9;&#xFF0C;&#x8FD9;&#x624D;&#x77ED;&#x77ED;&#x4E00;&#x5929;&#xFF0C;&#x8BF4;&#x4E86;&#x90FD;&#x6CA1;&#x4EBA;&#x4FE1;&#x3002;</p>
<p>&#x6211;&#x5934;&#x4E00;&#x6B21;&#x76F8;&#x4FE1;&#xFF0C;&#x5FC3;&#x60C5;&#x771F;&#x7684;&#x4F1A;&#x5F71;&#x54CD;&#x8EAB;&#x4F53;&#xFF0C;&#x4F60;&#x5FC3;&#x60C5;&#x597D;&#x4E86;&#xFF0C;&#x8EAB;&#x4F53;&#x7684;&#x5668;&#x5B98;&#x548C;&#x8840;&#x6DB2;&#x4EFF;&#x4F5B;&#x90FD;&#x6B22;&#x817E;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x597D;&#x5FC3;&#x60C5;&#xFF0C;&#x539F;&#x6765;&#x8FD9;&#x822C;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x62FF;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x7ED9;&#x5927;&#x5BB6;&#x505A;&#x5B9E;&#x9A8C;&#x4E86;&#xFF0C;&#x6709;&#x7528;&#xFF01;</p>
<blockquote>
<p>&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x6BCF;&#x5929;&#x5728;&#x81EA;&#x5F8B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4FDD;&#x6301;&#x597D;&#x5FC3;&#x60C5;&#xFF0C;&#x4E0D;&#x8D1F;&#x5E74;&#x534E;&#xFF0C;&#x4E0D;&#x8D1F;&#x81EA;&#x5DF1;&#x3002;</p>
</blockquote>
<h3 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h3><p>xdm&#xFF0C;&#x597D;&#x597D;&#x6D3B;&#x7740;&#xFF0C;&#x5FEB;&#x4E50;&#x6D3B;&#x7740;&#x3002;</p>
<blockquote>
<p>&#x516C;&#x4F17;&#x53F7; &#x2013;&gt; &#x3010;Java&#x5206;&#x4EAB;&#x5BA2;&#x6808;&#x3011;</p>
</blockquote>
<hr>
<p>&#x5982;&#x679C;&#x559C;&#x6B22;&#xFF0C;&#x8BF7;&#x70B9;&#x8D5E;+&#x5173;&#x6CE8;&#x2191;&#x2191;&#x2191;&#xFF0C;&#x6301;&#x7EED;&#x5206;&#x4EAB;&#x5E72;&#x8D27;&#x54E6;~</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/7e5cefc619c0ba863e42599fd10138f0.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-Java-程序员/" rel="tag"># 后端,Java,程序员</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7300151966964662284.html" rel="next" title="一文了解Webpack中Tapable事件机制">
                <i class="fa fa-chevron-left"></i> 一文了解Webpack中Tapable事件机制
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7302348032544866316.html" rel="prev" title="Android 14 正式版适配笔记（二）— 针对Andro">
                Android 14 正式版适配笔记（二）— 针对Andro <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#病来如山倒"><span class="nav-number">2.</span> <span class="nav-text">病来如山倒</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#透支和还债"><span class="nav-number">3.</span> <span class="nav-text">透支和还债</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#健康取决于自律和心情"><span class="nav-number">4.</span> <span class="nav-text">健康取决于自律和心情</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#总结"><span class="nav-number">5.</span> <span class="nav-text">总结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
