<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,创业,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x9996;&amp;#x53D1;&amp;#x4E8E;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#xFF1A;&amp;#x561F;&amp;#x7237;&amp;#x521B;&amp;#x4E1A;&amp;#x65E5;&amp;#x8BB0; &amp;#x3002; &amp;#x6211;&amp;#x5DF2;&amp;#x7ECF;&amp;#x575A;&amp;#x6301;&amp;#x65E5;&amp;#x66F4;120&amp;#x5929;+">
<meta name="keywords" content="后端,创业">
<meta property="og:type" content="article">
<meta property="og:title" content="谈谈普通人做副业的正确顺序">
<meta property="og:url" content="https://dev.newban.cn/7338022547713622070.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x9996;&amp;#x53D1;&amp;#x4E8E;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#xFF1A;&amp;#x561F;&amp;#x7237;&amp;#x521B;&amp;#x4E1A;&amp;#x65E5;&amp;#x8BB0; &amp;#x3002; &amp;#x6211;&amp;#x5DF2;&amp;#x7ECF;&amp;#x575A;&amp;#x6301;&amp;#x65E5;&amp;#x66F4;120&amp;#x5929;+">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a54d9dea1a212abfc11892396590b9a00d73a9212ad2677d3ac65614e1185118">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/58e5ddfa1883f8baab61f1907fec9419df8242e4c4df068446a59128780ac66f">
<meta property="og:updated_time" content="2024-04-27T06:37:15.333Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="谈谈普通人做副业的正确顺序">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x9996;&amp;#x53D1;&amp;#x4E8E;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#xFF1A;&amp;#x561F;&amp;#x7237;&amp;#x521B;&amp;#x4E1A;&amp;#x65E5;&amp;#x8BB0; &amp;#x3002; &amp;#x6211;&amp;#x5DF2;&amp;#x7ECF;&amp;#x575A;&amp;#x6301;&amp;#x65E5;&amp;#x66F4;120&amp;#x5929;+">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a54d9dea1a212abfc11892396590b9a00d73a9212ad2677d3ac65614e1185118">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7338022547713622070.html">





  <title>谈谈普通人做副业的正确顺序 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">谈谈普通人做副业的正确顺序</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-22T11:19:50+08:00">
                2024-02-22
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a54d9dea1a212abfc11892396590b9a00d73a9212ad2677d3ac65614e1185118" alt="&#x666E;&#x901A;&#x4EBA;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x6B63;&#x786E;&#x987A;&#x5E8F;.jpg"></p>
<blockquote>
<p>&#x672C;&#x6587;&#x9996;&#x53D1;&#x4E8E;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<a href="/external_links/a0600ccf65948bdbc3dd78760c7a4dd5.html" target="blank" rel="noopener">&#x561F;&#x7237;&#x521B;&#x4E1A;&#x65E5;&#x8BB0;</a> &#x3002; &#x6211;&#x5DF2;&#x7ECF;&#x575A;&#x6301;&#x65E5;&#x66F4;120&#x5929;+&#xFF0C;&#x6B22;&#x8FCE;&#x8FC7;&#x6765;&#x8FFD;&#x5267;~</p>
</blockquote>
<p>&#x6700;&#x8FD1;&#x6398;&#x91D1;&#x7684;&#x6587;&#x7AE0;&#x6D41;&#x91CF;&#x7279;&#x522B;&#x5927;&#xFF0C;&#x90A3;&#x7BC7;2023&#x5E74;&#x603B;&#x7ED3;&#x7684;&#x70B9;&#x8D5E;&#x8BC4;&#x8BBA;&#x6570;&#x636E;&#x90FD;&#x4E0D;&#x9519;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6709;&#x4E00;&#x4E9B;&#x6267;&#x884C;&#x529B;&#x9AD8;&#x7684;&#x4EBA;&#x4E3B;&#x52A8;&#x6765;&#x94FE;&#x63A5;&#x3002;</p>
<p>&#x7136;&#x540E;&#x548C;&#x5927;&#x5BB6;&#x804A;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53D1;&#x73B0;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x4EE5;&#x524D;&#x662F;&#x6CA1;&#x600E;&#x4E48;&#x63A5;&#x89E6;&#x8FC7;&#x526F;&#x4E1A;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x4E1A;&#x6536;&#x5165;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x524D;&#x51E0;&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x4E1A;&#x5982;&#x679C;&#x53D1;&#x5C55;&#x5F97;&#x597D;&#xFF0C;&#x662F;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x505A;&#x526F;&#x4E1A;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5E72;&#x5230;&#x9000;&#x4F11;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5BF9;&#x5DE5;&#x4F5C;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x62B1;&#x6709;&#x6000;&#x7591;&#xFF0C;&#x5BB3;&#x6015;&#x7A81;&#x7136;&#x5DE5;&#x4F5C;&#x6CA1;&#x4E86;&#xFF0C;&#x8EAB;&#x4E0A;&#x53C8;&#x80CC;&#x8D1F;&#x7740;&#x5404;&#x79CD;&#x503A;&#x52A1;&#xFF0C;&#x4E0A;&#x6709;&#x8001;&#x4E0B;&#x6709;&#x5C0F;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x89C9;&#x5F97;&#x5F88;&#x7126;&#x8651;&#x538B;&#x529B;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x5C1D;&#x8BD5;&#x4EBA;&#x751F;&#x7B2C;&#x4E8C;&#x66F2;&#x7EBF;&#x7684;&#x60F3;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x70C8;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x5E95;&#x8FD8;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5F15;&#x53D1;&#x7684;&#x7126;&#x8651;&#xFF0C;&#x9762;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x5927;&#x5BB6;&#x60F3;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x6765;&#x5BF9;&#x6297;&#x8FD9;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x6216;&#x8005;&#x8BF4;&#x964D;&#x4F4E;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x8BF4;&#x6765;&#x6211;&#x5F88;&#x6709;&#x611F;&#x89E6;&#x554A;&#xFF0C;&#x6211;&#x8FD9;&#x6B21;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x53D1;&#x4E0D;&#x8D77;&#x5DE5;&#x8D44;&#x800C;&#x79BB;&#x804C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6CA1;&#x6709;&#x591A;&#x5E74;&#x79EF;&#x7D2F;&#x7684;&#x526F;&#x4E1A;&#x5E95;&#x5B50;&#x5728;&#xFF0C;&#x90A3;&#x6211;&#x80AF;&#x5B9A;&#x4E5F;&#x7126;&#x8651;&#x5F97;&#x8981;&#x6B7B;&#xFF0C;&#x4E5F;&#x8981;&#x7EE7;&#x7EED;&#x6295;&#x5165;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x5927;&#x519B;&#x91CC;&#x9762;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x611F;&#x8C22;&#x51E0;&#x5E74;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x505A;&#x51FA;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x662F;&#x5927;&#x5BB6;&#x6295;&#x7968;&#x7684;&#x4E00;&#x4E9B;&#x7ED3;&#x679C;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x662F;&#x5361;&#x5728;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x9636;&#x6BB5;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/58e5ddfa1883f8baab61f1907fec9419df8242e4c4df068446a59128780ac66f" alt="image.png"></p>
<p>&#x56DE;&#x5934;&#x6211;&#x518D;&#x6839;&#x636E;&#x5927;&#x5BB6;&#x6295;&#x7968;&#x7ED3;&#x679C;&#x6765;&#x8F93;&#x51FA;&#x4E00;&#x7BC7;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5BF9;&#x65B0;&#x4EBA;&#x5F00;&#x59CB;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x987A;&#x5E8F;&#x8C08;&#x8C08;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<p>1&#xFF1A;&#x8981;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x610F;&#x613F;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x7684;&#x8BDD;&#x4F60;&#x65E0;&#x6CD5;&#x575A;&#x6301;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x70B9;&#x5C0F;&#x632B;&#x6298;&#x5C31;&#x4F1A;&#x505C;&#x6B62;</p>
<p>2&#xFF1A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;1&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5F00;&#x773C;&#x754C;&#x9636;&#x6BB5;&#xFF0C;&#x4F60;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x5404;&#x79CD;&#x526F;&#x4E1A;&#xFF0C;&#x53BB;&#x62C6;&#x89E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x8D5A;&#x5230;&#x94B1;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6838;&#x5FC3;&#x8D5A;&#x94B1;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5148;&#x8981;&#x89C2;&#x4E16;&#x754C;&#xFF0C;&#x624D;&#x6709;&#x4E16;&#x754C;&#x89C2;&#xFF0C;&#x4F60;&#x8981;&#x770B;&#x7684;&#x591A;&#x4E86;&#x61C2;&#x5F97;&#x591A;&#x4E86;&#xFF0C; &#x53EF;&#x9009;&#x62E9;&#x7684;&#x624D;&#x4F1A;&#x53D8;&#x591A;&#x3002;</p>
<p>&#x5F00;&#x773C;&#x754C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x5C31;&#x662F;&#x5C31;&#x662F;&#x5EFA;&#x7ACB;&#x9AD8;&#x8D28;&#x91CF;&#x4FE1;&#x606F;&#x8F93;&#x5165;&#x7BA1;&#x9053;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x627E;&#x8D44;&#x6599;&#xFF0C;&#x514D;&#x8D39;&#x548C;&#x4ED8;&#x8D39;&#x90FD;&#x884C;&#xFF0C;&#x514D;&#x8D39;&#x82B1;&#x65F6;&#x95F4;&#x7701;&#x94B1;&#xFF0C;&#x4ED8;&#x8D39;&#x82B1;&#x94B1;&#x7701;&#x65F6;&#x95F4;&#xFF0C;&#x770B;&#x81EA;&#x5DF1;&#x53D6;&#x820D;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x6BCF;&#x5E74;&#x7528;&#x6765;&#x77E5;&#x8BC6;&#x4ED8;&#x8D39;&#x5927;&#x90E8;&#x5206;&#x94B1;&#x90FD;&#x662F;&#x7528;&#x6765;&#x4E86;&#x89E3;&#x526F;&#x4E1A;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5F88;&#x5C11;&#x52A0;&#x8BAD;&#x7EC3;&#x8425;&#x3002;</p>
<p>3&#xFF1A;&#x5B9E;&#x64CD;&#x5C0F;&#x9879;&#x76EE;&#xFF0C;&#x770B;&#x5F97;&#x518D;&#x591A;&#xFF0C;&#x90FD;&#x4E0D;&#x5982;&#x81EA;&#x5DF1;&#x8EAC;&#x8EAB;&#x5165;&#x5C40;&#x628A;&#x624B;&#x5F04;&#x810F;&#xFF0C;&#x4F60;&#x5B66;&#x5230;&#x4E0D;&#x7B49;&#x4E8E;&#x662F;&#x4F60;&#x638C;&#x63E1;&#xFF0C;&#x53EA;&#x6709;&#x4E0D;&#x65AD;&#x53BB;&#x8BD5;&#x9519;&#x53BB;&#x8FED;&#x4EE3;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x6280;&#x80FD;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#x548C;&#x80FD;&#x529B;&#x624D;&#x662F;&#x4F60;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x6C89;&#x6DC0;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x7B49;&#x4E0B;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#x6765;&#x4E34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x8D77;&#x70B9;&#x624D;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x6311;&#x9009;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE5;&#x524D;&#x4E5F;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E00;&#x6B21;&#xFF0C;&#x56DE;&#x5934;&#x6211;&#x4E13;&#x95E8;&#x518D;&#x5199;&#x4E00;&#x7BC7;&#x8C08;&#x8C08;&#x6211;&#x7684;&#x770B;&#x6CD5;&#x3002;</p>
<p>4&#xFF1A;&#x9009;&#x62E9;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x91CF;&#x5148;&#x9009;&#x62E9;&#x6210;&#x672C;&#x5C0F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4EEC;&#x521A;&#x5F00;&#x59CB;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5173;&#x6CE8;&#x6280;&#x80FD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5148;&#x4ECE;&#x8D5A;&#x5230;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#x5F00;&#x59CB;&#xFF0C;&#x60F3;&#x77E5;&#x8BC6;&#x4ED8;&#x8D39;&#x53C2;&#x52A0;&#x8BAD;&#x7EC3;&#x8425;&#x5565;&#x7684;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x7B49;&#x4F60;&#x540E;&#x671F;&#x5DF2;&#x7ECF;&#x5B9E;&#x8DF5;&#x8FC7;&#x51E0;&#x4E2A;&#x526F;&#x4E1A;&#x9879;&#x76EE;&#x540E;&#xFF0C;&#x6C89;&#x6DC0;&#x4E86;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x80FD;&#x529B;&#x4E86;&#x518D;&#x53BB;&#x3002;&#x90A3;&#x6837;&#x4F60;&#x6210;&#x529F;&#x7684;&#x6982;&#x7387;&#x624D;&#x4F1A;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x505A;&#x526F;&#x4E1A;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x4EBA;&#x8D27;&#x573A;&#x8FD9;&#x4E2A;&#x5546;&#x4E1A;&#x903B;&#x8F91;&#xFF0C;&#x90FD;&#x6EE1;&#x8DB3;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x80FD;&#x6210;&#x4EA4;&#x3002;</p>
<p>5&#xFF1A;&#x957F;&#x671F;&#x9879;&#x76EE;&#x8FD8;&#x662F;&#x77ED;&#x671F;&#x9879;&#x76EE;</p>
<p>&#x77ED;&#x671F;&#x9879;&#x76EE;&#x7528;&#x6765;&#x7EC3;&#x624B;&#xFF0C;&#x957F;&#x671F;&#x9879;&#x76EE;&#x6765;&#x5403;&#x65F6;&#x95F4;&#x6760;&#x6746;&#x590D;&#x5229;&#x3002;</p>
<p>&#x65B0;&#x4EBA;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x505A;&#x77ED;&#x671F;&#x7684;&#x9879;&#x76EE;&#x6765;&#x7EC3;&#x624B;&#xFF0C;&#x5148;&#x4ECE;&#x8D5A;&#x5230;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#x5F00;&#x59CB;&#xFF0C;&#x5F62;&#x6210;&#x6B63;&#x53CD;&#x9988;&#x3002;&#x8BF4;&#x5230;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x5C1D;&#x8BD5;&#x505A;&#x8FC7;&#x526F;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x9F13;&#x6363;&#x4E86;&#x597D;&#x4E45;&#x53D1;&#x73B0;&#x6CA1;&#x6709;&#x6B63;&#x53CD;&#x9988;&#xFF0C;1&#x6BDB;&#x94B1;&#x90FD;&#x8D5A;&#x4E0D;&#x5230;&#xFF0C;&#x5F88;&#x6CAE;&#x4E27;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4E5F;&#x53D1;&#x751F;&#x8FC7;&#xFF0C;&#x522B;&#x770B;&#x6211;&#x603B;&#x7ED3;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x63D0;&#x5230;&#x7684;&#x526F;&#x4E1A;&#x90FD;&#x662F;&#x6211;&#x8D5A;&#x5230;&#x94B1;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6211;&#x5C1D;&#x8BD5;&#x4E86;&#x653E;&#x5F03;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x8D5A;&#x5230;&#x94B1;&#x653E;&#x5F03;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x73B0;&#x5728;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6CA1;&#x8D5A;&#x5230;&#x94B1;&#x800C;&#x653E;&#x5F03;&#xFF0C;&#x6211;&#x4F1A;&#x8003;&#x8651;&#x989D;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x80FD;&#x529B;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x505A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x7EFC;&#x5408;&#x8003;&#x8651;&#xFF0C;&#x505A;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x9664;&#x4E86;&#x8D5A;&#x94B1;&#x4E4B;&#x5916;&#x662F;&#x5426;&#x80FD;&#x5B66;&#x5230;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x6211;&#x5C31;&#x7EE7;&#x7EED;&#xFF0C;&#x5982;&#x679C;&#x6280;&#x80FD;&#x90FD;&#x5B66;&#x4F1A;&#x4E86;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x8D5A;&#x5230;&#x94B1;&#xFF0C;&#x6211;&#x518D;&#x8003;&#x8651;&#x653E;&#x5F03;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x5148;&#x8BF4;&#x8FD9;&#x4E9B;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x8981;&#x5C55;&#x5F00;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x9636;&#x6BB5;&#x505A;&#x6CD5;&#x5176;&#x5B9E;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5F88;&#x591A;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x6CA1;&#x7406;&#x987A;&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5927;&#x5BB6;&#x5982;&#x679C;&#x60F3;&#x770B;&#x8FD9;&#x79CD;&#x7CFB;&#x5217;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x53BB;&#x5F52;&#x7EB3;&#x548C;&#x603B;&#x7ED3;&#xFF0C;&#x5199;&#x4E00;&#x4E9B;&#x6211;&#x7684;&#x611F;&#x609F;&#x3002;</p>
<p>&#x9760;&#x8FD1;&#x62FF;&#x5230;&#x8FC7;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#xFF0C;&#x542C;&#x542C;&#x5BF9;&#x65B9;&#x7684;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5FEB;&#x901F;&#x8FDB;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/9816eb9bfa31a2f181bce0d27cd39b92.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-创业/" rel="tag"># 后端,创业</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7337849561480839231.html" rel="next" title="AI副业最赚钱的应该就是卖课了吧">
                <i class="fa fa-chevron-left"></i> AI副业最赚钱的应该就是卖课了吧
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7338250632938455049.html" rel="prev" title="Jetpack Compose -> 重组作用域和remem">
                Jetpack Compose -> 重组作用域和remem <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
