<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,Java,程序员,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x4E09;&amp;#x54E5; &amp;#x4E2A;&amp;#x4EBA;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF1A;j3code.cn &amp;#x672C;&amp;#x6587;&amp;#x5DF2;&amp;#x6536;&amp;#x5F55;&amp;#x5230;&amp;#x8BED;&amp;#x96C0;&amp;#xFF1A;www.yuque.com/j3code/me-p&amp;#x2026;  &amp;">
<meta name="keywords" content="后端,Java,程序员">
<meta property="og:type" content="article">
<meta property="og:title" content="进电子厂了，感触颇多 故事 有感">
<meta property="og:url" content="https://dev.newban.cn/7343132138655858724.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x4E09;&amp;#x54E5; &amp;#x4E2A;&amp;#x4EBA;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF1A;j3code.cn &amp;#x672C;&amp;#x6587;&amp;#x5DF2;&amp;#x6536;&amp;#x5F55;&amp;#x5230;&amp;#x8BED;&amp;#x96C0;&amp;#xFF1A;www.yuque.com/j3code/me-p&amp;#x2026;  &amp;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5be30139bc49e4368a959b4c062f7c22ab45e63046b9369e280b34127fd59cb0">
<meta property="og:updated_time" content="2024-04-27T08:01:42.985Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="进电子厂了，感触颇多 故事 有感">
<meta name="twitter:description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x4E09;&amp;#x54E5; &amp;#x4E2A;&amp;#x4EBA;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF1A;j3code.cn &amp;#x672C;&amp;#x6587;&amp;#x5DF2;&amp;#x6536;&amp;#x5F55;&amp;#x5230;&amp;#x8BED;&amp;#x96C0;&amp;#xFF1A;www.yuque.com/j3code/me-p&amp;#x2026;  &amp;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5be30139bc49e4368a959b4c062f7c22ab45e63046b9369e280b34127fd59cb0">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7343132138655858724.html">





  <title>进电子厂了，感触颇多 故事 有感 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">进电子厂了，感触颇多 故事 有感</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-03-06T18:06:26+08:00">
                2024-03-06
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x4E09;&#x54E5;</p>
<p>&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#xFF1A;<a href="/external_links/8b8a81a02fadea70207b849b3307ccec.html" target="blank" rel="noopener">j3code.cn</a></p>
<p>&#x672C;&#x6587;&#x5DF2;&#x6536;&#x5F55;&#x5230;&#x8BED;&#x96C0;&#xFF1A;<a href="/external_links/e713254e52d0aec4bb00a852e2fb435a.html" target="blank" rel="noopener">www.yuque.com/j3code/me-p&#x2026;</a></p>
</blockquote>
<p>&#x662F;&#x7684;&#xFF0C;&#x771F;&#x8FDB;&#x7535;&#x5B50;&#x5382;&#x4E86;&#xFF0C;&#x4F46;&#x4E3B;&#x4EBA;&#x516C;&#x4E0D;&#x662F;&#x6211;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x4E0D;&#x662F;&#x4E3B;&#x4EBA;&#x516C;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x548C;&#x4E3B;&#x4EBA;&#x516C;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x771F;&#x5B9E;&#x800C;&#x53C8;&#x65E0;&#x5948;&#x3002;&#x771F;&#x5B9E;&#x662F;&#x771F;&#x771F;&#x5207;&#x5207;&#x7684;&#x7ECF;&#x5386;&#x4E86;&#x8FD9;&#x4E00;&#x6BB5;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x65E0;&#x5948;&#x5219;&#x662F;&#x6211;&#x8FDB;&#x5382;&#x8FD9;&#x6BB5;&#x65C5;&#x7A0B;&#x6240;&#x4F53;&#x4F1A;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6211;&#x7684;&#x8FD9;&#x6BB5;&#x7ECF;&#x5386;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x4EE5;&#x8010;&#x5FC3;&#x7684;&#x5F80;&#x4E0B;&#x770B;&#x3002;</p>
<h1 id="&#x6545;&#x4E8B;"><a href="#&#x6545;&#x4E8B;" class="headerlink" title="&#x6545;&#x4E8B;"></a>&#x6545;&#x4E8B;</h1><p>&#x8FD9;&#x91CC;&#x6211;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4E3B;&#x4EBA;&#x516C; A&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x6765;&#x6211;&#x8FD9;&#x8FB9;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4F5C;&#x4E3A;&#x5728;&#x5E7F;&#x5DDE;&#x5F85;&#x4E86;&#x6709;&#x4E9B;&#x5E74;&#x5934;&#x7684;&#x9753;&#x4ED4;&#xFF08;&#x4E00;&#x5764;&#x5E74;&#x591A;&#x70B9;&#xFF09;&#xFF0C;&#x80AF;&#x5B9A;&#x8981;&#x51FA;&#x65F6;&#x95F4;&#x7ED9;&#x4ED6;&#x5F20;&#x7F57;&#x5F20;&#x7F57;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6709;&#x4E86;&#x8FD9;&#x4E00;&#x6BB5;&#x96BE;&#x5FD8;&#x7684;&#x7ECF;&#x5386;&#xFF08;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x60F3;&#x518D;&#x7ECF;&#x5386;&#x7B2C;&#x4E8C;&#x6B21;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x5E7F;&#x5DDE;&#x6CA1;&#x6709;&#x5B66;&#x5386;&#xFF0C;&#x80FD;&#x9009;&#x62E9;&#x7684;&#x5DE5;&#x4F5C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x8FDB;&#x5382;&#x6216;&#x8005;&#x6253;&#x96F6;&#x5DE5;&#x5F53;&#x5B66;&#x5F92;&#x3002;&#x4F46;&#x5948;&#x4F55;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x95E8;&#x9053;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x5E2E;&#x7740;&#x4ECE;&#x67D0;&#x76F4;&#x8058;&#x8F6F;&#x4EF6;&#x4E0A;&#x5237;&#x5DE5;&#x4F5C;&#x5C97;&#x4F4D;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x662F;&#x4E0D;&#x8981;&#x6C42;&#x7ECF;&#x9A8C;&#xFF0C;&#x5B66;&#x5386;&#x7684;&#x7EDF;&#x7EDF;&#x90FD;&#x662F;&#x6211;&#x5907;&#x9009;&#x5C97;&#x4F4D;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x5728;&#x67D0;&#x76F4;&#x8058;&#x8F6F;&#x4EF6;&#x4E0A;&#xFF0C;&#x5237;&#x8FD9;&#x79CD;&#x666E;&#x5DE5;&#x3001;&#x914D;/&#x62E3;/&#x6253;&#x5305;&#x7B49;&#x5C97;&#x4F4D;&#x4E00;&#x5237;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x81EA;&#x52A8;&#x627E;&#x4E0A;&#x95E8;&#x6765;&#xFF0C;&#x4E0D;&#x50CF;&#x6211;&#x73B0;&#x5728;&#x5E72;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x884C;&#x4E1A;&#xFF0C;&#x8981;&#x4E48;&#x8FDB;&#x4EBA;&#x624D;&#x5E93;&#x8981;&#x4E48;&#x4EBA;&#x624D;&#x5E93;&#x90FD;&#x4E0D;&#x914D;&#x8FDB;&#xFF0C;&#x53EA;&#x80FD;&#x77F3;&#x6C89;&#x5927;&#x6D77;&#x3002;</p>
<p>&#x5728;&#x7ED3;&#x5408; A &#x81EA;&#x8EAB;&#x7684;&#x60C5;&#x51B5;&#x548C;&#x4EA4;&#x901A;&#x51FA;&#x884C;&#x65B9;&#x4FBF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x63A5;&#x53D7;&#x8FDB;&#x5382;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x53D1;&#x7684;&#x5F85;&#x9047;&#x4FE1;&#x606F;&#x786E;&#x5B9E;&#x5F88;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x5982;&#xFF1A;&#x5C0F;&#x65F6;&#x5DE5; 30/&#x5C0F;&#x65F6;&#xFF0C;&#x591A;&#x52B3;&#x591A;&#x7684;&#xFF1B;&#x6B63;&#x5F0F;&#x5DE5;&#x5E95;&#x85AA;&#x52A0;&#x63D0;&#x6210;&#x7EFC;&#x5408;&#x85AA;&#x8D44;7-8k&#xFF1B;&#x8FD8;&#x5305;&#x5403;&#x5305;&#x4F4F;&#x3002;&#x4F60;&#x770B;&#xFF0C;&#x8FD9;&#x600E;&#x4E48;&#x80FD;&#x4E0D;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x4E0D;&#x5438;&#x5F15;&#x4E00;&#x4E2A;&#x4EE5;&#x524D;&#x53EA;&#x80FD;&#x62FF; 2-3k &#x5DE5;&#x8D44;&#x4E0D;&#x5305;&#x5403;&#x4E0D;&#x5305;&#x4F4F;&#x7684;&#x4E3B;&#x4EBA;&#x516C; A &#x5462;&#xFF01;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x4E5F;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x53EF;&#x4EE5;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4E0D;&#x5047;&#x601D;&#x7D22;&#x7684;&#x548C;&#x4E3B;&#x4EBA;&#x516C; A &#x8FBE;&#x6210;&#x4E86;&#x7EDF;&#x4E00;&#x6218;&#x7EBF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x96BE;&#x5FD8;&#x4E4B;&#x65C5;&#x5C31;&#x7531;&#x6B64;&#x5C55;&#x5F00;&#x4E86;&#x3002;</p>
<p>&#x5148;&#x662F;&#x65E9;&#x4E0A;&#x6309;&#x7167;&#x4ED6;&#x4EEC;&#x5FAE;&#x4FE1;&#x4E0A;&#x804A;&#x7684;&#xFF0C;&#x5E26;&#x597D;&#x884C;&#x674E;&#xFF0C;&#x8EAB;&#x4EFD;&#x8BC1;&#x53BB;&#x4E00;&#x4E2A;&#x4EA4;&#x901A;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x5730;&#x94C1;&#x53E3;&#x9762;&#x8BD5;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x5728;&#x60F3;&#x53BB;&#x9762;&#x4E2A;&#x8BD5;&#x5E26;&#x884C;&#x674E;&#x5E72;&#x5565;&#xFF0C;&#x6211;&#x653E;&#x5728;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x633A;&#x597D;&#x7684;&#xFF0C;&#x7B49;&#x9762;&#x8BD5;&#x901A;&#x8FC7;&#x4E86;&#xFF0C;&#x5B89;&#x6392;&#x4F4F;&#x5BBF;&#x7684;&#x5730;&#x65B9;&#x4E86;&#xFF0C;&#x6211;&#x5728;&#x5C06;&#x884C;&#x674E;&#x642C;&#x8FC7;&#x53BB;&#xFF0C;&#x8FD9;&#x4E0D;&#x7B80;&#x5355;&#x8F7B;&#x677E;&#x561B;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x548C;&#x4E3B;&#x4EBA;&#x516C; A &#xFF0C;&#x5C31;&#x4E00;&#x81F4;&#x51B3;&#x5B9A;&#x6CA1;&#x6709;&#x5E26;&#x884C;&#x674E;&#x8FC7;&#x53BB;&#xFF0C;&#x76F4;&#x63A5;&#x4EBA; + &#x8EAB;&#x4EFD;&#x8BC1;&#x8FC7;&#x53BB;&#x9762;&#x8BD5;&#xFF0C;&#x7136;&#x800C;&#x5947;&#x602A;&#x7684;&#x70B9;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5230;&#x8FBE;&#x9762;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x65F6;&#xFF0C;&#x89C1;&#x5230;&#x597D;&#x591A;&#x5916;&#x6765;&#x52A1;&#x5DE5;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E00;&#x5E55;&#x8BA9;&#x6211;&#x6709;&#x70B9;&#x89E6;&#x52A8;&#x3002;&#x90FD;&#x662F;&#x5927;&#x5305;&#x5C0F;&#x5305;&#xFF0C;&#x86C7;&#x76AE;&#x888B;+&#x9ED1;&#x884C;&#x674E;&#x7BB1;&#xFF0C;&#x7136;&#x800C;&#x6211;&#x4E24;&#x5374;&#x7A7A;&#x7A7A;&#x5982;&#x4E5F;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x6CA1;&#x610F;&#x8BC6;&#x5230;&#x95EE;&#x9898;&#x7684;&#x4E25;&#x91CD;&#x6027;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x8FC7;&#x53BB;&#x95EE;&#x600E;&#x4E48;&#x9762;&#x8BD5;&#xFF0C;&#x800C;&#x90A3;&#x4E2A;&#x7A7F;&#x84DD;&#x8272;&#x5DE5;&#x4F5C;&#x670D;&#x7684;&#x4EBA;&#x53EA;&#x662F;&#x62AC;&#x5934;&#x6487;&#x4E86;&#x6211;&#x4E00;&#x773C;&#xFF0C;&#x770B;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x884C;&#x674E;&#xFF0C;&#x76F4;&#x63A5;&#x62AC;&#x624B;&#x6325;&#x4E86;&#x6325;&#xFF0C;&#x8BF4;&#x6CA1;&#x884C;&#x674E;&#x7684;&#x4E0D;&#x6536;&#x3002;&#x6211;&#x8BF4;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x4ED6;&#x4E5F;&#x4E0D;&#x642D;&#x7406;&#x6211;&#xFF0C;&#x76F4;&#x63A5;&#x8BF4;&#x522B;&#x59A8;&#x788D;&#x540E;&#x9762;&#x7684;&#x4EBA;&#x9762;&#x8BD5;&#xFF08;&#x5176;&#x5B9E;&#x540E;&#x9762;&#x4E5F;&#x6CA1;&#x4EBA;&#xFF09;&#xFF0C;&#x4E0D;&#x6536;&#x5C31;&#x662F;&#x4E0D;&#x6536;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x5DF2;&#x7ECF;&#x5FCD;&#x4E0D;&#x4E86;&#x4E86;&#xFF0C;&#x5148;&#x8BF4;&#x4E00;&#x4E0B;&#x6B64;&#x523B;&#x6211;&#x7684;&#x5185;&#x5FC3;&#xFF1A;diss &#x4ED6;&#x4E0A;&#x4E0B; 18 &#x4EE3;&#x65E0;&#x6570;&#x904D;&#x4E86;&#xFF0C;&#x540E;&#x9762;&#x7EC6;&#x8BB2;&#xFF0C;&#x54B1;&#x4EEC;&#x5148;&#x770B;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x6211;&#x5F53;&#x65F6;&#x662F;&#x60F3;&#x76F4;&#x63A5;&#x603C;&#x4ED6;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x4E3B;&#x4EBA;&#x516C; A &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x5FCD;&#x4E86;&#xFF0C;&#x91CD;&#x65B0;&#x56DE;&#x5BB6;&#x53BB;&#x62FF;&#x4E86;&#x4E00;&#x6B21;&#x884C;&#x674E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x53BB;&#x9762;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x627E;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x4E0D;&#x662F;&#x4E0A;&#x4E00;&#x4E2A;&#x5730;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x53E6;&#x4E00;&#x4E2A;&#x5907;&#x9009;&#x9762;&#x8BD5;&#xFF08;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x884C;&#x674E;&#xFF0C;&#x8FD8;&#x662F;&#x884C;&#x674E;&#xFF09;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x4EBA;&#x62D6;&#x7740;&#x4E2A;&#x884C;&#x674E;&#xFF0C;&#x917F;&#x917F;&#x8DC4;&#x8DC4;&#x7684;&#x6765;&#x5230;&#x4E86;&#x4E0B;&#x4E00;&#x4E2A;&#x9762;&#x8BD5;&#x70B9;&#xFF0C;&#x8FD8;&#x662F;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x9762;&#x8BD5;&#x70B9;&#x4E00;&#x6837;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x6211;&#x5E26;&#x4E86;&#x884C;&#x674E;&#xFF0C;ok&#xFF0C;&#x4ED6;&#x63A5;&#x6536;&#x4E86;&#xFF0C;&#x8BF4;&#x7B49;&#x4F1A;&#x5B89;&#x6392;&#x9762;&#x8BD5;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4EE5;&#x4E3A;&#x8FD9;&#x5C31;&#x5B8C;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x5F00;&#x59CB;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;</p>
<p>&#x7B49;&#x4E86;&#x4E00;&#x4F1A;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x9762;&#x8BD5;&#x70B9;&#x5C31;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x7684;&#x6765;&#x4E86;&#x4E8C;&#x4E09;&#x5341;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E5F;&#x8FD8;&#x662F;&#x548C;&#x6211;&#x4E0A;&#x6B21;&#x770B;&#x5230;&#x7684;&#x4EBA;&#x7FA4;&#x4E00;&#x6837;&#xFF0C;&#x5927;&#x5305;&#x5C0F;&#x5305;&#xFF0C;&#x86C7;&#x76AE;&#x888B;+&#x9ED1;&#x8272;&#x884C;&#x674E;&#x7BB1;&#x3002;&#x6B64;&#x65F6;&#x6211;&#x5185;&#x5FC3;&#x5C31;&#x4E0D;&#x4EC5;&#x611F;&#x6168;&#xFF0C;&#x4E3A;&#x4E86;&#x4E2A;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x7B49;&#x4E86;&#x5DEE;&#x4E0D;&#x591A;&#x5341;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x6709;&#x4E2A;&#x55D3;&#x95E8;&#x5927;&#x7684;&#x4EBA;&#x558A;&#xFF0C;&#x8981;&#x9762;&#x8BD5;&#x7684;&#x4EBA;&#x8DDF;&#x6211;&#x6765;&#xFF0C;&#x5E26;&#x4E0A;&#x884C;&#x674E;&#xFF0C;&#x6CA1;&#x884C;&#x674E;&#x7684;&#x4E0D;&#x8981;&#x6765;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x548C;&#x4E3B;&#x4EBA;&#x516C; A &#x88AB;&#x5E26;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#x7684;&#x5927;&#x5385;&#xFF0C;&#x91CC;&#x9762;&#x5DEE;&#x4E0D;&#x591A;&#x5BB9;&#x7EB3;&#x4E86;&#x51E0;&#x767E;&#x4EBA;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x53C8;&#x88AB;&#x89E6;&#x52A8;&#x4E86;&#xFF08;&#x662F;&#x7684;&#xFF0C;&#x4EE5;&#x6211;&#x76EE;&#x524D;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x6211;&#x8FD9;&#x6BB5;&#x7ECF;&#x5386;&#x4F1A;&#x88AB;&#x89E6;&#x52A8;&#x5F88;&#x591A;&#x6B21;&#xFF09;&#xFF0C;&#x611F;&#x89C9;&#x8FDB;&#x4E86;&#x4F20;&#x9500;&#x4E00;&#x6837;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5be30139bc49e4368a959b4c062f7c22ab45e63046b9369e280b34127fd59cb0" alt></p>
<p>&#x4ECE;&#x8FDB;&#x5165;&#x90A3;&#x4E2A;&#x5927;&#x5385;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x65E0;&#x529B;&#xFF0C;&#x8FD9;&#x79CD;&#x65E0;&#x529B;&#x611F;&#x4F60;&#x53EA;&#x6709;&#x4EB2;&#x81EA;&#x4F53;&#x4F1A;&#x4E86;&#x624D;&#x77E5;&#x9053;&#x3002;&#x5168;&#x662F;&#x4EBA;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x7B49;&#x7740;&#x53EB;&#x53F7;&#xFF0C;&#x5176;&#x4F59;&#x65F6;&#x95F4;&#x627E;&#x4E2A;&#x5730;&#x65B9;&#x5750;&#x7740;&#x3002;&#x5F53;&#x65F6;&#x5C31;&#x60F3;&#xFF0C;&#x8D70;&#x4E5F;&#x4E0D;&#x662F;&#x6765;&#x90FD;&#x6765;&#x4E86;&#xFF0C;&#x7559;&#x4E5F;&#x4E0D;&#x662F;&#x548C;&#x5370;&#x8C61;&#x4E2D;&#x7684;&#x9762;&#x8BD5;&#x592A;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x5728;&#x8FD9;&#x79CD;&#x5185;&#x5FC3;&#x7EA0;&#x7ED3;&#x4E2D;&#xFF0C;&#x5F98;&#x5F8A;&#x4E86;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x662F;&#x7684;&#x4F60;&#x6CA1;&#x770B;&#x9519;&#xFF0C;&#x5C31;&#x662F;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF08;&#x8D77;&#x7801;&#x4E24;&#x5C0F;&#x65F6;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x671F;&#x95F4;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x5957;&#x8DEF;&#xFF0C;&#x6211;&#x6015;&#x6587;&#x7AE0;&#x4F1A;&#x5199;&#x7684;&#x5F88;&#x957F;&#xFF0C;&#x5C31;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x60F3;&#x542C;&#xFF0C;&#x4EE5;&#x540E;&#x591A;&#x5173;&#x6CE8;&#x6211; B &#x7AD9;&#x76F4;&#x64AD;&#xFF0C;&#x6211;&#x4F1A;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#x8BB2;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EC8;&#x4E8E;&#x6709;&#x4E2A;&#x4EBA;&#x626F;&#x7740;&#x55D3;&#x95E8;&#x558A;&#x8BDD;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5B89;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x542C;&#x4ED6;&#x4ECB;&#x7ECD;&#x540E;&#x7EED;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x3002;&#x4ED6;&#x7684;&#x8BDD;&#x4E0D;&#x662F;&#x5F88;&#x7CBE;&#x70BC;&#xFF0C;&#x4F46;&#x662F;&#x8DB3;&#x591F;&#x6D17;&#x8111;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4F1A;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x673A;&#x7ED9;&#x8FD9;&#x4E9B;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x900F;&#x9732;&#xFF0C;&#x5728;&#x8BE5;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#x5DE5;&#x8D44;&#x6BD4;&#x7684;&#x8FC7;&#x5E7F;&#x5DDE;&#x5927;&#x591A;&#x6570;CBD&#x4E0A;&#x73ED;&#x7684;&#x767D;&#x9886;&#x3002;&#x53EA;&#x8981;&#x8FD9;&#x8BDD;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x4EBA;&#x7FA4;&#x5C31;&#x4F1A;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#x9A9A;&#x52A8;&#x51E0;&#x4E0B;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x80FD;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#x52A1;&#x5DE5;&#x4EBA;&#x62FC;&#x640F;&#x4E00;&#x5E74;&#x4E0D;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x591A;&#x8D5A;&#x70B9;&#x5417;&#xFF1F;&#x542C;&#x5230;&#x9AD8;&#x85AA;&#xFF0C;&#x773C;&#x775B;&#x53D1;&#x5149;&#x662F;&#x5728;&#x6B63;&#x5E38;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x770B;&#x4E0D;&#x60EF;&#x8FD9;&#x4E9B;&#x4E2D;&#x4ECB;&#x516C;&#x53F8;&#x5C42;&#x5C42;&#x5265;&#x5229;&#xFF0C;&#x538B;&#x69A8;&#x5FFD;&#x60A0;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x95ED;&#x585E;&#x7684;&#x5916;&#x6765;&#x52A1;&#x5DE5;&#x4EBA;&#x5458;&#xFF08;&#x6211;&#x8FD9;&#x662F;&#x4E8B;&#x540E;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4E0D;&#x662F;&#x5DE5;&#x5382;&#x76F4;&#x62DB;&#xFF0C;&#x800C;&#x662F;&#x4E2D;&#x4ECB;&#xFF09;&#x3002;</p>
<p>&#x53CD;&#x6B63;&#x4E00;&#x756A;&#x8BB2;&#x8BDD;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x88AB;&#x5206;&#x6210;&#x4E86;&#x4E24;&#x6279;&#x4EBA;&#xFF0C;&#x4E00;&#x6279;&#x5DE5;&#x8D44;&#x9AD8;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x73ED;&#x5730;&#x70B9;&#x5F02;&#x5E38;&#x7684;&#x504F;&#x50FB;&#xFF0C;&#x53E6;&#x4E00;&#x6279;&#x5C31;&#x662F;&#x5DE5;&#x8D44;&#x5730;&#x70B9;&#xFF0C;&#x4F46;&#x597D;&#x5728;&#x662F;&#x5E02;&#x91CC;&#xFF0C;&#x4EA4;&#x901A;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x5DE5;&#x4F5C;&#x9AD8;&#x4F4E;&#x4E5F;&#x662F;&#x9A97;&#x4EBA;&#x7684;&#xFF0C;&#x8BF4;&#x7684;&#x9AD8;&#x5DE5;&#x8D44;&#xFF0C;&#x53BB;&#x7684;&#x4EBA;&#x5C31;&#x591A;&#xFF0C;&#x4ED6;&#x4EEC;&#x62BD;&#x7684;&#x5229;&#x4E5F;&#x5C31;&#x591A;&#x3002;</p>
<p>&#x800C;&#x6211;&#x9009;&#x62E9;&#x5DE5;&#x8D44;&#x4F4E;&#x7684;&#x8FD9;&#x7C7B;&#x5DE5;&#x4F5C;&#x4E5F;&#x5C31;&#x662F;&#x770B;&#x4E2D;&#x4ED6;&#x4EA4;&#x901A;&#x65B9;&#x4FBF;&#xFF0C;&#x80FD;&#x65F6;&#x5E38;&#x7167;&#x987E;&#x4E00;&#x4E0B;&#xFF0C;&#x5E2E;&#x70B9;&#x5FD9;&#x5565;&#x7684;&#x3002;</p>
<p>&#x4F46;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x8FD9;&#x5C31;&#x5B8C;&#x4E86;&#x561B;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x3002;&#x4E4B;&#x540E;&#x7684;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x88AB;&#x4ED6;&#x4EEC;&#x7528;&#x5927;&#x5DF4;&#x8F66;&#x4ECE;&#x96C6;&#x5408;&#x70B9;&#x3001;&#x62C9;&#x5230;&#x7535;&#x5B50;&#x5382;&#x3001;&#x518D;&#x7531;&#x7535;&#x5B50;&#x5382;&#x62C9;&#x5230;&#x4F53;&#x68C0;&#x4E2D;&#x5FC3;&#x3001;&#x6700;&#x540E;&#x62C9;&#x5230;&#x5B89;&#x6392;&#x5BBF;&#x820D;&#x5927;&#x697C;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5730;&#x70B9;&#x7684;&#x5177;&#x4F53;&#x4E8B;&#x5B9C;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x96C6;&#x5408;&#x70B9;&#xFF1A;&#x5FFD;&#x60A0;&#x529E;&#x7535;&#x8BDD;&#x5361;&#xFF0C;&#x6253;&#x5370;&#x8EAB;&#x4EFD;&#x8BC1;&#xFF0C;&#x84DD;&#x5E95;&#x7167;&#x7247;&#x5236;&#x4F5C;&#xFF0C;&#x51E0;&#x767E;&#x53F7;&#x4EBA;&#x5206;&#x6210;&#x9AD8;&#x85AA;&#x8D44;&#x4E0E;&#x4F4E;&#x85AA;&#x8D44;&#x4E24;&#x6279;&#x4EBA;(&#x4F46;&#x90FD;&#x58F0;&#x79F0;&#x6BD4; CBD &#x767D;&#x9886;&#x85AA;&#x8D44;&#x9AD8;)&#x3002;</li>
<li>&#x7535;&#x5B50;&#x5382;&#xFF1A;&#x9762;&#x8BD5;&#xFF0C;&#x5F88;&#x5947;&#x8469;&#x7684;&#x9762;&#x8BD5;&#xFF0C;&#x5C31;&#x662F;&#x770B;&#x4F60;&#x7684;&#x9762;&#x76F8; + &#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x5168;&#x79F0;&#x4E00;&#x53E5;&#x8BDD;&#x90FD;&#x4E0D;&#x7528;&#x8BF4;&#x3002;</li>
<li>&#x4F53;&#x68C0;&#x4E2D;&#x5FC3;&#xFF1A;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x5355;&#x7EAF;&#x4F53;&#x68C0;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F53;&#x68C0;&#x5730;&#x70B9;&#x975E;&#x5E38;&#x8FDC;&#xFF0C;&#x975E;&#x5E38;&#x8FDC;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x662F;&#x548C;&#x8FD9;&#x79CD;&#x4E2D;&#x4ECB;&#x516C;&#x53F8;&#x6709;&#x7ED1;&#x5B9A;&#x5173;&#x7CFB;&#xFF0C;&#x8FD8;&#x662F;&#x62BD;&#x5229;&#x3002;</li>
<li>&#x5BBF;&#x820D;&#x5927;&#x697C;&#xFF1A;&#x5B89;&#x6392;&#x5BBF;&#x820D;&#xFF0C;&#x5982;&#x8702;&#x7A9D;&#x7164;&#x4E00;&#x6837;&#x7684;&#x683C;&#x5B50;&#x95F4;&#xFF0C;&#x8D85;&#x5BC6;&#x96C6;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x671F;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x5DE5;&#x4F5C;&#xFF0C;&#x6742;&#x4E03;&#x6742;&#x516B;&#x7684;&#x8D39;&#x7528;&#x5C31;&#x88AB;&#x4ED6;&#x4EEC;&#x6536;&#x53BB;&#x4E86; 200 &#x5757;&#xFF08;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x5361;&#xFF0C;&#x5982;&#x679C;&#x529E;&#x5361;&#x4E86;&#x4F30;&#x8BA1;&#x66F4;&#x591A;&#xFF09;&#x3002;&#x800C;&#x4E14;&#x4EE5;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x70B9;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x71AC;&#x4EBA;&#x7684;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7537;&#x5B50;&#x90FD;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x7D2F;&#x975E;&#x5E38;&#x7D2F;&#xFF0C;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4E9B;&#x5E74;&#x7EAA;&#x5C0F;&#x7684;&#x3001;&#x5E74;&#x7EAA;&#x5927;&#x7684;&#x3001;&#x5973;&#x751F;&#x662F;&#x5982;&#x4F55;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x7684;&#x3002;</p>
<p>&#x71AC;&#x4EBA;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4E00;&#x6279;&#x4EBA;&#x4E00;&#x6279;&#x4EBA;&#x7684;&#x8FC7;&#xFF0C;&#x8981;&#x7B49;&#x5230;&#x8FD9;&#x4E00;&#x6279;&#x4EBA;&#x7684;&#x6D41;&#x7A0B;&#x8D70;&#x5B8C;&#x4E86;&#x624D;&#x80FD;&#x8D70;&#x4E0B;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4E9B;&#x6D41;&#x7A0B;&#x53EA;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x624D;&#x5F00;&#x59CB;&#xFF0C;&#x6765;&#x65E9;&#x4E86;&#xFF0C;&#x4F60;&#x5C31;&#x7ED9;&#x6211;&#x7B49;&#x7740;&#xFF0C;&#x5230;&#x70B9;&#x624D;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5F53;&#x4F60;&#x5206;&#x914D;&#x5230;&#x4E00;&#x5F20;&#x4E0A;&#x4E0B;&#x94FA;&#x7684;&#x5E8A;&#x4F4D;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x8FD9;&#x4E00;&#x8D9F;&#x6D41;&#x7A0B;&#x5C31;&#x7B97;&#x662F;&#x5F7B;&#x5E95;&#x8D70;&#x5B8C;&#x4E86;&#xFF0C;&#x65F6;&#x95F4;&#x4E5F;&#x5E94;&#x8BE5;&#x662F;&#x6765;&#x5230;&#x4E86;&#x665A;&#x4E0A;&#x516D;&#x4E03;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x8FDB;&#x5382;&#x5DE5;&#x4F5C;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4ECE;&#x65E9;&#x4E0A;&#x4E5D;&#x70B9;&#x6298;&#x817E;&#x5230;&#x665A;&#x4E0A;&#x516D;&#x4E03;&#x70B9;&#xFF0C;&#x771F; TM &#x7D2F;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x6211;&#x4ECA;&#x5929;&#x4E00;&#x5929;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4F60;&#xFF0C;&#x4F60;&#x4F1A;&#x4E3A;&#x4E86;&#x8FDB;&#x5382;&#x800C;&#x8FD9;&#x6837;&#x6298;&#x817E;&#x5417;&#xFF1F;</p>
<h1 id="&#x6709;&#x611F;"><a href="#&#x6709;&#x611F;" class="headerlink" title="&#x6709;&#x611F;"></a>&#x6709;&#x611F;</h1><p>&#x4E0D;&#x7ECF;&#x5386;&#x4E00;&#x904D;&#xFF0C;&#x6C38;&#x8FDC;&#x662F;&#x4E0D;&#x80FD;&#x611F;&#x540C;&#x8EAB;&#x53D7;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x6545;&#x4E8B;&#x4F60;&#x4EEC;&#x770B;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x5185;&#x5FC3;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x4E00;&#x70B9;&#x6CE2;&#x6F9C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x6761;&#x4EF6;&#x5141;&#x8BB8;&#x6211;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x4EBA;&#xFF0C;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x8981;&#x6709;&#x8FD9;&#x79CD;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x6765;&#x5BF9;&#x8FD9;&#x79CD;&#x4E2D;&#x4ECB;&#x7B2C;&#x4E09;&#x65B9;&#x516C;&#x53F8;&#x62DB;&#x4EBA;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x6765;&#x8BF4;&#x8BF4;&#x6211;&#x7684;&#x770B;&#x6CD5;&#xFF1A;</p>
<blockquote>
<p>&#x4F60;&#x4EEC;&#x8981;&#x5148;&#x5206;&#x522B;&#x4EC0;&#x4E48;&#x662F;&#x5DE5;&#x5382;&#x76F4;&#x62DB;&#x8FD8;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x4E2D;&#x4ECB;&#x62DB;&#x8058;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4ECE;&#x67D0;&#x76F4;&#x8058;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x5C97;&#x4F4D;&#x5E94;&#x8BE5;&#x662F;&#x4F1A;&#x5199;&#x201C;&#x6D3E;&#x9063;&#x201D;&#x6216;&#x8005;&#x201C;&#x4EE3;&#x62DB;&#x201D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x6709;&#x4E0D;&#x5199;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x540E;&#x7EED;&#x7684;&#x5224;&#x65AD;&#x4E86;&#x201C;&#x6CA1;&#x6709;&#x884C;&#x674E;&#x4E0D;&#x63A5;&#x5F85;&#x201D;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x624D;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x9762;&#x8BD5;&#xFF0C;&#x4E0D;&#x5E26;&#x884C;&#x674E;&#xFF0C;&#x4ED6;&#x4EEC;&#x63A5;&#x5F85;&#x4F60;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x4F60;&#x5B89;&#x6392;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x4F60;&#x4E2D;&#x9014;&#x89C9;&#x5F97;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x4F60;&#x662F;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8D70;&#x4EBA;&#x7684;&#xFF0C;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x9EBB;&#x70E6;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5927;&#x5305;&#x5C0F;&#x5305; + &#x9ED1;&#x8272;&#x884C;&#x674E;&#x7BB1;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x90A3;&#x4E48;&#x65B9;&#x4FBF;&#x7684;&#x968F;&#x65F6;&#x60F3;&#x8D70;&#x5C31;&#x8D70;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x884C;&#x674E;&#x5C31;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x4E2D;&#x4ECB;&#x62F7;&#x4F4F;&#x4F60;&#x7684;&#x52A0;&#x9501;&#x3002;</p>
<p>&#x4F60;&#x4EEC;&#x4E5F;&#x4E0D;&#x8981;&#x76F8;&#x4FE1;&#x4ECE;&#x67D0;&#x76F4;&#x8058;&#x4E0A;&#x52A0;&#x7684;&#x6240;&#x8C13;&#x4EBA;&#x4E8B;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5F15;&#x4F60;&#x5230;&#x9762;&#x8BD5;&#x7684;&#x5730;&#x70B9;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x90FD;&#x662F;&#x5047;&#x8BDD;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x90FD;&#x662F;&#x5047;&#x8BDD;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x4EE5;&#x540E;&#x4E0D;&#x5E78;&#x78B0;&#x5230;&#x6211;&#x4E0A;&#x9762;&#x7684;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5BF9;&#x8FD9;&#x79CD;&#x4EBA;&#x62B1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x611F;&#x6FC0;&#xFF0C;&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x771F;&#x597D;&#xFF0C;&#x4E3A;&#x4E86;&#x7ED9;&#x6211;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x673A;&#x4F1A;&#xFF0C;&#x89E3;&#x7B54;&#x6211;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;&#x9192;&#x9192;&#x5427;&#xFF01;&#x4F60;&#x7684;&#x771F;&#x8BDA;/&#x611F;&#x6FC0;&#x4E4B;&#x60C5;&#x771F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5582;&#x4E86;&#x72D7;&#xFF08;&#x72D7;&#x5B50;&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x62FF;&#x4F60;&#x505A;&#x5BF9;&#x6BD4;&#xFF09;&#xFF0C;&#x4F60;&#x5E26;&#x7740;&#x771F;&#x8BDA;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x95EE;&#x4F60;&#x6240;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x4F1A;&#x7528;&#x9AD8;&#x85AA;&#xFF0C;&#x8F7B;&#x677E;&#x7B49;&#x8BDD;&#x672F;&#x8FF7;&#x60D1;&#x4F60;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x62DB;&#x5230;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x62FF;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x63D0;&#x6210;&#xFF0C;&#x4F60;&#x4EEC;&#x53EA;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x8D5A;&#x94B1;&#x5DE5;&#x5177;&#xFF0C;&#x624D;&#x4E0D;&#x4F1A;&#x7BA1;&#x4F60;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x662F;&#x5426;&#x771F;&#x9AD8;&#x85AA;&#xFF0C;&#x771F;&#x8F7B;&#x677E;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E3A;&#x5565;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x4E0D;&#x4E0A;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x7B2C;&#x4E09;&#x65B9;&#x516C;&#x53F8;&#x505A;&#x4E8B;&#x6548;&#x7387;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4E00;&#x5929;&#x529E;&#x7406;&#x51E0;&#x767E;&#x4EBA;&#x7684;&#x5165;&#x804C;&#x6D41;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x5C31;&#x662F;&#x8BA9;&#x4F60;&#x4EEC;&#x5165;&#x804C;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x63D0;&#x6210;&#x3002;&#x5982;&#x679C;&#x7B49;&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#x4F60;&#x4EEC;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x540E;&#x6094;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x5C31;&#x6CA1;&#x94B1;&#x53EF;&#x8D5A;&#x4E86;&#x3002;&#x6548;&#x7387;&#x5FEB;&#x662F;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x5957;&#x6D41;&#x7A0B;&#x4E0B;&#x6765;&#xFF0C;&#x4F60;&#x4EEC;&#x6709;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#xFF0C;&#x8FDE;&#x5348;&#x996D;&#x65F6;&#x95F4;&#x90FD;&#x4E0D;&#x7ED9;&#x4EBA;&#x4E86;&#xFF08;&#x5C31;&#x6015;&#x4F60;&#x4EEC;&#x6E9C;&#x8D70;&#xFF09;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x662F;&#x6CA1;&#x5403;&#x5348;&#x996D;&#xFF0C;&#x786C;&#x6491;&#x7740;&#x8D70;&#x5B8C;&#x4E86;&#x4E00;&#x5929;&#x3002;&#x800C;&#x4E14;&#x5728;&#x540E;&#x7EED;&#x6211;&#x4E0E;&#x540C;&#x884C;&#x7684;&#x6253;&#x5DE5;&#x4EBA;&#x4EA4;&#x8C08;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x65E9;&#x996D;&#x90FD;&#x6CA1;&#x5403;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x70B9;&#x90FD;&#x884C;&#x6CA1;&#x5403;&#xFF0C;&#x6765;&#x6765;&#x56DE;&#x56DE;&#x6298;&#x817E;&#x4E00;&#x6574;&#x5929;&#xFF0C;&#x76F4;&#x5230;&#x665A;&#x4E0A;&#x624D;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x5403;&#x996D;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x6015;&#x4F60;&#x8D70;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x5165;&#x804C;&#x6D41;&#x7A0B;&#x5DF2;&#x7ECF;&#x529E;&#x5B8C;&#x4E86;&#xFF0C;&#x8BE5;&#x4EA4;&#x7684;&#x94B1;&#x4E5F;&#x4EA4;&#x4E86;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5957;&#x8DEF;&#x53EA;&#x662F;&#x6211;&#x7ECF;&#x5386;&#x8FC7;&#x5F97;&#x4E00;&#x79CD;&#xFF0C;&#x4F46;&#x80AF;&#x5B9A;&#x4E0D;&#x6B62;&#x8FD9;&#x4E00;&#x79CD;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x80FD;&#x63D0;&#x524D;&#x8FA8;&#x522B;&#xFF01;</p>
</blockquote>
<p>&#x63A5;&#x7740;&#xFF0C;&#x6211;&#x6765;&#x8BF4;&#x8BF4;&#x8FD9;&#x4E00;&#x5929;&#xFF0C;&#x6211;&#x4E0E;&#x540C;&#x884C;&#x4EBA;&#x4EA4;&#x8C08;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x5404;&#x79CD;&#x4EBA;&#x751F;&#x7ECF;&#x5386;&#xFF1A;</p>
<blockquote>
<p>&#x867D;&#x7136;&#x6211;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4F46;&#x7EDD;&#x4E0D;&#x662F;&#x90A3;&#x79CD;&#x6C89;&#x95F7;&#x4E0D;&#x7231;&#x793E;&#x4EA4;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x76F8;&#x53CD;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x7231;&#x548C;&#x4EBA;&#x4EA4;&#x8C08;&#x7684;&#xFF0C;&#x7231;&#x542C;&#x522B;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#x4E5F;&#x7231;&#x548C;&#x522B;&#x4EBA;&#x5206;&#x4EAB;&#x6211;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x6211;&#x78B0;&#x5230;&#x7684;<strong>&#x7B2C;&#x4E00;&#x79CD;&#x4EBA;</strong>&#x5C31;&#x662F;&#x672A;&#x6EE1; 18 &#x5C81;&#x7684;&#x5C0F;&#x5B69;&#xFF0C;&#x6545;&#x4E8B;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x6211;&#x63D0;&#x8FC7;&#xFF0C;&#x524D;&#x671F;&#x6211;&#x662F;&#x88AB;&#x4EBA;&#x5E26;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x5385;&#x96C6;&#x5408;&#x7684;&#xFF0C;&#x4E4B;&#x540E;&#xFF0C;&#x672A;&#x6EE1; 18 &#x5C81;&#x7684;&#x5C0F;&#x5B69;&#x5C31;&#x88AB;&#x6240;&#x8C13;&#x7684;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x7ED9;&#x7B5B;&#x9009;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x8BF4;&#x662F;&#x7B5B;&#x9009;&#x51FA;&#x6765;&#xFF0C;&#x80AF;&#x5B9A;&#x4E5F;&#x4E0D;&#x662F;&#x8BA9;&#x4ED6;&#x4EEC;&#x8D70;&#xFF0C;&#x53EA;&#x662F;&#x5B89;&#x6392;&#x4ED6;&#x4EEC;&#x53BB;&#x90A3;&#x79CD;&#x66F4;&#x504F;&#x50FB;&#x3001;&#x5DE5;&#x8D44;&#x66F4;&#x4F4E;&#x4E00;&#x70B9;&#x7684;&#x3001;&#x5BF9;&#x5E74;&#x9F84;&#x8981;&#x6C42;&#x4E0D;&#x4E25;&#x683C;&#x7684;&#x5C0F;&#x5382;&#x5DE5;&#x4F5C;&#x3002;&#x53CD;&#x6B63;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4EBA;&#x5934;&#x8FDB;&#x5165;&#x5DE5;&#x5382;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD9;&#x79CD;&#x4E2D;&#x4ECB;&#x5C31;&#x6709;&#x94B1;&#x8D5A;&#xFF0C;&#x53EA;&#x662F;&#x4ECE;&#x4F60;&#x8EAB;&#x4E0A;&#x8D5A;&#x591A;&#x8D5A;&#x5C11;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x770B;&#x7740;&#x8FD9;&#x51E0;&#x4E2A;&#x672A;&#x6EE1; 18 &#x5C81;&#x5C31;&#x51FA;&#x6765;&#x6253;&#x5DE5;&#x7684;&#x5C0F;&#x5B69;&#xFF0C;&#x5185;&#x5FC3;&#x591A;&#x5C11;&#x90FD;&#x662F;&#x6709;&#x70B9;&#x4E0D;&#x662F;&#x6ECB;&#x5473;&#x3002;&#x6BD5;&#x7ADF;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x662F;&#x5446;&#x5728;&#x6821;&#x56ED;&#xFF0C;&#x4E14;&#x6B63;&#x5904;&#x4E8E;&#x9AD8;&#x4E2D;&#xFF0C;&#x6B63;&#x662F;&#x8BFB;&#x4E66;&#x6539;&#x53D8;&#x547D;&#x8FD0;&#x7684;&#x5173;&#x952E;&#x65F6;&#x523B;&#x3002;&#x4F46;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x79CD;&#x518D;&#x6B21;&#x8BFB;&#x4E66;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x4F1A;&#x5728;&#x8FD9;&#x51E0;&#x4E2A;&#x5C0F;&#x5B69;&#x8EAB;&#x4E0A;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x548C;&#x8FD9;&#x51E0;&#x4E2A;&#x5C0F;&#x5B69;&#x8BF4;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x8D70;&#x51FA;&#x6821;&#x56ED;&#xFF0C;&#x8D70;&#x51FA;&#x5BB6;&#x5EAD;&#xFF0C;&#x800C;&#x9009;&#x62E9;&#x6B65;&#x5165;&#x793E;&#x4F1A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x51E0;&#x4E2A;&#x5F80;&#x540E;&#x80FD;&#x4E00;&#x5E06;&#x98CE;&#x987A;&#xFF0C;&#x6539;&#x5929;&#x6362;&#x547D;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x79CD;&#x4EBA;</strong>&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x548C;&#x4ED6;&#x8BF4;&#x8BDD;&#xFF0C;&#x6211;&#x5173;&#x6CE8;&#x5230;&#x4ED6;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x6BB5;&#x5BF9;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x62DB;&#x4EBA;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x8BF4;&#xFF1A;&#x770B;&#x4F60;&#x5E74;&#x9F84;&#x6BD4;&#x8F83;&#x504F;&#x5927;&#xFF0C;&#x90FD; 45 &#x4E86;&#xFF1F;</p>
<p>&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#xFF1A;&#x662F;&#xFF0C;&#x786E;&#x5B9E;&#x5927;&#x4E86;&#x70B9;&#x3002;</p>
<p>&#x62DB;&#x4EBA;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x8BF4;&#xFF1A;&#x50CF;&#x4F60;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5E74;&#x9F84;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x62DB;&#x4F60;&#x8FDB;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x5DE5;&#x5382;&#x8981;&#x4E0D;&#x8981;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F60;&#x8981;&#x660E;&#x767D;&#x3002;</p>
<p>&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#xFF1A;&#x884C;&#xFF0C;&#x5C31;&#x8FC7;&#x53BB;&#x8BD5;&#x8BD5;&#x5427;&#xFF01;</p>
<p>&#x62DB;&#x4EBA;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x8BF4;&#xFF1A;&#x597D;&#xFF0C;&#x7B49;&#x4F1A;&#x8DDF;&#x7740;&#x4E00;&#x8D77;&#x8FC7;&#x53BB;&#x3002;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x4ECE;&#x8FD9;&#x6BB5;&#x5BF9;&#x8BDD;&#x4E2D;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x5F88;&#x5FEB;&#x60F3;&#x5230;&#xFF0C;&#x5DE5;&#x5382;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x60F3;&#x8981;&#x90A3;&#x79CD;&#x5E74;&#x9F84;&#x504F;&#x5927;&#x7684;&#x5458;&#x5DE5;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x5DE5;&#x4F5C;&#x5F3A;&#x5EA6;&#x8FD8;&#x662F;&#x6709;&#x7684;&#xFF0C;&#x4E07;&#x4E00;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x8EAB;&#x4F53;&#x60C5;&#x51B5;&#xFF0C;&#x548B;&#x641E;&#x3002;&#x800C;&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#xFF0C;&#x80AF;&#x5B9A;&#x4E5F;&#x662F;&#x4E0D;&#x60F3;&#x5931;&#x53BB;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x673A;&#x4F1A;&#x561B;&#xFF0C;&#x6BD5;&#x7ADF;&#x5BF9;&#x4E8E;&#x4ED6;&#x800C;&#x8A00;&#xFF0C;&#x80FD;&#x6709;&#x9AD8;&#x5DE5;&#x8D44;&#x5C31;&#x884C;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x6B21;&#x8981;&#x7684;&#x3002;</p>
<p>&#x770B;&#x7740;&#x8FD9;&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#x73CD;&#x60DC;&#x5DE5;&#x4F5C;&#x673A;&#x4F1A;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x6211;&#x77AC;&#x95F4;&#x5C31;&#x918D;&#x9190;&#x704C;&#x9876;&#x3002;&#x5185;&#x5FC3;&#x4E0D;&#x7981;&#x5728;&#x60F3;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x751F;&#x6D3B;&#x538B;&#x529B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x8FD9;&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#x60C5;&#x613F;&#x8DDF;&#x7740;&#x4E00;&#x7FA4;&#x5C0F;&#x5E74;&#x8F7B;&#x8FD9;&#x6837;&#x5954;&#x6CE2;&#x627E;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x548C;&#x8FD9;&#x4F4D;&#x52A1;&#x5DE5;&#x5927;&#x54E5;&#x642D;&#x4E0A;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x5C31;&#x5185;&#x5FC3;&#x60F3;&#x60F3;&#x7F62;&#x4E86;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x79CD;&#x4EBA;</strong>&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x662F;&#x548C;&#x4ED6;&#x4EEC;&#x642D;&#x4E0A;&#x8BDD;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x5F88;&#x5E74;&#x8F7B;&#x3002;&#x5728;&#x548C;&#x4ED6;&#x4EEC;&#x7B80;&#x5355;&#x7684;&#x4EA4;&#x6D41;&#x8FC7;&#x540E;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x5E74;&#x9F84;&#x57FA;&#x672C;&#x90FD;&#x662F;18&#x3001;19&#x5C81;&#x5DE6;&#x53F3;&#xFF0C;&#x5E76;&#x4E14;&#x5B66;&#x5386;&#x90FD;&#x4E0D;&#x9AD8;&#xFF0C;&#x6709;&#x521D;&#x4E2D;&#x3001;&#x9AD8;&#x4E2D;&#x3001;&#x4E2D;&#x4E13;&#x7B49;&#x5B66;&#x5386;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x4E9B;&#x662F;&#x4E2D;&#x9014;&#x8F8D;&#x5B66;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x8BFB;&#x5B8C;&#x5B66;&#x5386;&#x5C31;&#x51FA;&#x6765;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x95EE;&#x4ED6;&#x4EEC;&#x4E0D;&#x8BFB;&#x4E66;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x56DE;&#x7B54;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x4E0D;&#x60F3;&#x8BFB;&#x4E86;&#xFF0C;&#x60F3;&#x51FA;&#x6765;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x94B1;&#x82B1;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x8BFB;&#x4E66;&#xFF0C;&#x5012;&#x4E0D;&#x662F;&#x5BB6;&#x91CC;&#x7A77;&#x8BFB;&#x4E0D;&#x8D77;&#xFF0C;&#x800C;&#x662F;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF0C;&#x53D7;&#x4E0D;&#x4E86;&#x793E;&#x4F1A;&#x4E0A;&#x7684;&#x4E00;&#x4E0B;&#x8BF1;&#x60D1;&#xFF0C;&#x60F3;&#x8981;&#x5FEB;&#x70B9;&#x8D5A;&#x94B1;&#xFF0C;&#x597D;&#x6709;&#x80FD;&#x529B;&#x4E70;&#x5404;&#x79CD;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5305;&#x62EC;&#x6253;&#x6E38;&#x620F;&#x4E70;&#x88C5;&#x5907;&#xFF08;&#x56E0;&#x4E3A;&#x548C;&#x4ED6;&#x4EEC;&#x804A;&#x5929;&#x4E2D;&#xFF0C;&#x90FD;&#x662F;&#x6E38;&#x620F;&#x4E0D;&#x79BB;&#x624B;&#x7684;&#x72B6;&#x6001;&#xFF09;&#x3002;</p>
<p>&#x50CF;&#x4ED6;&#x4EEC;&#x8FD9;&#x79CD;&#xFF0C;&#x5403;&#x4E0D;&#x4E86;&#x5B66;&#x4E60;&#x4E0A;&#x7684;&#x82E6;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x5403;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x82E6;&#x3002;&#x4EE5;&#x540E;&#x6216;&#x8BB8;&#x4ED6;&#x4EEC;&#x8FD8;&#x6709;&#x9009;&#x62E9;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD8;&#x5E74;&#x8F7B;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x60F3;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x672A;&#x6765;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x90FD;&#x662F;&#x6E38;&#x79BB;&#x5728;&#x5404;&#x79CD;&#x7535;&#x5B50;&#x5382;&#x3002;&#x56E0;&#x4E3A;&#x611F;&#x89C9;&#x4ED6;&#x4EEC;&#x8FD8;&#x662F;&#x73A9;&#x5FC3;&#x91CD;&#xFF0C;&#x800C;&#x7535;&#x5B50;&#x5382;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#xFF0C;&#x591A;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x5DE5;&#x4F5C;&#x8F7B;&#x677E;&#xFF0C;&#x591A;&#x52B3;&#x591A;&#x5F97;&#xFF0C;&#x8FD8;&#x5305;&#x5403;&#x5305;&#x4F4F;&#x3002;&#x7B49;&#x5230;&#x67D0;&#x4E00;&#x65F6;&#x523B;&#x4ED6;&#x4EEC;&#x8FC7;&#x817B;&#x4E86;&#x8FD9;&#x79CD;&#x65E5;&#x5B50;&#xFF0C;&#x5E94;&#x8BE5;&#x80FD;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x8DEF;&#xFF0C;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x80FD;&#x65E9;&#x70B9;&#x9192;&#x609F;&#x3002;</p>
<p><strong>&#x7B2C;&#x56DB;&#x79CD;&#x4EBA;</strong>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4ED6;&#x4EEC;&#x662F;&#x7B2C;&#x4E09;&#x79CD;&#x4EBA;&#x7684;&#x5347;&#x7EA7;&#x7248;&#xFF0C;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x9192;&#x609F;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4ECE;&#x4E8B;&#x7740;&#x7535;&#x5B50;&#x5382;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x3002;&#x53EA;&#x662F;&#x4ECE;&#x5382; A&#xFF0C;&#x6765;&#x5230;&#x4E86;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x5DE5;&#x8D44;&#xFF0C;&#x5DE5;&#x4F5C;&#x5404;&#x65B9;&#x9762;&#x8FD8;&#x4E0D;&#x9519;&#x7684;&#x5382; B &#x800C;&#x5DF2;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4ED6;&#x4EEC;&#x8EAB;&#x4E0A;&#x770B;&#x5230;&#x5168;&#x56FD;&#x5404;&#x5730;&#x5954;&#x6CE2;&#x7684;&#x75D5;&#x8FF9;&#xFF1A;&#x86C7;&#x76AE;&#x888B;&#x3001;&#x9ED1;&#x884C;&#x674E;&#x7BB1;&#x3001;&#x7AF9;&#x5E2D;&#x88AB;&#x8925;&#x3001;&#x80E1;&#x5B50;&#x62C9;&#x78B4;&#x3001;&#x5934;&#x53D1;&#x51CC;&#x4E71;&#x3001;&#x70DF;&#x5473;&#x5F88;&#x91CD;&#x3002;&#x6211;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#xFF0C;&#x53EA;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x7528;&#x6587;&#x5B57;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x5176;&#x4ED6;&#x610F;&#x601D;&#x3002;&#x5728;&#x548C;&#x4ED6;&#x4EEC;&#x4EA4;&#x8C08;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x80FD;&#x5F88;&#x660E;&#x663E;&#x7684;&#x770B;&#x51FA;&#x4E00;&#x79CD;&#x65E0;&#x5948;&#x7684;&#x5FC3;&#x60C5;&#x51FA;&#x6765;&#xFF0C;&#x4ED6;&#x4EEC;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#xFF0C;&#x6709;&#x70B9;&#x6536;&#x5165;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#x5DE5;&#x5382;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5FD9;&#x7684;&#x65F6;&#x5019;&#x62DB;&#x4EBA;&#xFF0C;&#x4E0D;&#x5FD9;&#x7684;&#x65F6;&#x5019;&#x62FC;&#x547D;&#x7684;&#x8D76;&#x4EBA;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x60F3;&#x8D70;&#x7684;&#xFF0C;&#x4F46;&#x5DE5;&#x5382;&#x4E0D;&#x5FD9;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x53D1;&#x5DE5;&#x8D44;&#x7684;&#xFF0C;&#x4F60;&#x8FD9;&#x6837;&#x5446;&#x5728;&#x5DE5;&#x5382;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x53C8;&#x62FF;&#x8D77;&#x884C;&#x56CA;&#x56DB;&#x5904;&#x5954;&#x6CE2;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x751F;&#x6D3B;&#x5C31;&#x662F;&#x5145;&#x6EE1;&#x7740;&#x672A;&#x77E5;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x7684;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#xFF0C;&#x6765;&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x3002;&#x5E0C;&#x671B;&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x4E0D;&#x88AB;&#x751F;&#x6D3B;&#x6240;&#x538B;&#x8FEB;&#xFF0C;&#x52A0;&#x6CB9;&#x5427;&#xFF01;</p>
<p>&#x8FD8;&#x6709;<strong>&#x6700;&#x540E;&#x4E00;&#x79CD;&#x4EBA;</strong>&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x6700;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x4E00;&#x79CD;&#x4EBA;&#x3002;&#x4ED6;&#x4EEC;&#x5728;&#x6CA1;&#x6709;&#x8FDB;&#x5382;&#x4E4B;&#x524D;&#xFF0C;&#x624B;&#x5E95;&#x4E0B;&#x6709;&#x5341;&#x591A;&#x53F7;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;&#x5149;&#x79DF;&#x91D1;&#x5C31;&#x53EF;&#x4EE5;&#x82B1;&#x51FA;&#x53BB;&#x4E94;&#x516D;&#x4E07;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x53EF;&#x4EE5;&#x628A;&#x4ED6;&#x4EEC;&#x5B9A;&#x4E3A;&#x8001;&#x677F;&#x88AB;&#x8FEB;&#x8FDB;&#x5382;&#x7684;&#x4E00;&#x7C7B;&#x4EBA;&#x3002;</p>
<p>&#x8BF4;&#x4ED6;&#x4EEC;&#x662F;&#x8001;&#x677F;&#xFF0C;&#x4E00;&#x70B9;&#x90FD;&#x6CA1;&#x9519;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x6CA1;&#x6709;&#x8FDB;&#x5382;&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x81EA;&#x5DF1;&#x5F00;&#x5E97;&#x505A;&#x8001;&#x677F;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A; 21 &#x5E74;&#x75AB;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x95ED;&#x95E8;&#x4E0D;&#x51FA;&#xFF0C;&#x5B9E;&#x4F53;&#x7ECF;&#x6D4E;&#x5F88;&#x96BE;&#x518D;&#x7EF4;&#x6301;&#x8FD9;&#x79CD;&#x9AD8;&#x623F;&#x79DF;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x88AB;&#x8FEB;&#x5173;&#x5E97;&#xFF0C;&#x5012;&#x95ED;&#x3002;&#x6211;&#x90A3;&#x65F6;&#x95EE;&#x4ED6;&#x4EEC;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x591A;&#x575A;&#x6301;&#x575A;&#x6301;&#xFF0C;&#x4F60;&#x770B;&#x73B0;&#x5728;&#x4E0D;&#x5C31;&#x6625;&#x6696;&#x82B1;&#x5F00;&#x4E86;&#x5417;&#xFF1F;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x9762;&#x5E26;&#x82E6;&#x6DA9;&#x7684;&#x8BF4;&#xFF0C;&#x591A;&#x575A;&#x6301;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x5C31;&#x662F;&#x4E94;&#x516D;&#x4E07;&#x7684;&#x6D41;&#x6C34;&#x51FA;&#x53BB;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x4F1A;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x662F;&#x4E2A;&#x5934;&#x3002;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x6CA1;&#x575A;&#x6301;&#xFF0C;&#x800C;&#x662F;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x94B1;&#x518D;&#x53EF;&#x4EE5;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x73B0;&#x5012;&#x95ED;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7F13;&#x4E00;&#x7F13;&#xFF0C;&#x91CA;&#x653E;&#x4E00;&#x4E0B;&#x538B;&#x529B;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x786E;&#x5B9E;&#x4ECE;&#x4ED6;&#x4EEC;&#x8EAB;&#x4E0A;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x4ED6;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x53EA;&#x51FA;&#x4E0D;&#x8FDB;&#xFF0C;&#x4E94;&#x516D;&#x4E07;&#x7684;&#x6D41;&#x6C34;&#xFF0C;&#x8FD9;&#x8C01;&#x80FD;&#x53D7;&#x5F97;&#x4E86;&#x3002;&#x5E76;&#x4E14;&#x75AB;&#x60C5;&#x8FC7;&#x53BB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x60F3;&#x8FC7;&#x91CD;&#x65B0;&#x518D;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x94B1;&#x53EF;&#x4EE5;&#x518D;&#x6765;&#x4E86;&#xFF0C;&#x90A3;&#x4F1A;&#x6B20;&#x7684;&#x94B1;&#x8FD8;&#x6CA1;&#x8FD8;&#x6E05;&#xFF0C;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x8D44;&#x91D1;&#x91CD;&#x5934;&#x518D;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x5929;&#x7684;&#x4EA4;&#x8C08;&#x4E2D;&#xFF0C;&#x6211;&#x89C1;&#x8FC7;&#x4E24;&#x4E2A;&#x8FD9;&#x79CD;&#x4EBA;&#xFF0C;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x8001;&#x677F;&#xFF0C;&#x4E5F;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x75AB;&#x60C5;&#x539F;&#x56E0;&#xFF0C;&#x8D54;&#x94B1;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x8FDB;&#x5382;&#x7F13;&#x4E00;&#x7F13;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x597D;&#x53D7;&#x4E00;&#x70B9;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x6BD5;&#x7ADF;&#x662F;&#x89C1;&#x8FC7;&#x4E00;&#x4E9B;&#x4E16;&#x9762;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x660E;&#x663E;&#x7684;&#x611F;&#x53D7;&#x5230;&#x4ED6;&#x4EEC;&#x548C;&#x524D;&#x9762;&#x8FD9;&#x51E0;&#x79CD;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x88C5;&#x626E;&#x3001;&#x8BF4;&#x8BDD;&#x548C;&#x56DE;&#x7B54;&#x95EE;&#x9898;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x4E5F;&#x90FD;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x8FD8;&#x8BF4;&#xFF0C;&#x7B49;&#x6211;&#x5728;&#x5DE5;&#x5382;&#x7F13;&#x8FC7;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x7EE7;&#x7EED;&#x518D;&#x62FC;&#x640F;&#x4E00;&#x756A;&#x3002;&#x4F60;&#x770B;&#x770B;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x975E;&#x5E38;&#x597D;&#x561B;&#xFF01;&#x5728;&#x4EBA;&#x751F;&#x7684;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8DCC;&#x5012;&#xFF0C;&#x8BF4;&#x660E;&#x4F60;&#x9009;&#x62E9;&#x7684;&#x662F;&#x4E00;&#x6761;&#x574E;&#x5777;&#x7684;&#x8DEF;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x7AD9;&#x8D77;&#x6765;&#xFF0C;&#x7EE7;&#x7EED;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x7684;&#x6536;&#x83B7;&#x7EDD;&#x5BF9;&#x80FD;&#x5BF9;&#x5F97;&#x8D77;&#x4F60;&#x8FD9;&#x4E00;&#x8DEF;&#x7684;&#x574E;&#x5777;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x4E86;&#xFF0C;&#x6D0B;&#x6D0B;&#x6D12;&#x6D12;&#x4E94;&#x5343;&#x591A;&#x5B57;&#xFF0C;&#x7B97;&#x662F;&#x6211;&#x5BF9;&#x90A3;&#x5929;&#x7ECF;&#x5386;&#x7684;&#x4E00;&#x4E2A;&#x4EA4;&#x4EE3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5185;&#x5FC3;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x611F;&#x89E6;&#xFF0C;&#x8BF4;&#x660E;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x611F;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x6B22;&#x8FCE;&#x4F60;&#x5728;&#x8BC4;&#x8BBA;&#x533A;&#x7559;&#x4E0B;&#x4F60;&#x7684;&#x8DB3;&#x8FF9;&#x3002;</p>
<p><strong>&#x9898;&#x5916;&#x8BDD;</strong>&#xFF1A;&#x4E3B;&#x4EBA;&#x516C; A &#x6700;&#x540E;&#x8FD8;&#x662F;&#x6CA1;&#x53BB;&#x6210;&#xFF01;&#x1F923;&#x1F923;&#x1F923;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/d9e25f65e158f3c952a9d921f20a9524.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-Java-程序员/" rel="tag"># 后端,Java,程序员</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7343138637971734569.html" rel="next" title="前端太卷了，不玩了，写写nodejs全栈涨工资，赶紧学起来">
                <i class="fa fa-chevron-left"></i> 前端太卷了，不玩了，写写nodejs全栈涨工资，赶紧学起来
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7343139078486982710.html" rel="prev" title="看不懂来打我，vue3的vue文件(SFC)编译过程 前言">
                看不懂来打我，vue3的vue文件(SFC)编译过程 前言 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#故事"><span class="nav-number">1.</span> <span class="nav-text">故事</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#有感"><span class="nav-number">2.</span> <span class="nav-text">有感</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
