<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="算法,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x3010;Abstract&amp;#x3011;In order to improve the efficiency of the algorithm, the hash idea is a very useful method in the practice of the algorithm. The reasonable use of hash idea to solve the algori">
<meta name="keywords" content="算法">
<meta property="og:type" content="article">
<meta property="og:title" content="哈希思想在算法中的实践 一、引言 二、什么是哈希思想 三、删">
<meta property="og:url" content="https://dev.newban.cn/7344742642151243814.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x3010;Abstract&amp;#x3011;In order to improve the efficiency of the algorithm, the hash idea is a very useful method in the practice of the algorithm. The reasonable use of hash idea to solve the algori">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2024-04-23T04:55:32.851Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="哈希思想在算法中的实践 一、引言 二、什么是哈希思想 三、删">
<meta name="twitter:description" content="&amp;#x3010;Abstract&amp;#x3011;In order to improve the efficiency of the algorithm, the hash idea is a very useful method in the practice of the algorithm. The reasonable use of hash idea to solve the algori">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7344742642151243814.html">





  <title>哈希思想在算法中的实践 一、引言 二、什么是哈希思想 三、删 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">哈希思想在算法中的实践 一、引言 二、什么是哈希思想 三、删</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-03-11T15:17:09+08:00">
                2024-03-11
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x3010;Abstract&#x3011;In order to improve the efficiency of the algorithm, the hash idea is a very useful method in the practice of the algorithm. The reasonable use of hash idea to solve the algorithm problem can effectively help us solve the algorithm problem, especially some problems are very suitable for using hash idea to solve. This article will use some examples on LeetCode to explain and illustrate some practical cases of hashing ideas in algorithm cases.</p>
<p>&#x3010;&#x6458;&#x8981;&#x3011;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x662F;&#x5728;&#x7B97;&#x6CD5;&#x5B9E;&#x8DF5;&#x4E2D;&#x5F88;&#x6709;&#x7528;&#x7684;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5408;&#x7406;&#x8FD0;&#x7528;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x6765;&#x89E3;&#x51B3;&#x7B97;&#x6CD5;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x7B97;&#x6CD5;&#x95EE;&#x9898;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x672C;&#x6587;&#x5C06;&#x501F;&#x52A9;LeetCode&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF0C;&#x6765;&#x8BB2;&#x89E3;&#x548C;&#x8BF4;&#x660E;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x5728;&#x7B97;&#x6CD5;&#x6848;&#x4F8B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#x6848;&#x4F8B;&#x3002;</p>
<p>&#x3010;&#x5173;&#x952E;&#x8BCD;&#x3011; &#x7B97;&#x6CD5;&#x601D;&#x60F3; LeetCode &#x7B97;&#x6CD5;&#x6548;&#x7387; &#x7B97;&#x6CD5;</p>
<h1 id="&#x4E00;&#x3001;&#x5F15;&#x8A00;"><a href="#&#x4E00;&#x3001;&#x5F15;&#x8A00;" class="headerlink" title="&#x4E00;&#x3001;&#x5F15;&#x8A00;"></a>&#x4E00;&#x3001;&#x5F15;&#x8A00;</h1><p>&#x5728;&#x65E5;&#x5E38;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x7F16;&#x7A0B;&#x548C;&#x5B9E;&#x9645;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7528;&#x5904;&#xFF0C;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x5E2E;&#x52A9;&#x5230;&#x6211;&#x4EEC;&#x6765;&#x8BBE;&#x8BA1;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x52A8;&#x6001;&#x96C6;&#x5408;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x9700;&#x8981;&#x652F;&#x6301;&#x63D2;&#x5165;&#x3001;&#x67E5;&#x627E;&#x3001;&#x5220;&#x9664;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x6784;&#x5EFA;&#xFF0C;&#x4F1A;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x672C;&#x6587;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#x4F8B;&#x5B50;&#x6765;&#x8BD5;&#x56FE;&#x8BB2;&#x89E3;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x7684;&#x8FD0;&#x7528;&#x3002;</p>
<h1 id="&#x4E8C;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x601D;&#x60F3;"><a href="#&#x4E8C;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x601D;&#x60F3;" class="headerlink" title="&#x4E8C;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x601D;&#x60F3;"></a>&#x4E8C;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x601D;&#x60F3;</h1><p>&#x54C8;&#x5E0C;&#x8868;&#x4E5F;&#x53EB;&#x6563;&#x5217;&#x8868;&#xFF0C;&#x7531;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x4E5F;&#x53EB;&#x76F4;&#x63A5;&#x5BFB;&#x5740;&#x8868;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x4E5F;&#x53EB;&#x54C8;&#x5E0C;&#x8868;&#x6216;&#x8005;&#x6563;&#x5217;&#x8868;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x53EB;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5173;&#x952E;&#x5B57;&#x901A;&#x8FC7;&#x6563;&#x5217;&#x51FD;&#x6570;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x67E5;&#x627E;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x67E5;&#x627E;&#x65F6;&#x95F4;O(1)&#xFF0C;&#x6700;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x51FA;&#x73B0;&#x6574;&#x4E2A;&#x5217;&#x8868;&#x5168;&#x90FD;&#x67E5;&#x627E;&#x4E00;&#x904D;&#xFF0C;&#x65F6;&#x95F4;&#x662F;O(n)&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x6700;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5728;&#x6784;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x822C;&#x5C3D;&#x91CF;&#x9009;&#x62E9;&#x5177;&#x6709;&#x552F;&#x4E00;&#x6027;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x7B80;&#x5355;&#x603B;&#x7ED3;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x6765;&#x4E0E;&#x6570;&#x7EC4;&#x90E8;&#x5206;&#x76F8;&#x5173;&#x8054;&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x627E;&#x6570;&#x636E;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x5173;&#x952E;&#x5B57;&#x6570;&#x91CF;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F4;&#x63A5;&#x5BFB;&#x5740;&#x6CD5;&#xFF0C;&#x628A;&#x5168;&#x90E8;&#x7684;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x6784;&#x5EFA;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5EFA;&#x7ACB;&#x67E5;&#x627E;&#x5173;&#x7CFB;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x5F53;&#x5173;&#x952E;&#x5B57;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F00;&#x653E;&#x5BFB;&#x5740;&#x6CD5;&#xFF0C;&#x6309;&#x7167;&#x9700;&#x8981;&#xFF0C;&#x52A8;&#x6001;&#x6784;&#x5EFA;&#x76F8;&#x5173;&#x7684;&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5EFA;&#x7ACB;&#x589E;&#x5220;&#x6539;&#x67E5;&#x7684;&#x5173;&#x7CFB;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x6784;&#x5EFA;&#x5B8C;&#x5168;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x9759;&#x6001;&#x5B58;&#x50A8;&#x5168;&#x90E8;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5B8C;&#x5168;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x5B8C;&#x6210;&#x5173;&#x952E;&#x5B57;&#x67E5;&#x627E;&#xFF0C;&#x8FD9;&#x79CD;&#x5728;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x662F;&#x5408;&#x9002;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x91C7;&#x7528;&#x4F55;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;&#x89C6;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#x3002;</p>
<p>&#x5F53;&#x5173;&#x952E;&#x5B57;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x8986;&#x76D6;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#xFF0C;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x5BF9;&#x5E94;&#x591A;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x51B2;&#x7A81;&#x7684;&#x6570;&#x636E;&#x91C7;&#x7528;&#x94FE;&#x8868;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6216;&#x8005;&#x7EA2;&#x9ED1;&#x6811;&#x6765;&#x5EFA;&#x7ACB;&#x67E5;&#x627E;&#x5173;&#x7CFB;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E00;&#x67E5;&#x627E;&#x6765;&#x5BFB;&#x627E;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x597D;&#x5904;&#x662F;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x574F;&#x5904;&#x662F;&#xFF0C;&#x5728;&#x51B2;&#x7A81;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E0A;&#x4F1A;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5806;&#x79EF;&#x73B0;&#x8C61;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x628A;&#x51B2;&#x7A81;&#x7684;&#x6570;&#x636E;&#x5168;&#x90E8;&#x67E5;&#x627E;&#x4E00;&#x904D;&#x624D;&#x53EF;&#x4EE5;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x9700;&#x8981;&#x53E6;&#x5916;&#x5F00;&#x8F9F;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x589E;&#x52A0;&#x7A7A;&#x95F4;&#x6D88;&#x8017;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x522B;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x5F00;&#x653E;&#x5BFB;&#x5740;&#x6CD5;&#xFF0C;&#x5F53;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x5728;&#x6563;&#x5217;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#x518D;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x51B2;&#x7A81;&#x5C31;&#x91CD;&#x590D;&#x518D;&#x7528;&#x65B0;&#x751F;&#x6210;&#x7684;&#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x76F4;&#x5230;&#x4E0D;&#x91CD;&#x590D;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x4FDD;&#x8BC1;&#x53EF;&#x4EE5;&#x653E;&#x4E0B;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5730;&#x5220;&#x9664;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x9762;&#x65B0;&#x751F;&#x6210;&#x7684;&#x5173;&#x952E;&#x5B57;&#x662F;&#x53EF;&#x80FD;&#x548C;&#x4E4B;&#x524D;&#x5220;&#x9664;&#x7684;&#x5173;&#x952E;&#x5B57;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x53EA;&#x80FD;&#x6807;&#x8BB0;&#x4E00;&#x4E0B;&#x5DF2;&#x7ECF;&#x5220;&#x9664;&#x4E86;&#x3002;&#x5728;&#x5F00;&#x653E;&#x5BFB;&#x5740;&#x6CD5;&#x4E2D;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x51B2;&#x7A81;&#x7684;&#x5173;&#x952E;&#x5B57;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x94FE;&#x8868;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x7EBF;&#x6027;&#x63A2;&#x67E5;&#x6CD5;&#xFF0C;&#x76F4;&#x63A5;&#x4F9D;&#x6B21;&#x63A2;&#x67E5;&#x4E0B;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x4E8C;&#x6B21;&#x63A2;&#x67E5;&#x3001;&#x53CC;&#x91CD;&#x6563;&#x5217;&#x3001;&#x5EFA;&#x7ACB;&#x516C;&#x5171;&#x6EA2;&#x51FA;&#x533A;&#x7B49;&#x7B49;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x968F;&#x7740;&#x54C8;&#x5E0C;&#x8868;&#x6570;&#x636E;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x4E5F;&#x53EB;&#x88C5;&#x8F7D;&#x56E0;&#x5B50;&#x6765;&#x8868;&#x793A;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684;&#x586B;&#x6EE1;&#x7A0B;&#x5EA6;&#xFF0C;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x662F;&#x88C5;&#x5165;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;&#x4E0E;&#x5F53;&#x524D;&#x54C8;&#x5E0C;&#x8868;&#x603B;&#x7684;&#x957F;&#x5EA6;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x5F53;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x8D8A;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x586B;&#x5145;&#x7684;&#x6570;&#x636E;&#x8D8A;&#x591A;&#xFF0C;&#x7A7A;&#x95F4;&#x5229;&#x7528;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#xFF0C;&#x67E5;&#x627E;&#x6570;&#x636E;&#x7684;&#x6210;&#x672C;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x5F53;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x8D8A;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x586B;&#x5145;&#x7684;&#x6570;&#x636E;&#x8D8A;&#x5C11;&#xFF0C;&#x7A7A;&#x95F4;&#x5229;&#x7528;&#x7387;&#x5C31;&#x8D8A;&#x4F4E;&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x5C31;&#x4F1A;&#x51CF;&#x5C11;&#xFF0C;&#x67E5;&#x627E;&#x6570;&#x636E;&#x7684;&#x6210;&#x672C;&#x8D8A;&#x4F4E;&#x3002;&#x5F80;&#x5F80;&#x5728;&#x8BBE;&#x7F6E;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x505A;&#x4E00;&#x4E9B;&#x53D6;&#x820D;&#x548C;&#x5E73;&#x8861;&#x6765;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x548C;&#x7A7A;&#x95F4;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x589E;&#x52A0;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x957F;&#x5EA6;&#x8FD8;&#x662F;&#x4EC0;&#x4E48;&#x522B;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p>&#x6587;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x90FD;&#x662F;&#x4F7F;&#x7528;Java&#x5B9E;&#x73B0;&#x3002;</p>
<h1 id="&#x4E09;&#x3001;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x4F7F;&#x9891;&#x7387;&#x76F8;&#x540C;"><a href="#&#x4E09;&#x3001;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x4F7F;&#x9891;&#x7387;&#x76F8;&#x540C;" class="headerlink" title="&#x4E09;&#x3001;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x4F7F;&#x9891;&#x7387;&#x76F8;&#x540C;"></a>&#x4E09;&#x3001;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x4F7F;&#x9891;&#x7387;&#x76F8;&#x540C;</h1><p>&#x9898;&#x76EE;&#x63CF;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x4E0B;&#x6807;&#x4ECE;0&#x5F00;&#x59CB;&#x7684;&#x5B57;&#x7B26;&#x4E32;word&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x53EA;&#x5305;&#x542B;&#x5C0F;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x3002;&#x4F60;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4E0B;&#x6807;&#x5E76;&#x5220;&#x9664;&#x4E0B;&#x6807;&#x5904;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x4F7F;&#x5F97;word&#x4E2D;&#x5269;&#x4F59;&#x6BCF;&#x4E2A;&#x5B57;&#x6BCD;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x76F8;&#x540C;&#x3002;&#x5982;&#x679C;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x540E;&#xFF0C;&#x5E76;&#x4E14;&#x6070;&#x597D;&#x53EA;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#xFF0C;word&#x4E2D;&#x5269;&#x4F59;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x90FD;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD4;&#x56DE;true&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;false&#x3002;&#x6BD4;&#x5982;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x662F;<code>aaccc</code>&#xFF0C;&#x2019;c&#x2019;&#x7684;&#x6570;&#x91CF;&#x662F;3&#xFF0C;&#x6570;&#x91CF;&#x51CF;1&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x2019;a&#x2019;&#x548C;&#x2019;c&#x2019;&#x7684;&#x6570;&#x91CF;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x8FD4;&#x56DE;tue&#x3002;<a href="#user-content-fn-1">1</a></p>
</blockquote>
<p>&#x9996;&#x5148;&#x5206;&#x6790;&#x4E0B;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x904D;&#x5386;&#x4E00;&#x904D;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x9996;&#x5148;&#x7EDF;&#x8BA1;&#x51FA;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x3002;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x6709;26&#xFF0C;&#x4E14;&#x4E0D;&#x8003;&#x8651;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x53EA;&#x6709;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x8BB0;&#x5F55;&#x5B57;&#x6BCD;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x7387;&#xFF0C;&#x8868;&#x7684;&#x957F;&#x5EA6;&#x6700;&#x5927;&#x503C;&#x4E5F;&#x5C31;&#x662F;26&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#x6570;&#x91CF;&#x5F88;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x521D;&#x59CB;&#x5316;&#x51FA;&#x4E00;&#x4E2A;26&#x957F;&#x5EA6;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6309;&#x7167;26&#x4E2A;&#x5B57;&#x6BCD;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x6765;&#x8BB0;&#x5F55;&#x9891;&#x7387;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x548C;&#x9891;&#x7387;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x7684;&#x5B57;&#x5178;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8282;&#x7EA6;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x6765;&#x907F;&#x514D;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x7684;&#x5B57;&#x6BCD;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x76F4;&#x63A5;&#x53BB;&#x8BFB;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x63D2;&#x5165;&#x65F6;&#x7684;&#x65F6;&#x95F4;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x6765;&#x5904;&#x7406;&#x4E0A;&#x4E00;&#x6B65;&#x5F97;&#x5230;&#x7684;&#x6570;&#x7EC4;&#x4E86;&#x3002;&#x9996;&#x5148;&#x5982;&#x679C;&#x5F97;&#x5230;&#x7684;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x5C31;&#x662F;1&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B57;&#x7B26;&#x4E32;&#x91CC;&#x6240;&#x6709;&#x7684;&#x5B57;&#x6BCD;&#x90FD;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x4E3A;true&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x51CF;1&#x4E4B;&#x540E;&#x90FD;&#x53EF;&#x4EE5;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x904D;&#x5386;&#x4E00;&#x904D;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6570;&#x91CF;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF08;&#x4E0B;&#x65B9;&#x4EE3;&#x7801;&#x4E2D;&#x7684;max&#xFF0C;&#x4EE3;&#x8868;&#x51FA;&#x73B0;&#x6570;&#x91CF;&#x6700;&#x591A;&#x7684;&#x6B21;&#x6570;&#x662F;&#x591A;&#x5C11;&#xFF09;&#x548C;&#x6700;&#x5C0F;&#x503C;&#xFF08;&#x4E0B;&#x65B9;&#x4EE3;&#x7801;&#x4E2D;&#x7684;min&#xFF0C;&#x4EE3;&#x8868;&#x51FA;&#x73B0;&#x6570;&#x91CF;&#x6700;&#x5C11;&#x7684;&#x6B21;&#x6570;&#x662F;&#x591A;&#x5C11;&#xFF09;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6700;&#x5927;&#x6570;&#x91CF;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#xFF08;&#x4E0B;&#x65B9;&#x4EE3;&#x7801;&#x4E2D;&#x7684;countMax&#xFF0C;&#x4EE3;&#x8868;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x5B57;&#x6BCD;&#x662F;&#x8FD9;&#x4E2A;&#x6700;&#x5927;&#x6570;&#x91CF;max&#x7684;&#xFF09;&#xFF0C;&#x548C;&#x6700;&#x5C0F;&#x6570;&#x91CF;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#xFF08;&#x4E0B;&#x65B9;&#x4EE3;&#x7801;&#x4E2D;&#x7684;countMin&#xFF0C;&#x4EE3;&#x8868;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x5B57;&#x6BCD;&#x662F;&#x8FD9;&#x4E2A;&#x6700;&#x5C0F;&#x6570;&#x91CF;min&#x7684;&#xFF09;&#x3002;&#x5982;&#x679C;&#x5224;&#x65AD;&#x6700;&#x5927;&#x6570;&#x91CF;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#x7B49;&#x4E8E;&#x5168;&#x90E8;&#x7684;&#x5B57;&#x7B26;&#x957F;&#x5EA6;&#xFF0C;&#x90A3;&#x5C31;&#x4EE3;&#x8868;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x5168;&#x90E8;&#x7684;&#x5B57;&#x6BCD;&#x90FD;&#x76F8;&#x540C;&#xFF0C;&#x9664;&#x975E;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;word&#x7684;&#x957F;&#x5EA6;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;2&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4E3A;true&#xFF0C;&#x5426;&#x5219;&#x662F;&#x8FD4;&#x56DE;false&#x3002;&#x5982;&#x679C;&#x6700;&#x5927;&#x6570;&#x91CF;&#x53EA;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5B57;&#x6BCD;&#x6570;&#x91CF;&#x6700;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5927;&#x7684;&#x6570;&#x91CF;&#x51CF;&#x53BB;&#x6700;&#x5C0F;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5DEE;&#x503C;&#x4E3A;1&#x6216;&#x8005;0&#xFF0C;&#x6BD4;&#x5982;abcc&#x3001;abb&#x3001;cdd&#x3001;ab&#x3001;ef&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4E3A;true&#x7684;&#xFF0C;&#x5982;&#x679C;&#x662F;abccc&#x3001;abbccc&#x3001;abbb&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x8BE5;&#x8FD4;&#x56DE;false&#x3002;&#x5982;&#x679C;&#x6700;&#x5927;&#x6570;&#x91CF;&#x53EA;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5B57;&#x6BCD;&#x6570;&#x91CF;&#x6700;&#x591A;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4ED6;&#x7684;&#x5B57;&#x6BCD;&#x90FD;&#x662F;1&#x4E2A;&#xFF0C;&#x6BD4;&#x5982;accccc&#x3001;bffff&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x8FD4;&#x56DE;&#x7684;true&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x7684;&#x60C5;&#x51B5;&#x90FD;&#x662F;false&#x3002;&#x5982;&#x679C;&#x6700;&#x5927;&#x6570;&#x91CF;&#x51FA;&#x73B0;&#x4E86;&#x591A;&#x4E2A;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x5C0F;&#x6570;&#x91CF;&#x7684;&#x53EA;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E24;&#x79CD;&#x52A0;&#x8D77;&#x6765;&#x7684;&#x6570;&#x91CF;&#x521A;&#x597D;&#x7B49;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5C31;&#x4EE3;&#x8868;&#xFF0C;&#x6BD4;&#x5982;abbbccc&#x3001;effgg&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x5E94;&#x8BE5;&#x8FD4;&#x56DE;true&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x90FD;&#x662F;false&#xFF0C;&#x6BD4;&#x5982;abbcccfff&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x8BE5;&#x662F;false&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;class Solution {</span><br><span class="line">    public boolean equalFrequency(String word) {</span><br><span class="line">        int[] hash = new int[26];</span><br><span class="line">        int max = 0;</span><br><span class="line">        for (char c : word.toCharArray()) {</span><br><span class="line">            hash[c - &apos;a&apos;]++;</span><br><span class="line">            max = Math.max(hash[c - &apos;a&apos;], max);</span><br><span class="line">        }</span><br><span class="line">        if (max == 1) return true;</span><br><span class="line">        int countMax = 0, countMin = 0, min = max;</span><br><span class="line">        for (Integer value : hash) {</span><br><span class="line">            if (value == 0) continue;</span><br><span class="line">            if (value &lt; min) {</span><br><span class="line">                countMin = 1;</span><br><span class="line">            } else if (value == min) {</span><br><span class="line">                countMin++;</span><br><span class="line">            }</span><br><span class="line">            min = Math.min(value, min);</span><br><span class="line">            if (value == max) {</span><br><span class="line">                countMax++;</span><br><span class="line">            }</span><br><span class="line">        }</span><br><span class="line">        if (countMax == word.length()) return word.length() &lt;= 2;</span><br><span class="line">        if (countMax == 1) {</span><br><span class="line">            return max - min == 1 || max - min == 0 || (countMin == 1 &amp;&amp; min == 1 &amp;&amp; max + min == word.length());</span><br><span class="line">        } else {</span><br><span class="line">            return countMin == 1 &amp;&amp; min == 1 &amp;&amp; ((countMax * max + countMin) == word.length());</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x5728;&#x672C;&#x5730;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x662F;s:wordgoodgoodgoodd&#x65F6;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;false&#x8BA1;&#x7B97;&#x8017;&#x65F6;&#x4E3A;23ms&#x3002;&#x5F53;&#x8F93;&#x5165;&#x662F;s:abbbcccdddeeefff&#x65F6;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;true&#x8BA1;&#x7B97;&#x8017;&#x65F6;&#x4E3A;24ms&#x3002;&#x5728;leetcode&#x4E0A;&#x6267;&#x884C;&#x7528;&#x65F6;&#xFF1A;0ms&#xFF0C;&#x8BA1;&#x7B97;&#x7684;&#x5F88;&#x5FEB;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x4E3A;&#x73AF;&#x5883;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5927;&#x5BB6;&#x5728;&#x6BD4;&#x8F83;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x9AD8;&#x4F4E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE5;leetcode&#x4E0A;&#x7684;&#x4E3A;&#x51C6;&#x3002;</p>
<h1 id="&#x56DB;&#x3001;&#x4E32;&#x8054;&#x6240;&#x6709;&#x5355;&#x8BCD;&#x7684;&#x5B50;&#x4E32;"><a href="#&#x56DB;&#x3001;&#x4E32;&#x8054;&#x6240;&#x6709;&#x5355;&#x8BCD;&#x7684;&#x5B50;&#x4E32;" class="headerlink" title="&#x56DB;&#x3001;&#x4E32;&#x8054;&#x6240;&#x6709;&#x5355;&#x8BCD;&#x7684;&#x5B50;&#x4E32;"></a>&#x56DB;&#x3001;&#x4E32;&#x8054;&#x6240;&#x6709;&#x5355;&#x8BCD;&#x7684;&#x5B50;&#x4E32;</h1><p>&#x9898;&#x76EE;&#x63CF;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;s&#x548C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x7EC4;words&#x3002;words&#x4E2D;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#x3002;s&#x4E2D;&#x7684;&#x4E32;&#x8054;&#x5B50;&#x4E32;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x5305;&#x542B;words&#x4E2D;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x4EE5;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x5B50;&#x4E32;&#xFF0C;&#x6BD4;&#x5982;words = [&#x201C;ab&#x201D;,&#x201D;cd&#x201D;,&#x201D;ef&#x201D;]&#xFF0C;&#x90A3;&#x4E48;&#x201D;abcdef&#x201D;&#xFF0C;&#x201D;abefcd&#x201D;&#xFF0C;&#x201D;cdabef&#x201D;&#xFF0C;&#x201D;cdefab&#x201D;&#xFF0C;&#x201D;efabcd&#x201D;&#xFF0C;&#x548C;&#x201D;efcdab&#x201D; &#x90FD;&#x662F;&#x4E32;&#x8054;&#x5B50;&#x4E32;&#x3002;&#x201D;acdbef&#x201D;&#x4E0D;&#x662F;&#x4E32;&#x8054;&#x5B50;&#x4E32;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;words&#x6392;&#x5217;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x4E32;&#x8054;&#x5B57;&#x4E32;&#x5728;s&#x4E2D;&#x7684;&#x5F00;&#x59CB;&#x7D22;&#x5F15;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4EE5;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x8FD4;&#x56DE;&#x7B54;&#x6848;&#x3002;<a href="#user-content-fn-2">2</a></p>
</blockquote>
<h2 id="&#x65B9;&#x6CD5;&#x4E00;"><a href="#&#x65B9;&#x6CD5;&#x4E00;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E00;"></a>&#x65B9;&#x6CD5;&#x4E00;</h2><p>&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x9996;&#x5148;&#x751F;&#x6210;word&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5168;&#x6392;&#x5217;&#xFF0C;&#x751F;&#x6210;&#x5168;&#x6392;&#x5217;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x90BB;&#x4F4D;&#x5BF9;&#x6362;&#x6CD5;&#x3001;&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x8D58;&#x8FF0;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x8BBA;&#x662F;&#x4F55;&#x79CD;&#x5168;&#x6392;&#x5217;&#x65B9;&#x6CD5;&#xFF0C;&#x968F;&#x7740;word&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6570;&#x91CF;&#x589E;&#x52A0;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x662F;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x82B1;&#x8D39;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x751F;&#x6210;&#x5168;&#x6392;&#x5217;&#xFF0C;&#x5982;&#x679C;&#x7535;&#x8111;&#x8D44;&#x6E90;&#x4E0D;&#x591F;&#x7684;&#x8BDD;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x751F;&#x6210;&#x5931;&#x8D25;&#xFF0C;&#x5BF9;&#x8D44;&#x6E90;&#x662F;&#x4E00;&#x79CD;&#x6781;&#x5927;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x6240;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x7F29;&#x77ED;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5462;&#xFF1F;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<p>&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4E5F;&#x53EB;&#x53CC;&#x6307;&#x9488;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x9762;&#x5BF9;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#xFF0C;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x4E4B;&#x540E;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x65B9;&#x5411;&#x4F9D;&#x6B21;&#x53BB;&#x626B;&#x63CF;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x8005;&#x6570;&#x7EC4;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x6570;&#x636E;&#x5F62;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6BCF;&#x6B21;&#x626B;&#x63CF;&#x4E4B;&#x540E;&#x5904;&#x7406;&#x7A97;&#x53E3;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x8005;&#x6570;&#x7EC4;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x672C;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x7EDF;&#x8BA1;&#x4E0B;words&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x5728;wordMap&#x4E2D;&#xFF0C;&#x5F53;&#x505A;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x8981;&#x6BD4;&#x8F83;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x90FD;&#x518D;&#x6765;&#x8BA1;&#x7B97;&#x4E00;&#x904D;wordMap&#x4E86;&#x3002;&#x56E0;&#x4E3A;words&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x628A;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#x8BB0;&#x4E3A;wordLength&#xFF0C;&#x628A;words&#x7684;&#x5B57;&#x7B26;&#x6570;&#x91CF;&#x8BB0;&#x4E3A;n&#xFF0C;&#x90A3;words&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x62FC;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x53EF;&#x4EE5;&#x7EC4;&#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#x662F;maxWordLength&#x3002;&#x7136;&#x540E;&#x4ECE;&#x5DE6;&#x5F80;&#x53F3;&#xFF0C;&#x6BCF;&#x6B21;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x590D;&#x5236;&#x4E00;&#x4EFD;wordMap&#x5230;diffMap&#x4E2D;&#xFF0C;&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x6BD4;&#x8F83;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;n&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;wordLength&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5728;diffMap&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;diffMap&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5C31;&#x4EE3;&#x8868;&#x8BE5;&#x6B21;&#x8BFB;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x76F4;&#x63A5;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x8F6E;&#x8BFB;&#x53D6;&#x3002;&#x90A3;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x8BE5;&#x6B21;&#x8BFB;&#x53D6;&#x51FA;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4E8E;diffMap&#x4E2D;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x628A;diffMap&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x51CF;1&#xFF0C;&#x4E00;&#x76F4;&#x51CF;&#x5230;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5C0F;&#x4E8E;0&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x5F53;&#x524D;&#x7684;&#x8BFB;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x90FD;&#x662F;n&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x51CF;1&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9664;&#x975E;&#x5168;&#x90E8;&#x7B26;&#x5408;diffMap&#x7684;&#x5B57;&#x7B26;&#x6570;&#xFF0C;&#x5426;&#x8005;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x67D0;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x51CF;1&#x4E4B;&#x540E;&#x5C0F;&#x4E8E;0&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x8FD0;&#x7B97;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x9664;&#x975E;&#x51FA;&#x73B0;&#x5C0F;&#x4E8E;0&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x5C31;&#x8868;&#x793A;&#x90FD;&#x662F;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF0C;&#x5728;leetcode&#x4E0A;&#x6267;&#x884C;&#x7528;&#x65F6;&#xFF1A;91ms&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;class Solution {</span><br><span class="line">    public List&lt;Integer&gt; findSubstring(String s, String[] words) {</span><br><span class="line">        List&lt;Integer&gt; result = new ArrayList&lt;&gt;();</span><br><span class="line">        if (words.length == 0) return result;</span><br><span class="line">        int wordLength = words[0].length(), maxWordLength = wordLength * words.length;</span><br><span class="line">        Map&lt;String, Integer&gt; wordMap = new HashMap&lt;&gt;();</span><br><span class="line">        for (String word : words) {</span><br><span class="line">            wordMap.put(word, wordMap.getOrDefault(word, 0) + 1);</span><br><span class="line">        }</span><br><span class="line">        Map&lt;String, Integer&gt; diffMap = new HashMap&lt;&gt;();</span><br><span class="line">        for (int i = 0; i &lt; s.length() - maxWordLength + 1; i++) {</span><br><span class="line">            diffMap.clear();</span><br><span class="line">            diffMap.putAll(wordMap);</span><br><span class="line">            boolean haveIndex = true;</span><br><span class="line">            for (int n = 0; n &lt; words.length; n++) {</span><br><span class="line">                String word = s.substring(i + n * wordLength, i + (n + 1) * wordLength);</span><br><span class="line">                int value = diffMap.getOrDefault(word, 0) - 1;</span><br><span class="line">                if (value &gt;= 0) {</span><br><span class="line">                    diffMap.put(word, value);</span><br><span class="line">                } else {</span><br><span class="line">                    haveIndex = false;</span><br><span class="line">                    break;</span><br><span class="line">                }</span><br><span class="line">            }</span><br><span class="line">            if (haveIndex) {</span><br><span class="line">                result.add(i);</span><br><span class="line">            }</span><br><span class="line">        }</span><br><span class="line">        return result;</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h2 id="&#x65B9;&#x6CD5;&#x4E8C;"><a href="#&#x65B9;&#x6CD5;&#x4E8C;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E8C;"></a>&#x65B9;&#x6CD5;&#x4E8C;</h2><p>&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x4EE5;&#x4E0A;&#x7684;&#x7B97;&#x6CD5;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x6D6A;&#x8D39;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x4E86;n&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x51FA;&#x6765;&#x505A;&#x6BD4;&#x8F83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x662F;&#x5B58;&#x5728;&#x91CD;&#x590D;&#x8BFB;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x6BD4;&#x8F83;&#x7684;&#x3002;&#x57FA;&#x4E8E;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x4EE5;&#x4E0A;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x521D;&#x59CB;&#x5316;wordMap&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x6807;&#x8BB0;&#x4E3A;&#x8D1F;&#x6570;&#xFF0C;&#x4F5C;&#x4E3A;&#x54C8;&#x5E0C;&#x8868;&#x3002;&#x4ECE;&#x5DE6;&#x5F80;&#x53F3;&#x8BFB;&#x53D6;&#xFF0C;&#x8BB0;&#x5B57;&#x7B26;&#x4E32;s&#x7684;&#x957F;&#x5EA6;&#x4E3A;ls&#xFF0C;&#x8BB0;&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4F4D;&#x7F6E;i&#xFF0C;&#x8BB0;words&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x4E3A;wordLength&#xFF0C;words&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x91CF;&#x8BB0;&#x4E3A;n&#xFF0C;&#x4ECE;i&#x5F00;&#x59CB;&#xFF0C;&#x8BFB;&#x53D6;n&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;wordLength&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x628A;i~ls&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5212;&#x5206;&#x4E3A;&#x6570;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;wordLength&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6700;&#x540E;&#x51E0;&#x4E2A;&#x4E0D;&#x6EE1;&#x8DB3;wordLength&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x53EF;&#x4EE5;&#x820D;&#x5F03;&#x6389;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E86;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x597D;&#x4E86;&#x6ED1;&#x52A8;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x5F00;&#x59CB;&#x79FB;&#x52A8;&#xFF0C;&#x6BCF;&#x6B21;&#x5F00;&#x59CB;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;wordMap&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;diffMap&#x4E2D;&#x521D;&#x59CB;&#x5316;diffMap&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x6BCF;&#x6B21;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;wordLength&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x7ED9;diffMap&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x52A0;1&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;&#x7B49;&#x4E8E;0&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x5220;&#x9664;&#x8BE5;&#x952E;&#x503C;&#xFF0C;&#x5982;&#x679C;diffMap&#x4E2D;&#x521A;&#x597D;&#x5168;&#x90FD;&#x88AB;&#x79FB;&#x9664;&#x4E86;&#xFF0C;&#x8868;&#x793A;&#x521A;&#x597D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;&#x5F53;&#x524D;&#x7684;&#x503C;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8868;&#x793A;&#x5168;&#x90FD;&#x4E0D;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5916;&#x5C42;&#x5FAA;&#x73AF;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x53EA;&#x9700;&#x8981;0~wordLength-1&#x6B21;&#xFF0C;&#x56E0;&#x4E3A;wordLength&#x957F;&#x5EA6;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x624D;&#x80FD;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x5B9E;&#x9645;&#x4E0A;&#x7684;&#x5F00;&#x59CB;&#x4F4D;&#x7F6E;&#x5728;wordLength&#x4F4D;&#x7F6E;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C;&#x4E00;&#x8F6E;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4E2D;&#x6BD4;&#x8F83;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF0C;&#x5728;leetcode&#x4E0A;&#x6267;&#x884C;&#x7528;&#x65F6;&#xFF1A;11ms&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;class Solution {</span><br><span class="line">    public List&lt;Integer&gt; findSubstring(String s, String[] words) {</span><br><span class="line">        List&lt;Integer&gt; result = new ArrayList&lt;&gt;();</span><br><span class="line">        if (words.length == 0) return result;</span><br><span class="line">        int wordLength = words[0].length(), maxWordLength = wordLength * words.length;</span><br><span class="line">        Map&lt;String, Integer&gt; wordMap = new HashMap&lt;&gt;();</span><br><span class="line">        for (String word : words) {</span><br><span class="line">            wordMap.put(word, wordMap.getOrDefault(word, 0) - 1);</span><br><span class="line">        }</span><br><span class="line">        Map&lt;String, Integer&gt; diffMap = new HashMap&lt;&gt;();</span><br><span class="line">        for (int i = 0; i &lt; wordLength &amp;&amp; i + maxWordLength &lt;= s.length(); i++) {</span><br><span class="line">            diffMap.clear();</span><br><span class="line">            diffMap.putAll(wordMap);</span><br><span class="line">            for (int j = 0; i + (j + 1) * wordLength &lt;= s.length(); j++) {</span><br><span class="line">                int startIndex = i + j * wordLength;</span><br><span class="line">                int endIndex = i + (j + 1) * wordLength;</span><br><span class="line">                if (j &gt;= words.length) {</span><br><span class="line">                    String firstWord = s.substring(startIndex - maxWordLength, endIndex - maxWordLength);</span><br><span class="line">                    int value = diffMap.getOrDefault(firstWord, 0) - 1;</span><br><span class="line">                    if (value == 0) {</span><br><span class="line">                        diffMap.remove(firstWord);</span><br><span class="line">                    } else {</span><br><span class="line">                        diffMap.put(firstWord, value);</span><br><span class="line">                    }</span><br><span class="line">                }</span><br><span class="line">                String nextWord = s.substring(startIndex, endIndex);</span><br><span class="line">                int value = diffMap.getOrDefault(nextWord, 0) + 1;</span><br><span class="line">                if (value != 0) {</span><br><span class="line">                    diffMap.put(nextWord, value);</span><br><span class="line">                } else {</span><br><span class="line">                    diffMap.remove(nextWord);</span><br><span class="line">                    if (diffMap.isEmpty()) {</span><br><span class="line">                        result.add(endIndex - maxWordLength);</span><br><span class="line">                    }</span><br><span class="line">                }</span><br><span class="line">            }</span><br><span class="line">        }</span><br><span class="line">        return result;</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76F8;&#x6BD4;&#x4E8E;&#x65B9;&#x6CD5;&#x4E00;&#xFF0C;&#x901F;&#x5EA6;&#x63D0;&#x9AD8;&#x4E86;8&#x500D;&#x3002;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x76F8;&#x4E92;&#x7ED3;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x5806;&#x6808;&#x3001;&#x961F;&#x5217;&#xFF0C;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x63D0;&#x9AD8;&#x7B97;&#x7684;&#x6548;&#x7387;&#x3002;&#x5728;&#x5229;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x8BBE;&#x8BA1;&#x7B97;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5230;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x8BDD;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x6709;&#x7528;&#x3002;</p>
<h1 id="&#x4E94;&#x3001;&#x76F4;&#x7EBF;&#x4E0A;&#x6700;&#x591A;&#x7684;&#x70B9;&#x6570;"><a href="#&#x4E94;&#x3001;&#x76F4;&#x7EBF;&#x4E0A;&#x6700;&#x591A;&#x7684;&#x70B9;&#x6570;" class="headerlink" title="&#x4E94;&#x3001;&#x76F4;&#x7EBF;&#x4E0A;&#x6700;&#x591A;&#x7684;&#x70B9;&#x6570;"></a>&#x4E94;&#x3001;&#x76F4;&#x7EBF;&#x4E0A;&#x6700;&#x591A;&#x7684;&#x70B9;&#x6570;</h1><p>&#x9898;&#x76EE;&#x63CF;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;points&#xFF0C;&#x5176;&#x4E2D; points[i] = [xi, yi] &#x8868;&#x793A; X-Y &#x5E73;&#x9762;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#x3002;&#x6C42;&#x6700;&#x591A;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x70B9;&#x5728;&#x540C;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x4E0A;&#x3002;<a href="#user-content-fn-3">3</a></p>
</blockquote>
<p>&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x5750;&#x6807;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E8C;&#x5143;&#x4E00;&#x6B21;&#x51FD;&#x6570;&#x6765;&#x8868;&#x793A;&#x662F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<strong>y=ax+b</strong>&#x5F62;&#x5F0F;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7279;&#x4F8B;&#x662F;<strong>x=c</strong>(c&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5E38;&#x6570;)&#xFF0C;&#x4E8C;&#x5143;&#x4E00;&#x6B21;&#x65B9;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x51FD;&#x6570;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x5F62;&#x5F0F;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;X-Y&#x5E73;&#x9762;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x76F4;&#x7EBF;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x4E24;&#x4E2A;&#x70B9;&#x6765;&#x8868;&#x793A;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x9700;&#x8981;&#x5224;&#x65AD;&#x5269;&#x4E0B;&#x7684;&#x70B9;&#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x90A3;&#x6211;&#x4EEC;&#x501F;&#x6B64;&#x6765;&#x6784;&#x5EFA;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x7167;&#x5206;&#x6876;&#x7B97;&#x6CD5;&#x6765;&#x7ED9;&#x70B9;&#x5206;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#x5176;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x503C;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x5206;&#x6876;&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x5F88;&#x76F4;&#x89C2;&#x7684;&#x4E00;&#x79CD;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x5B9E;&#x73B0;&#xFF0C;&#x6309;&#x7167;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x5206;&#x6210;&#x591A;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x6BCF;&#x4E2A;&#x6876;&#x5206;&#x522B;&#x7EF4;&#x62A4;&#x81EA;&#x5DF1;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x7BA1;&#x7406;&#x6BCF;&#x4E2A;&#x6876;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x5728;&#x672C;&#x95EE;&#x9898;&#x4E2D;&#x56E0;&#x4E3A;&#x4E24;&#x70B9;&#x6210;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;[xi, yi]&#x548C;[xi+1, yi+1]&#x4E24;&#x4E24;&#x76F8;&#x51CF;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x6309;&#x7167;<strong>y=ax+b</strong>&#x6765;&#x8BA1;&#x7B97;&#x51FA;a&#x548C;b&#xFF0C;&#x6216;&#x8005;&#x5F53;x&#x5750;&#x6807;&#x90FD;&#x4E00;&#x6837;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x6309;&#x7167;<strong>x=c</strong>&#x6765;&#x8BA1;&#x7B97;&#x51FA;c&#xFF0C;&#x5BF9;&#x4E8E;<strong>y=ax+b</strong>&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x6309;&#x7167;a&#x5206;&#x6210;&#x4E00;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x4E2D;&#x518D;&#x6309;&#x7167;b&#x518D;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5212;&#x5206;&#xFF0C;&#x7EC6;&#x5212;&#x5206;&#x51FA;&#x65B0;&#x7684;&#x6876;&#x6765;&#xFF0C;&#x53E6;&#x5916;&#x5BF9;&#x4E8E;<strong>x=c</strong>&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x628A;c&#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#x5212;&#x5206;&#x51FA;&#x6570;&#x636E;&#x6765;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x6876;&#x3002;&#x4EE5;a&#x3001;b&#x3001;c&#x4F5C;&#x4E3A;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x636E;&#x5206;&#x5230;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x6876;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x8BA1;&#x6570;&#x6709;&#x591A;&#x5C11;&#x70B9;&#x662F;&#x4E00;&#x6761;&#x76F4;&#x63A5;&#x4E0A;&#x7684;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;leetcode&#x4E0A;&#x6267;&#x884C;&#x7528;&#x65F6;: 29ms&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br></pre></td><td class="code"><pre><span class="line">java&#x590D;&#x5236;&#x4EE3;&#x7801;class Solution {</span><br><span class="line">    public int maxPoints(int[][] points) {</span><br><span class="line">        if (points.length &lt;= 2) return points.length;</span><br><span class="line">        int result = 0;</span><br><span class="line">        Map&lt;Float, Map&lt;Float, Set&lt;int[]&gt;&gt;&gt; map = new HashMap&lt;&gt;();</span><br><span class="line">        Map&lt;Integer, Set&lt;int[]&gt;&gt; xMap = new HashMap&lt;&gt;();</span><br><span class="line">        for (int i = 0; i &lt; points.length - 1; i++) {</span><br><span class="line">            for (int f = i + 1; f &lt; points.length; f++) {</span><br><span class="line">                float dx = (float) points[i][0] - points[f][0];</span><br><span class="line">                float dy = (float) points[i][1] - points[f][1];</span><br><span class="line">                float pi = dy / dx;</span><br><span class="line">                float b = points[i][1] - pi * points[i][0];</span><br><span class="line">                Set&lt;int[]&gt; value = null;</span><br><span class="line">                if (dx == 0) {</span><br><span class="line">                    value = xMap.computeIfAbsent(points[i][0], k -&gt; new HashSet&lt;&gt;());</span><br><span class="line">                }</span><br><span class="line">                if (value == null) {</span><br><span class="line">                    Map&lt;Float, Set&lt;int[]&gt;&gt; bMap = map.computeIfAbsent(pi, k -&gt; new HashMap&lt;&gt;());</span><br><span class="line">                    value = bMap.computeIfAbsent(b, k -&gt; new HashSet&lt;&gt;());</span><br><span class="line">                }</span><br><span class="line">                value.add(points[i]);</span><br><span class="line">                value.add(points[f]);</span><br><span class="line">                result = Math.max(value.size(), result);</span><br><span class="line">            }</span><br><span class="line">        }</span><br><span class="line">        return result;</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h1 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h1><p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x4E86;&#x4F8B;&#x5B50;&#x6765;&#x8BB2;&#x89E3;&#x8BF4;&#x660E;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x8BBE;&#x8BA1;&#x9AD8;&#x6548;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x64CD;&#x4F5C;&#x505A;&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x3001;&#x54C8;&#x5E0C;&#x8868;&#x3001;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x5176;&#x4E2D;&#x5173;&#x4E8E;&#x5173;&#x952E;&#x5B57;&#x51FD;&#x6570;&#x7684;&#x8BBE;&#x8BA1;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x6BD4;&#x5982;&#x76F4;&#x63A5;&#x5BFB;&#x5740;&#x6CD5;&#x3001;&#x5E73;&#x65B9;&#x53D6;&#x4E2D;&#x6CD5;&#x3001;&#x6298;&#x53E0;&#x6CD5;&#x3001;&#x968F;&#x673A;&#x6570;&#x6CD5;&#x7B49;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x7B97;&#x6CD5;&#x76F8;&#x4E92;&#x7ED3;&#x5408;&#x6765;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x6BD4;&#x5982;&#x5DEE;&#x5206;&#x7B97;&#x6CD5;&#x3001;&#x5206;&#x6876;&#x7B97;&#x6CD5;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x5E73;&#x8861;&#x6811;&#x3001;&#x94FE;&#x8868;&#x3001;&#x961F;&#x5217;&#x3001;&#x524D;&#x7F00;&#x548C;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x6570;&#x636E;&#x91CF;&#x8F83;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x73B0;&#x5B9E;&#x7684;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#x6709;&#x53EF;&#x80FD;&#x9891;&#x7E41;&#x5730;&#x51FA;&#x73B0;&#xFF0C;&#x5728;&#x51B2;&#x7A81;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x7EA2;&#x9ED1;&#x6811;&#x3001;&#x961F;&#x5217;&#x7B49;&#x7B49;&#x65B9;&#x5F0F;&#x6765;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x6700;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5173;&#x952E;&#x5B57;&#x5168;&#x90E8;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5806;&#x79EF;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x964D;&#x4F4E;&#x67E5;&#x8BE2;&#x7684;&#x6548;&#x7387;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5728;&#x5DE5;&#x4E1A;&#x4E0A;&#x8BBE;&#x8BA1;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8981;&#x5BF9;&#x6781;&#x5DEE;&#x60C5;&#x51B5;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6765;&#x8BA9;&#x54C8;&#x5E0C;&#x8868;&#x51FA;&#x73B0;&#x6700;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4ECE;&#x800C;&#x62D6;&#x6162;&#x901F;&#x5EA6;&#xFF0C;&#x4ECE;&#x800C;&#x53D1;&#x8D77;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x5408;&#x7406;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x5206;&#x6790;&#x3002;&#x4F46;&#x603B;&#x7684;&#x539F;&#x5219;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x5E0C;&#x671B;&#x5173;&#x952E;&#x5B57;&#x5C3D;&#x91CF;&#x7684;&#x552F;&#x4E00;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x51B2;&#x7A81;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5C3D;&#x91CF;&#x5730;&#x8BA9;&#x6570;&#x636E;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x5C3D;&#x91CF;&#x7684;&#x6563;&#x5217;&#x5F00;&#x6765;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x67D0;&#x4E2A;&#x6216;&#x8005;&#x67D0;&#x4E9B;&#x5173;&#x952E;&#x5B57;&#x51FA;&#x73B0;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x5806;&#x79EF;&#xFF0C;&#x4ECE;&#x800C;&#x62D6;&#x6162;&#x901F;&#x5EA6;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x5F80;&#x5F80;&#x662F;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x7684;&#xFF0C;&#x5F53;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x6E10;&#x6E10;&#x53D8;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x4E5F;&#x662F;&#x4F1A;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x822C;&#x5730;&#x53EF;&#x4EE5;&#x5728;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53BB;&#x7533;&#x8BF7;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x66F4;&#x5927;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x8FC7;&#x53BB;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x53D8;&#x5F97;&#x592A;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7F29;&#x5C0F;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x4ECE;&#x800C;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x5426;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x8981;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x79CD;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x662F;&#x5426;&#x53EA;&#x662F;&#x77ED;&#x671F;&#x5185;&#x7684;&#x6CE2;&#x52A8;&#xFF0C;&#x5982;&#x679C;&#x9891;&#x7E41;&#x5730;&#x66F4;&#x65B0;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x6548;&#x7387;&#x4E0B;&#x964D;&#xFF0C;&#x6BD4;&#x5982;&#x6CE2;&#x5CF0;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x8D85;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x6062;&#x590D;&#x6210;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x88C5;&#x586B;&#x56E0;&#x5B50;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x52A8;&#x6001;&#x7F29;&#x8868;&#x6216;&#x8005;&#x52A8;&#x6001;&#x6269;&#x8868;&#x3002;&#x5982;&#x679C;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x5B8C;&#x6210;&#x52A8;&#x6001;&#x7F29;&#x8868;&#x6216;&#x8005;&#x6269;&#x8868;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x5BF9;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x9020;&#x6210;&#x6548;&#x7387;&#x964D;&#x4F4E;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53EF;&#x4EE5;&#x5148;&#x7533;&#x8BF7;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x628A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x6279;&#x628A;&#x65E7;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x5B8C;&#x6210;&#x7F29;&#x8868;&#x6216;&#x8005;&#x6269;&#x8868;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x67E5;&#x8BE2;&#x548C;&#x5220;&#x9664;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5148;&#x53BB;&#x5728;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x65E7;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x65E2;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x52A8;&#x6001;&#x6539;&#x53D8;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x52A8;&#x6001;&#x6539;&#x53D8;&#x54C8;&#x5E0C;&#x8868;&#x3002;&#x6240;&#x4EE5;&#x64CD;&#x4F5C;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3001;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x505A;&#x51FA;&#x6743;&#x8861;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5168;&#x90E8;&#x987E;&#x53CA;&#x90A3;&#x81EA;&#x7136;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5BF9;&#x81EA;&#x5DF1;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x672C;&#x6587;&#x4E2D;&#x53EA;&#x662F;&#x8BB2;&#x4E86;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#xFF0C;&#x4F1A;&#x6BD4;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x7BA1;&#x7406;&#x7684;&#x6570;&#x636E;&#x5E9E;&#x5927;&#x5F97;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x57FA;&#x672C;&#x7684;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x6765;&#x5EFA;&#x7ACB;&#x5FEB;&#x901F;&#x7684;&#x67E5;&#x627E;&#x5173;&#x7CFB;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x9762;&#x524D;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x6536;&#x83B7;&#x5230;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x5B89;&#x5168;&#x52A0;&#x5BC6;&#x3001;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x3001;LRU&#x7F13;&#x5B58;&#x6DD8;&#x6C70;&#x7B97;&#x6CD5;&#x3001;word&#x4E2D;&#x7684;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x4F1A;&#x7528;&#x5230;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x3002;&#x8FD8;&#x6709;&#x5728;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x5982;&#x4F55;&#x5FEB;&#x901F;&#x5730;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8868;&#x6765;&#x589E;&#x5220;&#x6539;&#x67E5;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x76EE;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x5206;&#x7247;&#xFF0C;&#x7BA1;&#x7406;&#x5927;&#x578B;&#x65E5;&#x5FD7;&#x5E93;&#xFF0C;&#x5982;&#x4F55;&#x67E5;&#x627E;&#x65E5;&#x5FD7;&#x5E93;&#x4E2D;&#x67E5;&#x8BE2;&#x9891;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x662F;&#x5426;&#x5728;&#x56FE;&#x5E93;&#x4E4B;&#x4E2D;&#x7B49;&#x7B49;&#x3002;&#x8FD8;&#x6709;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x5B58;&#x50A8;&#x3001;&#x5E03;&#x8C37;&#x9E1F;&#x54C8;&#x5E0C;&#x8868;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x591A;&#x505A;&#x8D58;&#x8FF0;&#xFF0C;&#x8FD9;&#x4E9B;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x4F1A;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x601D;&#x60F3;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6709;&#x6548;&#x5730;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x6548;&#x7387;&#x3002;</p>
<h1 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h1><p>[1] Thomas H.Cormen, Charles E.Leiserson, Ronald L.Rivest, Clifford Stein&#xFF1A;&#x7B97;&#x6CD5;&#x5BFC;&#x8BBA;[M].&#x6BB7;&#x5EFA;&#x5E73;&#xFF0C;&#x5F90;&#x4E91;&#xFF0C;&#x738B;&#x521A;&#xFF0C;&#x5218;&#x6653;&#x5149;&#xFF0C;&#x82CF;&#x660E;&#xFF0C;&#x90B9;&#x6052;&#x660E;&#xFF0C;&#x738B;&#x5B8F;&#x5FD7;.<br>&#x673A;&#x68B0;&#x5DE5;&#x4E1A;&#x51FA;&#x7248;&#x793E;&#xFF0C;2012-12</p>
<h2 id="Footnotes"><a href="#Footnotes" class="headerlink" title="Footnotes"></a>Footnotes</h2><ol>
<li><a href="/external_links/a6b3c4e9bfc6fe3e4d75e6ba5ad9c336.html" target="blank" rel="noopener">leetcode.cn/problems/re&#x2026;</a> <a href="#user-content-fnref-1">&#x21A9;</a></li>
<li><a href="/external_links/959e007f0a15517744f3d626c9ee2460.html" target="blank" rel="noopener">leetcode.cn/problems/su&#x2026;</a> <a href="#user-content-fnref-2">&#x21A9;</a></li>
<li><a href="/external_links/75ccddeda569736e497b32542e69add3.html" target="blank" rel="noopener">leetcode.cn/problems/ma&#x2026;</a> <a href="#user-content-fnref-3">&#x21A9;</a></li>
</ol>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/93fefc430a4ce0ef23688c5b469a06cb.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/算法/" rel="tag"># 算法</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7344573753538789430.html" rel="next" title="在大公司工作之后才真正领悟到它真的是宇宙级编辑器 开胃菜 与">
                <i class="fa fa-chevron-left"></i> 在大公司工作之后才真正领悟到它真的是宇宙级编辑器 开胃菜 与
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7344927519923011594.html" rel="prev" title="在Jetpack Compose中使用状态提升？我提升个P">
                在Jetpack Compose中使用状态提升？我提升个P <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">1152</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">481</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#一、引言"><span class="nav-number">1.</span> <span class="nav-text">一、引言</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#二、什么是哈希思想"><span class="nav-number">2.</span> <span class="nav-text">二、什么是哈希思想</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#三、删除字符使频率相同"><span class="nav-number">3.</span> <span class="nav-text">三、删除字符使频率相同</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#四、串联所有单词的子串"><span class="nav-number">4.</span> <span class="nav-text">四、串联所有单词的子串</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#方法一"><span class="nav-number">4.1.</span> <span class="nav-text">方法一</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#方法二"><span class="nav-number">4.2.</span> <span class="nav-text">方法二</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#五、直线上最多的点数"><span class="nav-number">5.</span> <span class="nav-text">五、直线上最多的点数</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#总结"><span class="nav-number">6.</span> <span class="nav-text">总结</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#参考文献"><span class="nav-number">7.</span> <span class="nav-text">参考文献</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#Footnotes"><span class="nav-number">7.1.</span> <span class="nav-text">Footnotes</span></a></li></ol></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
