<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="后端,面试,Java,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4E00;&amp;#x3001;&amp;#x80CC;&amp;#x666F;&amp;#x73B0;&amp;#x5728;&amp;#x53C8;&amp;#x5230;&amp;#x4E86;&amp;#x91D1;&amp;#x4E09;&amp;#x94F6;&amp;#x56DB;&amp;#x7684;&amp;#x9762;&amp;#x8BD5;&amp;#x5B63;&amp;#xFF0C;&amp;#x60F3;&amp;#x8981;&amp;#x6362;&amp;#x65B0;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;">
<meta name="keywords" content="后端,面试,Java">
<meta property="og:type" content="article">
<meta property="og:title" content="我用这6个问题，就验证了2年Java面试者的真实性">
<meta property="og:url" content="https://dev.newban.cn/7356175306937892900.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4E00;&amp;#x3001;&amp;#x80CC;&amp;#x666F;&amp;#x73B0;&amp;#x5728;&amp;#x53C8;&amp;#x5230;&amp;#x4E86;&amp;#x91D1;&amp;#x4E09;&amp;#x94F6;&amp;#x56DB;&amp;#x7684;&amp;#x9762;&amp;#x8BD5;&amp;#x5B63;&amp;#xFF0C;&amp;#x60F3;&amp;#x8981;&amp;#x6362;&amp;#x65B0;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/f91b3a7e46701fb54accc5847a89537aff086420edeeae99a27e54c37c147109">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/f58098b3060d3941f6cb222197a4e88351d928b2aec7c1a59031c273cb46d3fd">
<meta property="og:updated_time" content="2024-04-27T08:11:45.946Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我用这6个问题，就验证了2年Java面试者的真实性">
<meta name="twitter:description" content="&amp;#x4E00;&amp;#x3001;&amp;#x80CC;&amp;#x666F;&amp;#x73B0;&amp;#x5728;&amp;#x53C8;&amp;#x5230;&amp;#x4E86;&amp;#x91D1;&amp;#x4E09;&amp;#x94F6;&amp;#x56DB;&amp;#x7684;&amp;#x9762;&amp;#x8BD5;&amp;#x5B63;&amp;#xFF0C;&amp;#x60F3;&amp;#x8981;&amp;#x6362;&amp;#x65B0;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/f91b3a7e46701fb54accc5847a89537aff086420edeeae99a27e54c37c147109">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7356175306937892900.html">





  <title>我用这6个问题，就验证了2年Java面试者的真实性 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">我用这6个问题，就验证了2年Java面试者的真实性</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-04-11T12:59:24+08:00">
                2024-04-11
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x4E00;&#x3001;&#x80CC;&#x666F;"><a href="#&#x4E00;&#x3001;&#x80CC;&#x666F;" class="headerlink" title="&#x4E00;&#x3001;&#x80CC;&#x666F;"></a>&#x4E00;&#x3001;&#x80CC;&#x666F;</h2><p>&#x73B0;&#x5728;&#x53C8;&#x5230;&#x4E86;&#x91D1;&#x4E09;&#x94F6;&#x56DB;&#x7684;&#x9762;&#x8BD5;&#x5B63;&#xFF0C;&#x60F3;&#x8981;&#x6362;&#x65B0;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x6700;&#x8FD1;&#x56E2;&#x961F;&#x4E5F;&#x5F00;&#x59CB;&#x9762;&#x8BD5;&#x51E0;&#x4E2A;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x524D;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x67D0;&#x4E9B;&#x7B80;&#x5386;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5305;&#x88C5;&#x6C34;&#x5206;&#x548C;&#x6216;&#x8005;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x62B1;&#x7740;&#x8BD5;&#x4E00;&#x8BD5;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x4E07;&#x4E00;&#x4EBA;&#x5BB6;&#x6709;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x611F;&#x89C9;&#x8FD8;&#x884C;&#x7684;&#x6761;&#x4EF6;&#x5462;&#xFF0C;&#x6BD4;&#x5982;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x3001;&#x601D;&#x8003;&#x80FD;&#x529B;&#x3001;&#x534F;&#x4F5C;&#x80FD;&#x529B;&#x3001;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x7B49;&#x3002;&#x800C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6301;&#x7EED;&#x4E86;10&#x5E74;+&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x4F9D;&#x7136;&#x8FD8;&#x5B58;&#x5728;&#xFF0C;&#x5C31;&#x662F;&#x5728;2-3&#x5E74;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x5185;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x6C34;&#x5206;&#x5305;&#x88C5;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x5E72;&#x8FC7;&#x4F01;&#x4E1A;&#x7684;&#x6838;&#x5FC3;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x5C31;&#x6765;&#x9762;&#x8BD5;&#x4E86;&#xFF0C;&#x672C;&#x6587;&#x5206;&#x4EAB;&#x7684;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;.</p>
<h2 id="&#x4E8C;&#x3001;&#x7B80;&#x5386;&#x7B5B;&#x9009;"><a href="#&#x4E8C;&#x3001;&#x7B80;&#x5386;&#x7B5B;&#x9009;" class="headerlink" title="&#x4E8C;&#x3001;&#x7B80;&#x5386;&#x7B5B;&#x9009;"></a>&#x4E8C;&#x3001;&#x7B80;&#x5386;&#x7B5B;&#x9009;</h2><p>&#x9762;&#x8BD5;&#x524D;&#x56E2;&#x961F;&#x6536;&#x5230;&#x4E86;8&#x4EFD;&#x6C42;&#x804C;&#x8005;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x4E86;HR&#x7684;&#x521D;&#x7B5B;&#xFF0C;&#x7136;&#x540E;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#xFF0C;&#x8BA4;&#x771F;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#x548C;&#x770B;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x793E;&#x4F1A;&#x8FD8;&#x662F;&#x8001;&#x6837;&#x5B50;&#xFF0C;&#x62DB;&#x8058;3&#x5E74;&#x7684;&#xFF0C;&#x6536;&#x5230;&#x7684;&#x7B80;&#x5386;&#x660E;&#x9762;&#x4E0A;&#x662F;3&#x5E74;&#xFF0C;&#x5B9E;&#x9645;7&#x4E2A;&#x662F;22&#x5E74;&#x6BD5;&#x4E1A;&#x7684;(&#x8FD8;&#x5DEE;3&#x4E2A;&#x6708;&#x6EE1;2&#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x90FD;&#x662F;&#x4EE5;&#x6BD5;&#x4E1A;&#x65F6;&#x95F4;&#x4E3A;&#x51C6;&#x7684;)&#xFF0C;1&#x4E2A;&#x662F;21&#x5E74;&#x6BD5;&#x4E1A;&#x7684;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;2-3&#x5E74;&#x7684;&#x51FA;&#x6765;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x548C;&#x8FC7;&#x53BB;10&#x5E74;&#x4E00;&#x6837;&#xFF0C;&#x6C34;&#x5206;&#x5F88;&#x5927;&#x7684;&#x5360;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x5E02;&#x573A;&#x3002;&#x6240;&#x4EE5;&#x771F;&#x5B9E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x4E0D;&#x6B62;&#x6211;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#xFF0C;&#x53EF;&#x80FD;&#x5176;&#x4ED6;&#x4F01;&#x4E1A;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x8FD9;8&#x4E2A;&#x7B97;&#x4E0D;&#x662F;&#x4F18;&#x79C0;&#x7B80;&#x5386;&#xFF0C;&#x4E5F;&#x66B4;&#x9732;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x603B;&#x7ED3;&#x7684;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><strong>(1)&#x3001;2&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x9879;&#x76EE;&#x5305;&#x88C5;&#x6C34;&#x5206;&#x6216;&#x9879;&#x76EE;&#x6CA1;&#x505A;&#x8FC7;&#x7684;&#x5305;&#x88C5;&#x6C34;&#x5206;</strong></p>
<p><strong>(2)&#x3001;2&#x4E2A;&#x4EBA;&#x7684;&#x7B80;&#x5386;&#x4E0A;&#x4E0D;&#x8BA4;&#x771F;&#xFF0C;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x548C;&#x5B58;&#x5728;&#x9519;&#x8BEF;&#x6280;&#x672F;&#x540D;&#x79F0;&#x548C;&#x6C49;&#x5B57;</strong></p>
<p><strong>(3)&#x3001;2&#x4E2A;&#x4EBA;&#x7684;&#x7B80;&#x5386;&#x9879;&#x76EE;&#x6280;&#x672F;&#x6808;&#x8001;&#x65E7;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x5199;struts2&#xFF0C;&#x975E;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x6838;&#x5FC3;java&#x6280;&#x672F;</strong></p>
<p><strong>(4)&#x3001;2&#x4E2A;&#x4EBA;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x4E2D;&#x89C4;&#x4E2D;&#x4E3E;&#xFF0C;&#x6BD4;&#x8F83;&#x4E00;&#x822C;&#xFF0C;&#x4F46;&#x662F;&#x9879;&#x76EE;&#x5E94;&#x8BE5;&#x771F;&#x5B9E;&#xFF0C;&#x4F46;&#x662F;&#x5165;&#x804C;&#x540E;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4EBA;&#x5E26;&#x4E00;&#x5E26;</strong></p>
<p>&#x8FD9;&#x51E0;&#x4EFD;&#x7B80;&#x5386;&#x5171;&#x6027;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x6BD4;&#x5982;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x81EA;&#x5DF1;&#x7B80;&#x5386;&#x662F;&#x8BA4;&#x771F;&#x6253;&#x78E8;&#x8FC7;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x82B1;&#x65F6;&#x95F4;&#x6574;&#x7406;&#x7684;&#xFF0C;&#x6709;&#x7684;&#x7A7A;&#x767D;&#x533A;&#x57DF;&#x5F88;&#x591A;&#xFF0C;&#x6709;&#x7684;&#x8D1F;&#x8D23;&#x7684;&#x63CF;&#x8FF0;&#x4F9D;&#x7136;&#x662F;&#x4F7F;&#x7528;XXX&#x6280;&#x672F;&#x5B9E;&#x73B0;aaa&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x6709;1-4&#x5E74;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x6295;&#x9012;&#x7B80;&#x5386;&#x8BF4;&#x627E;&#x4E0D;&#x5230;&#x9762;&#x8BD5;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x6C34;&#x5206;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x7528;&#x5FC3;&#x627E;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4EE5;&#x524D;&#x6709;&#x4F4D;&#x5927;&#x4F6C;&#x8BF4;&#x8FC7;&#xFF1A;<strong>&#x540C;&#x6837;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x9009;&#x90A3;&#x4E2A;&#x66F4;&#x52A0;&#x7EC6;&#x817B;&#x7684;&#xFF0C;&#x6392;&#x7248;&#x597D;&#x770B;&#x7684;&#x3002;&#x4E5F;&#x66F4;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x4E25;&#x683C;&#x8981;&#x6C42;&#x7684;&#xFF0C;&#x5199;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4E5F;&#x5F88;&#x9AD8;</strong>&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5305;&#x88C5;&#x7684;&#x6C34;&#x5206;&#x7684;&#x6C42;&#x804C;&#x8005;&#xFF0C;&#x6BD5;&#x7ADF;&#x4ED6;&#x7684;&#x6280;&#x672F;&#x6808;&#x548C;&#x5185;&#x5BB9;&#x4E0E;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x7684;&#x9700;&#x6C42;&#x5339;&#x914D;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x4E07;&#x4E00;&#x662F;&#x5305;&#x88C5;&#x8005;&#x4E2D;&#x7684;&#x9876;&#x5C16;&#x68AF;&#x961F;&#x7684;&#x4EBA;&#x5462;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x9762;&#x8BD5;&#x95EE;&#x9898;"><a href="#&#x4E09;&#x3001;&#x9762;&#x8BD5;&#x95EE;&#x9898;" class="headerlink" title="&#x4E09;&#x3001;&#x9762;&#x8BD5;&#x95EE;&#x9898;"></a>&#x4E09;&#x3001;&#x9762;&#x8BD5;&#x95EE;&#x9898;</h2><p>&#x9762;&#x8BD5;&#x5F00;&#x59CB;&#x4E86;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x6765;&#x9A8C;&#x8BC1;&#x4ED6;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6DF1;&#x5165;&#x95EE;&#x4E00;&#x95EE;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;&#x4E0B;&#x7B80;&#x5386;&#x622A;&#x56FE;&#x5427;&#x5927;&#x5BB6;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/f91b3a7e46701fb54accc5847a89537aff086420edeeae99a27e54c37c147109" alt></p>
<p><strong>1&#x3001;&#x95EE;&#x9898;1&#xFF1A;&#x8BF7;&#x8BF4;&#x8BF4;&#x4F60;&#x6700;&#x505A;&#x7684;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x4EBA;&#x5458;&#x60C5;&#x51B5;&#x548C;&#x9879;&#x76EE;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6570;&#x91CF;&#x5427;&#xFF1F;</strong></p>
<p>&#x6C42;&#x804C;&#x8005;&#x56DE;&#x7B54;&#xFF1A;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x628A;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x6240;&#x6709;&#x89D2;&#x8272;&#x90FD;&#x8BF4;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x3001;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x540E;&#x7AEF;&#x3001;UI&#x3001;&#x8FD8;&#x8BF4;&#x4E86;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x540C;&#x65F6;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x662F;&#x5171;&#x4EAB;&#x6253;&#x5370;&#x673A;&#xFF0C;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x4E1A;&#x52A1;&#x7684;&#x8BF4;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x5171;&#x4EAB;&#x6253;&#x5370;&#x673A;&#xFF0C;&#x540C;&#x65F6;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6570;&#x91CF;&#x662F;30&#x4E2A;&#x3002;</p>
<p>&#x5F53;&#x4ED6;&#x8BF4;&#x51FA;&#x56E2;&#x961F;&#x4EBA;&#x5458;&#x4E2D;&#x5B58;&#x5728;&#x67B6;&#x6784;&#x5E08;&#x548C;&#x6570;&#x91CF;&#x662F;30&#x4E2A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x6709;&#x4E9B;&#x6000;&#x7591;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x4ED6;&#x8FD9;&#x4E2A;&#x4F53;&#x91CF;&#x548C;&#x7ECF;&#x9A8C;&#x548C;&#x516C;&#x53F8;&#x73AF;&#x5883;&#x5E94;&#x8BE5;&#x4E0D;&#x8DB3;&#x4EE5;&#x652F;&#x6301;&#x4ED6;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6709;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x56E2;&#x961F;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x7B80;&#x5386;&#x548C;&#x63CF;&#x8FF0;&#xFF0C;&#x540C;&#x65F6;&#x81EA;&#x5DF1;&#x53E3;&#x8FF0;&#x7684;&#x9879;&#x76EE;&#x540D;&#x79F0;&#x548C;&#x7B80;&#x5386;&#x4E0A;&#x7684;&#x4E0D;&#x4E00;&#x81F4;</p>
<p><strong>2&#x3001;&#x95EE;&#x9898;2&#xFF1A;&#x65E2;&#x7136;&#x4F60;&#x4EEC;&#x5FAE;&#x670D;&#x52A1;&#x62C6;&#x5206;&#x7684;&#x8FD9;&#x4E48;&#x7EC6;&#xFF0C;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x90A3;&#x4F60;&#x8BF4;&#x8BF4;&#x5982;&#x679C;1&#x4E2A;&#x63A5;&#x53E3;&#x4E2D;&#xFF0C;&#x8C03;&#x7528;&#x4E86;A/B/C&#x4E09;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;C&#x5931;&#x8D25;&#x4E86;&#x600E;&#x4E48;&#x529E;&#xFF1F;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x56DE;&#x7B54;&#x7684;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x901A;&#x8FC7;&#x4ED6;&#x7684;&#x56DE;&#x7B54;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x51FA;&#x6765;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x6CA1;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x4E2D;&#xFF0C;&#x8C03;&#x7528;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FC7;&#x5931;&#x8D25;&#x7684;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#x65B9;&#x6848;&#x7B49;</p>
<p><strong>3&#x3001;&#x95EE;&#x9898;3&#xFF1A;&#x8BF4;&#x8BF4;&#x4F60;&#x5BF9;&#x96C6;&#x7FA4;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x7406;&#x89E3;?</strong></p>
<p>&#x8FD9;&#x4F4D;&#x5144;&#x5F1F;&#x524D;&#x671F;&#x8BF4;&#x7684;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x540E;&#x671F;&#x7A81;&#x7136;&#x8BF4;&#x7684;&#x5F88;&#x516B;&#x80A1;&#x8BDD;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x5BF9;&#x4ED6;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x70B9;&#x6000;&#x7591;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x8FDC;&#x7A0B;&#x89C6;&#x9891;&#x4F1A;&#x8BAE;&#x4E2D;&#x5173;&#x6CE8;&#x4ED6;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x52A8;&#x4F5C;&#xFF0C;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x95EE;&#x4ED6;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x5F88;&#x591A;&#x771F;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#x8FC7;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#x6709;&#x4E9B;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x679C;&#x7136;&#x8BA9;&#x6211;&#x4EA7;&#x751F;&#x4E86;&#x6000;&#x7591;&#x3002;</p>
<p>&#x611F;&#x89C9;&#x5F53;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x5230;&#x5BF9;XXX&#x7406;&#x89E3;&#x8FD9;&#x79CD;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x786E;&#x5B9E;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#x8BF4;&#x7684;&#x4E0D;&#x592A;&#x660E;&#x767D;&#xFF0C;&#x6BD5;&#x7ADF;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x4F01;&#x4E1A;&#x9879;&#x76EE;&#x5386;&#x7EC3;&#xFF0C;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x7528;&#x522B;&#x4EBA;&#x80FD;&#x591F;&#x542C;&#x61C2;&#x7684;&#x65B9;&#x5F0F;&#x8BB2;&#x8FF0;&#x51FA;&#x6765;&#xFF0C;&#x540C;&#x65F6;&#x81EA;&#x5DF1;&#x4E5F;&#x6CA1;&#x6709;&#x9605;&#x8BFB;&#x548C;&#x5B66;&#x4E60;&#x5927;&#x91CF;&#x7684;&#x7406;&#x8BBA;&#xFF0C;&#x5C31;&#x51FA;&#x53BB;&#x9762;&#x8BD5;&#x4E86;&#x3002;</p>
<p><strong>4&#x3001;&#x95EE;&#x9898;4&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;RabbitMQ&#x4E0D;&#x7528;&#x5176;&#x4ED6;&#x7684;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;MQ&#x91CD;&#x590D;&#x6D88;&#x8D39;&#x5982;&#x4F55;&#x89E3;&#x51B3;</strong></p>
<p>&#x8FD9;&#x4F4D;&#x5144;&#x5F1F;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x56DE;&#x7B54;&#x51FA;&#x6765;&#x91CD;&#x590D;&#x6D88;&#x8D39;&#x515C;&#x5E95;&#x7684;&#x7B56;&#x7565;&#xFF1A;&#x7528;&#x6570;&#x636E;&#x5E93;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x4FDD;&#x969C;&#x5E42;&#x7B49;&#x6027;&#x548C;&#x515C;&#x5E95;&#x3002;</p>
<p>&#x4ED6;&#x8BF4;&#x4E86;&#x7528;redis&#x5224;&#x65AD;&#x3001;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x9762;&#x52A0;&#x4E2A;&#x5B57;&#x6BB5;&#x3001;&#x8BF4;&#x7528;&#x884C;&#x9501;&#xFF0C;&#x671F;&#x95F4;&#x6211;&#x4E5F;&#x95EE;&#x5230;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5426;&#x5B89;&#x5168;&#xFF0C;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x6B64;&#x65F6;&#x4ECE;&#x5FC3;&#x7406;&#x548C;&#x884C;&#x4E3A;&#x5B66;&#x4E0A;&#x770B;&#xFF0C;&#x54E5;&#x4EEC;&#x7684;&#x624B;&#x653E;&#x5728;&#x4E86;&#x5934;&#x4E0A;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x660E;&#x663E;&#x7684;&#x4E0D;&#x4F1A;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x540C;&#x65F6;&#x773C;&#x955C;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x70B9;&#x53CD;&#x5149;&#x548C;&#x767D;&#x8272;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x4ED6;&#x7684;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x5728;&#x7B80;&#x5386;&#x4E0A;&#x5199;RabbitMQ&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6CA1;&#x6709;&#x8FC7;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x7684;&#x65B0;&#x624B;&#x6216;&#x4F4E;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6211;&#x59CB;&#x7EC8;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x4EF7;&#x503C;&#x4E0D;&#x5927;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x4E5F;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x95EE;&#x5230;&#x539F;&#x7406;&#x548C;&#x6E90;&#x7801;&#x7C7B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x65E2;&#x7136;&#x662F;&#x9762;&#x8BD5;Java&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4E3A;&#x5565;&#x4E0D;&#x8C22;&#x8C22;RocketMQ&#x5462;&#xFF0C;&#x53EA;&#x8981;&#x7A0D;&#x5FAE;&#x770B;&#x4E0B;&#x6E90;&#x7801;&#x548C;&#x539F;&#x7406;&#x5C31;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x9886;&#x5148;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E86;&#xFF0C;&#x770B;&#x4E0B;&#x6E90;&#x7801;&#x540E;&#xFF0C;&#x4E0D;&#x4EC5;&#x9762;&#x8BD5;&#x80FD;&#x63D0;&#x9AD8;&#x901A;&#x8FC7;&#x7387;&#xFF0C;&#x8FD8;&#x80FD;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x6709;&#x63D0;&#x9AD8;&#x3002;</p>
<p><strong>5&#x3001;&#x95EE;&#x9898;5&#xFF1A;&#x6211;&#x770B;&#x4ED6;&#x5199;&#x4E86;&#x8BA2;&#x5355;&#x548C;&#x652F;&#x4ED8;&#x7684;&#x529F;&#x80FD;&#x548C;&#x4E1A;&#x52A1;&#xFF0C;&#x6211;&#x95EE;&#x8BF7;&#x8BF4;&#x8BF4;&#x56DE;&#x8C03;&#x63A5;&#x53E3;&#x548C;&#x9884;&#x652F;&#x4ED8;&#x5355;&#x521B;&#x5EFA;&#x63A5;&#x53E3;&#x5982;&#x4F55;&#x4FDD;&#x969C;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3001;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3001;&#x91CD;&#x590D;&#x652F;&#x4ED8;&#x3001;&#x91CD;&#x590D;&#x56DE;&#x8C03;&#x95EE;&#x9898;</strong></p>
<p>&#x8FD9;&#x4F4D;&#x5144;&#x5F1F;&#x7684;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F7B;&#x5E95;&#x7684;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x5199;&#x7684;&#x4E1A;&#x52A1;&#x786E;&#x5B9E;&#x6CA1;&#x600E;&#x4E48;&#x6DF1;&#x5165;&#x505A;&#x8FC7;&#xFF0C;&#x5F88;&#x591A;&#x5199;&#x652F;&#x4ED8;&#x8BA2;&#x5355;&#x7684;&#x4E1A;&#x52A1;&#x7684;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x95EE;&#x4ED6;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5982;&#x679C;&#x8BF4;&#x7684;&#x8DB3;&#x591F;&#x900F;&#x5F7B;&#xFF0C;&#x90A3;&#x5E94;&#x8BE5;&#x662F;&#x771F;&#x7684;&#x505A;&#x8FC7;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x505A;&#x8FC7;&#x652F;&#x4ED8;&#x548C;&#x8BA2;&#x5355;&#x76F8;&#x5173;&#x4E1A;&#x52A1;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x4F1A;&#x6BD4;&#x8F83;&#x7406;&#x89E3;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x652F;&#x4ED8;&#x56DE;&#x8C03;&#x3001;&#x53D6;&#x6D88;&#x8BA2;&#x5355;&#x3001;&#x9884;&#x652F;&#x4ED8;&#x76F8;&#x5173;&#x63A5;&#x53E3;&#x7684;&#x5B89;&#x5168;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5305;&#x62EC;&#x8FD9;&#x4E2A;&#x5144;&#x5F1F;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x4E5F;&#x60F3;&#x5F15;&#x5BFC;&#x4ED6;&#x3002;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x6216;&#x8005;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x8C03;&#x7528;API&#x8D70;&#x4E86;&#x4E2A;&#x6D41;&#x7A0B;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x5728;&#x4E4B;&#x524D;&#x5B66;&#x4E60;&#x652F;&#x4ED8;&#x548C;&#x8BA2;&#x5355;&#x4E1A;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x56FE;&#xFF0C;&#x5F88;&#x591A;&#x6CA1;&#x6709;&#x505A;&#x8FC7;&#x4F01;&#x4E1A;&#x7EA7;&#x652F;&#x4ED8;&#x5F00;&#x53D1;&#x529F;&#x80FD;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x57FA;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x89E3;&#x51B3;&#x652F;&#x4ED8;&#x56DE;&#x8C03;&#x3001;&#x652F;&#x4ED8;&#x9884;&#x652F;&#x4ED8;&#x3001;&#x652F;&#x4ED8;&#x53D6;&#x6D88;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x540C;&#x4E8B;&#x5F88;&#x591A;IT&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x7684;&#x8001;&#x5E08;&#x5728;&#x8BB2;&#x8BFE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x592A;&#x5173;&#x6CE8;&#x771F;&#x5B9E;&#x7684;&#x4F01;&#x4E1A;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x7EC6;&#x8282;&#x95EE;&#x9898;</p>
<p>&#x56FE;&#x7247;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/f58098b3060d3941f6cb222197a4e88351d928b2aec7c1a59031c273cb46d3fd" alt></p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x89C9;&#x7684;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x4E8E;&#xFF0C;&#x5F88;&#x591A;&#x9762;&#x8BD5;&#x8005;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x65E0;&#x6CD5;&#x7533;&#x8BF7;&#x4E2A;&#x4EBA;&#x7684;&#x652F;&#x4ED8;&#x5E73;&#x53F0;&#x5546;&#x6237;&#xFF0C;&#x5BFC;&#x81F4;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x53BB;&#x4E3B;&#x52A8;&#x6027;&#x7684;&#x5B66;&#x4E60;&#x652F;&#x4ED8;&#x4E1A;&#x52A1;&#x548C;&#x529F;&#x80FD;&#xFF0C;&#x5176;&#x5B9E;&#x56FD;&#x5185;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x652F;&#x6301;&#x4E2A;&#x4EBA;&#x7B7E;&#x7EA6;&#x7684;&#x652F;&#x4ED8;&#x5E73;&#x53F0;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x84DD;&#x5154;&#x652F;&#x4ED8;&#xFF0C;&#x4E91;&#x72D7;&#x652F;&#x4ED8;&#x3002;&#x4E4B;&#x524D;&#x5206;&#x4EAB;&#x8FC7;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;</p>
<p><a href="https://dev.newban.cn/7312273015873732649">&#x4E2A;&#x4EBA;&#x8D26;&#x53F7;&#x5982;&#x4F55;&#x7528;&#x5FAE;&#x4FE1;&#x652F;&#x4ED8;&#x5F00;&#x53D1;&#xFF0C;&#x8BD5;&#x8BD5;&#x84DD;&#x5154;&#x652F;&#x4ED8;&#x5427;</a></p>
<p>&#x4E4B;&#x524D;&#x8FD8;&#x5C01;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x84DD;&#x5154;&#x652F;&#x4ED8;&#x7684;SDK&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF1A;</p>
<p><strong><a href="/external_links/cead7b996ccd9096e17d9be6e00bd1e3.html" target="blank" rel="noopener">github.com/wuchubuzai2&#x2026;</a></strong></p>
<p><strong>6&#x3001;&#x95EE;&#x9898;6&#xFF1A;&#x95EE;&#x4ED6;&#x5FAE;&#x670D;&#x52A1;&#x6CE8;&#x518C;nacos&#x4E0B;&#xFF0C;A&#x5982;&#x4F55;&#x8C03;&#x7528;&#x7684;B&#x670D;&#x52A1;&#x548C;C&#x670D;&#x52A1;</strong></p>
<p>&#x6B64;&#x65F6;&#x4ED6;&#x771F;&#x7684;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;A&#x670D;&#x52A1;&#x5982;&#x679C;&#x8C03;&#x7528;B&#x670D;&#x52A1;&#x548C;C&#x670D;&#x52A1;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F51;&#x5173;&#x6765;&#x8C03;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5728;&#x4F1A;&#x8BAE;&#x4E2D;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x773C;&#x955C;&#x53C8;&#x5B58;&#x5728;&#x767D;&#x8272;&#x7684;&#x95EA;&#x5149;&#xFF0C;&#x53CD;&#x5C04;&#x7684;&#x95EA;&#x5149;&#x4E2D;&#x5B58;&#x5728;&#x4E86;&#x660E;&#x663E;&#x7684;&#x4E0B;&#x62C9;&#x6846;&#x7684;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#xFF0C;&#x6211;&#x5728;&#x4ED4;&#x7EC6;&#x4E00;&#x770B;&#x8FD9;&#x4F4D;&#x5144;&#x5F1F;&#x7ADF;&#x7136;&#x8FB9;&#x8BF4;&#x8FB9;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#xFF0C;&#x7136;&#x540E;&#x54E5;&#x4EEC;&#x6700;&#x7EC8;&#x4E5F;&#x7B54;&#x51FA;&#x6765;OpenFeign&#x4E86;&#xFF0C;&#x77AC;&#x95F4;&#x56DE;&#x60F3;&#x8D77;&#x76F8;&#x5173;&#x7684;&#x8BDD;&#x672F;&#x56DE;&#x590D;&#x4E86;&#xFF0C;&#x9762;&#x8BD5;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x8FD9;&#x4F4D;&#x5144;&#x5F1F;&#x5230;&#x4E86;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;<strong>&#x6211;&#x4E00;&#x76F4;&#x80FD;&#x901A;&#x8FC7;&#x8FDC;&#x7A0B;&#x89C6;&#x9891;&#x4F1A;&#x8BAE;&#x770B;&#x5230;&#x4ED6;&#x7684;&#x773C;&#x955C;&#x53CD;&#x5149;&#x51FA;&#x6765;&#x7684;&#x81EA;&#x5DF1;&#x5C4F;&#x5E55;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x6B8A;&#x4E0D;&#x77E5;&#x65E9;&#x5DF2;&#x5728;&#x6211;&#x7684;&#x638C;&#x63A7;&#x4E4B;&#x4E0B;&#xFF0C;&#x88AB;&#x6211;&#x53D1;&#x73B0;&#x4E86;</strong>&#x3002;</p>
<p>&#x5728;&#x9762;&#x8BD5;&#x524D;&#xFF0C;&#x6211;&#x5C31;&#x975E;&#x5E38;&#x786E;&#x4FE1;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x9762;&#x9762;&#x770B;&#x5427;&#xFF0C;&#x679C;&#x7136;&#x4E0D;&#x592A;&#x5408;&#x9002;&#x3002;&#x4ED6;&#x7684;&#x8FD9;&#x4E2A;&#x7B80;&#x5386;&#x7684;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF1A;</p>
<p><strong>1&#x3001;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x548C;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x7684;&#x6280;&#x672F;&#x6808;&#x8FC7;&#x4E8E;&#x65B0;&#x3001;&#x8C6A;&#x534E;&#xFF0C;&#x5B58;&#x5728;&#x5305;&#x88C5;&#x98CE;&#x9669;</strong></p>
<p><strong>2&#x3001;&#x9879;&#x76EE;&#x4F7F;&#x7528;&#x4E86;&#x67D0;IT&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x4E2D;&#x7684;&#x51FA;&#x73B0;&#x7684;&#x81EA;&#x7814;&#x6846;&#x67B6;elegent&#xFF0C;&#x4E2A;&#x4EBA;&#x6000;&#x7591;&#x4ED6;&#x662F;&#x641E;&#x7684;&#x90A3;&#x4E2A;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x7684;&#x9879;&#x76EE;&#x5305;&#x88C5;&#x7684;&#xFF08;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x81EA;&#x7814;&#x6846;&#x67B6;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x63A2;&#x7A76;&#x4E00;&#x756A;&#x7684;&#xFF0C;&#x5730;&#x5740;&#x5982;&#x4E0B;&#xFF1A;<a href="/external_links/de52ba5db23677688a0531864c57f3c7.html" target="blank" rel="noopener">gitee.com/myelegent/p&#x2026;</a></strong></p>
<p><strong>3&#x3001;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x7B80;&#x5386;&#x4E2D;&#xFF0C;&#x63CF;&#x8FF0;&#x804C;&#x8D23;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6CA1;&#x6709;&#x7528;STAR&#x6CD5;&#x5219;&#x6216;SMART&#x539F;&#x5219;&#x6765;&#x91CF;&#x5316;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x800C;&#x5168;&#x662F;&#x6280;&#x672F;&#x7C7B;&#x7684;&#x4F7F;&#x7528;XXX&#x6280;&#x672F;&#x5B9E;&#x73B0;AAA&#x8FD9;&#x79CD;&#x3002;</strong></p>
<h2 id="&#x56DB;&#x3001;&#x7B80;&#x5386;&#x5171;&#x6027;&#x95EE;&#x9898;"><a href="#&#x56DB;&#x3001;&#x7B80;&#x5386;&#x5171;&#x6027;&#x95EE;&#x9898;" class="headerlink" title="&#x56DB;&#x3001;&#x7B80;&#x5386;&#x5171;&#x6027;&#x95EE;&#x9898;"></a><strong>&#x56DB;&#x3001;&#x7B80;&#x5386;&#x5171;&#x6027;&#x95EE;&#x9898;</strong></h2><p>&#x6700;&#x8FD1;&#x9762;&#x8BD5;&#x522B;&#x4EBA;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x7684;&#x7B80;&#x5386;&#x5171;&#x6027;&#x95EE;&#x9898;&#x5982;&#x4E0B;&#xFF1A;</p>
<p> 1&#x3001;&#x5305;&#x88C5;&#x7684;&#x9762;&#x8BD5;&#x8005;&#x6216;&#x8005;&#x4F4E;&#x7ECF;&#x9A8C;&#x7684;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x786E;&#x5B9E;&#x5BF9;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x9879;&#x76EE;&#x4E1A;&#x52A1;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x6216;&#x8005;&#x7F3A;&#x5C11;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x9762;&#x8BD5;&#x95EE;&#x95EE;&#x4EC0;&#x4E48;&#x9009;&#x8FD9;&#x4E2A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;&#x8FD9;&#x4E2A;&#xFF0C;&#x7ECF;&#x5E38;&#x56DE;&#x7B54;&#x662F;leader&#x641E;&#x7684;&#xFF0C;Leader&#x9009;&#x62E9;&#x7684;&#xFF0C;&#x540C;&#x4E8B;&#x505A;&#x7684;&#xFF0C;&#x7B80;&#x5386;&#x4E0A;&#x7528;&#x7EAF;&#x6280;&#x672F;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x804C;&#x8D23;&#xFF0C;&#x5373;&#xFF1A;&#x4F7F;&#x7528;XXX&#x6280;&#x672F;&#x5B9E;&#x73B0;aaa&#xFF0C;&#x56DE;&#x7B54;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x786E;&#x5B9E;&#x8FC7;&#x5C11;&#x7ED3;&#x5408;&#x4E1A;&#x52A1;&#x6765;&#x63CF;&#x8FF0;</p>
<p> 2&#x3001;&#x5E38;&#x5E74;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x662F;CRUD&#x7C7B;&#x578B;&#x7684;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x6709;&#x4E9B;&#x5728;&#x9879;&#x76EE;&#x804C;&#x8D23;&#x4E2D;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x8868;&#x8FBE;&#x4EFB;&#x4F55;&#x6280;&#x672F;&#x540D;&#x79F0;&#x548C;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#xFF0C;&#x4E00;&#x80A1;&#x8111;&#x7684;&#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x4ECB;&#x7ECD;&#x7684;&#x529F;&#x80FD;&#x548C;&#x6A21;&#x5757;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x4E00;&#x95EE;&#xFF0C;&#x95EE;&#x9898;&#x66F4;&#x5927;&#x3002;</p>
<p>3&#x3001;&#x7B80;&#x5386;&#x4E0A;&#x7684;&#x6392;&#x7248;&#x660E;&#x663E;&#x6709;&#x95EE;&#x9898;&#x7684;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x672C;&#x5468;&#x516C;&#x53F8;&#x6536;&#x5230;&#x7684;&#x51E0;&#x4EFD;&#x7B80;&#x5386;&#x4E2D;&#x6709;2-4&#x5206;&#x90FD;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x7684;&#x9519;&#x522B;&#x5B57;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x6BD4;&#x5982;mongodb&#x5199;&#x6210;manogdb\mangdb&#x7684;&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x4E5F;&#x770B;&#x7740;&#x4E0D;&#x8212;&#x670D;&#x7684;&#x7B49;&#x7B49;&#xFF0C;&#x7B80;&#x5386;&#x4E0A;&#x80FD;&#x660E;&#x663E;&#x770B;&#x51FA;&#x6765;&#x4E4B;&#x524D;&#x505A;&#x7684;&#x4E1A;&#x52A1;&#x90FD;&#x662F;&#x8FB9;&#x7F18;&#x529F;&#x80FD;&#x7684;&#xFF0C;&#x8001;&#x65E7;&#x7684;&#x6280;&#x672F;&#x4F9D;&#x7136;&#x5199;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5305;&#x88C5;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7B80;&#x5386;&#x786E;&#x5B9E;&#x4E0D;&#x60F3;&#x7ED9;&#x9762;&#x8BD5;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x4E3A;&#x548C;&#x522B;&#x4EBA;&#x7684;&#x5BF9;&#x6BD4;&#x4E00;&#x76EE;&#x4E86;&#x7136; </p>
<p>4&#x3001;&#x6211;&#x89C9;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x5371;&#x9669;&#xFF0C;&#x5C31;&#x662F;1&#x3001;2&#x3001;3&#x3001;4&#x8FD9;&#x4E2A;&#x5E74;&#x9650;&#x7ECF;&#x9A8C;&#x6BB5;&#x7684;&#xFF0C;&#x611F;&#x89C9;&#x6709;&#x4E9B;&#x4EBA;&#x7684;&#x6C34;&#x5E73;&#x5C31;&#x662F;&#x5F88;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5E74;&#x9650;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x7B80;&#x5386;&#x4E5F;&#x5F88;&#x5927;&#x5DEE;&#x4E0D;&#x5DEE;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x73B0;&#x5728;&#x7684;IT&#x754C;&#x7684;&#x5DE5;&#x4F5C;&#x57CE;&#x5E02;&#x3001;&#x516C;&#x53F8;&#x73AF;&#x5883;&#x3001;&#x4E2A;&#x4EBA;&#x8BA4;&#x77E5;&#x4E0D;&#x9F50;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;2-3&#x5E74;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x5305;&#x88C5;&#x7740;&#xFF0C;&#x8BA9;2-3&#x5E74;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x6BB5;&#x7684;&#x4E0D;&#x5BB9;&#x6613;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x9762;&#x8BD5;&#x516C;&#x53F8;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x7B5B;&#x9009;&#x51FA;&#x597D;&#x7B80;&#x5386;&#x3002;AI&#x51FA;&#x73B0;&#x4E00;&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7B80;&#x5386;&#x975E;&#x5E38;&#x660E;&#x663E;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;AI&#x6DA6;&#x8272;&#x7684;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x591A;&#x4EBA;&#x786E;&#x5B9E;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x7528;AI&#x5462;&#x3002;</p>
<p>&#x540E;&#x6765;&#x9762;&#x8BD5;&#x522B;&#x4EBA;&#x53C8;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E2A;&#x5C0F;&#x4F19;&#x5B50;&#x771F;&#x80C6;&#x5927;&#xFF0C;&#x5F53;&#x7740;&#x8FDC;&#x7A0B;&#x4F1A;&#x8BAE;&#x7684;&#x9762;&#xFF0C;&#x73B0;&#x573A;&#x9F20;&#x6807;&#x5355;&#x51FB;&#x548C;&#x952E;&#x76D8;&#x6572;&#x51FB;&#x660E;&#x663E;&#x7684;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x7684;&#xFF0C;&#x6B8A;&#x4E0D;&#x77E5;&#x4ED6;&#x7684;&#x9F20;&#x6807;&#x58F0;&#x97F3;&#x6211;&#x8FD9;&#x91CC;&#x4E5F;&#x80FD;&#x542C;&#x5230;&#xFF0C;&#x8FD8;&#x8FB9;&#x5403;&#x4E1C;&#x897F;&#x8FB9;&#x9762;&#x8BD5;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;AI&#x5EFA;&#x8BAE;&#x7684;&#x7B80;&#x5386;&#x5185;&#x5BB9;"><a href="#&#x4E94;&#x3001;AI&#x5EFA;&#x8BAE;&#x7684;&#x7B80;&#x5386;&#x5185;&#x5BB9;" class="headerlink" title="&#x4E94;&#x3001;AI&#x5EFA;&#x8BAE;&#x7684;&#x7B80;&#x5386;&#x5185;&#x5BB9;"></a>&#x4E94;&#x3001;AI&#x5EFA;&#x8BAE;&#x7684;&#x7B80;&#x5386;&#x5185;&#x5BB9;</h2><p>&#x73B0;&#x5728;AI&#x5927;&#x706B;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x5199;&#x7B80;&#x5386;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x7ECF;&#x9A8C;&#xFF0C;&#x5199;&#x7684;&#x6C34;&#x5E73;&#x8FD8;&#x662F;&#x4EE5;&#x524D;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6CA1;&#x6709;&#x7528;&#x5FC3;&#x8BA4;&#x771F;&#x6253;&#x78E8;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x65E2;&#x7136;&#x5982;&#x6B64;&#x90A3;&#x4E48;&#x4F01;&#x4E1A;&#x770B;&#x5230;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x540E;&#xFF0C;&#x4E3A;&#x5565;&#x8981;&#x4E3A;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x7ECF;&#x9A8C;&#x4E70;&#x5355;&#x5462;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7B80;&#x5386;&#x4E2D;&#x7684;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x804C;&#x8D23;&#x5E94;&#x8BE5;&#x7740;&#x91CD;&#x63CF;&#x8FF0;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x70B9;&#x8FD8;&#x662F;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x63CF;&#x8FF0;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x6700;&#x8FD1;&#x4E5F;&#x95EE;&#x4E86;&#x4E0B;AI&#xFF0C;&#x611F;&#x89C9;&#x633A;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x53C2;&#x8003;&#x5982;&#x4E0B;&#xFF1A; </p>
<p><strong>&#x5E73;&#x8861;&#x6280;&#x672F;&#x4E0E;&#x4E1A;&#x52A1;&#x63CF;&#x8FF0;</strong>&#xFF1A;&#x7B80;&#x5386;&#x4E2D;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x804C;&#x8D23;&#x65F6;&#x5E94;&#x8BE5;&#x65E2;&#x5173;&#x6CE8;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x70B9;&#xFF0C;&#x4E5F;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x63CF;&#x8FF0;&#x3002;&#x901A;&#x8FC7;&#x5E73;&#x8861;&#x6280;&#x672F;&#x548C;&#x4E1A;&#x52A1;&#x63CF;&#x8FF0;&#x3001;&#x7A81;&#x51FA;&#x6280;&#x672F;&#x4EAE;&#x70B9;&#x3001;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x3001;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x5730;&#x8868;&#x8FBE;&#x4EE5;&#x53CA;&#x91CF;&#x5316;&#x6210;&#x679C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5C55;&#x793A;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4EF7;&#x503C;&#xFF0C;&#x589E;&#x52A0;&#x9762;&#x8BD5;&#x6210;&#x529F;&#x7684;&#x51E0;&#x7387;&#x3002; &#x7B80;&#x5386;&#x5E94;&#x8BE5;&#x65E2;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x5C55;&#x793A;&#x4F60;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x7406;&#x89E3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x9879;&#x76EE;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x51FA;&#x53D1;&#xFF0C;&#x63CF;&#x8FF0;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#xFF0C;&#x4F60;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x65B9;&#x6848;&#x548C;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;&#x8FD9;&#x6837;&#x65E2;&#x80FD;&#x4F53;&#x73B0;&#x4F60;&#x7684;&#x6280;&#x672F;&#x5B9E;&#x529B;&#xFF0C;&#x4E5F;&#x80FD;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x4E86;&#x89E3;&#x4F60;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x654F;&#x611F;&#x5EA6;&#x3002; </p>
<p><strong>&#x7A81;&#x51FA;&#x6280;&#x672F;&#x4EAE;&#x70B9;</strong>&#xFF1A;&#x5728;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x804C;&#x8D23;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x7740;&#x91CD;&#x7A81;&#x51FA;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x6280;&#x672F;&#x96BE;&#x9898;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x7684;&#x521B;&#x65B0;&#x70B9;&#x3002;&#x8FD9;&#x4E9B;&#x4EAE;&#x70B9;&#x80FD;&#x591F;&#x4F53;&#x73B0;&#x4F60;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x975E;&#x5E38;&#x5173;&#x6CE8;&#x7684;&#x90E8;&#x5206;&#x3002; </p>
<p><strong>&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;</strong>&#xFF1A;&#x9664;&#x4E86;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x70B9;&#xFF0C;&#x4E5F;&#x8981;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x5E26;&#x6765;&#x7684;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x548C;&#x4EF7;&#x503C;&#xFF0C;&#x4E5F;&#x80FD;&#x5C55;&#x793A;&#x4F60;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x548C;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002; </p>
<p><strong>&#x7B80;&#x6D01;&#x660E;&#x4E86;</strong>&#xFF1A;&#x5728;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x804C;&#x8D23;&#x65F6;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x8A00;&#x7B80;&#x610F;&#x8D45;&#xFF0C;&#x907F;&#x514D;&#x5197;&#x957F;&#x7684;&#x53E5;&#x5B50;&#x548C;&#x590D;&#x6742;&#x7684;&#x8BCD;&#x6C47;&#x3002;&#x7528;&#x7B80;&#x6D01;&#x7684;&#x8BED;&#x8A00;&#x6E05;&#x6670;&#x5730;&#x8868;&#x8FBE;&#x4F60;&#x7684;&#x804C;&#x8D23;&#x548C;&#x6210;&#x679C;&#xFF0C;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x4F60;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4EF7;&#x503C;&#x3002; </p>
<p><strong>&#x91CF;&#x5316;&#x6210;&#x679C;</strong>&#xFF1A;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x5C3D;&#x91CF;&#x7528;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#x6216;&#x6210;&#x679C;&#x6765;&#x91CF;&#x5316;&#x4F60;&#x7684;&#x8D21;&#x732E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x9879;&#x76EE;&#x4E0A;&#x7EBF;&#x540E;&#x5E26;&#x6765;&#x7684;&#x7528;&#x6237;&#x589E;&#x957F;&#x3001;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x6216;&#x6210;&#x672C;&#x964D;&#x4F4E;&#x7B49;&#x5177;&#x4F53;&#x6210;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x66F4;&#x5177;&#x8BF4;&#x670D;&#x529B;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x672C;&#x6587;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x8BA9;&#x9762;&#x8BD5;&#x8005;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x7F16;&#x5199;&#x5185;&#x5BB9;&#xFF0C;&#x9762;&#x8BD5;&#x65F6;&#x907F;&#x514D;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4EE5;&#x53CA;&#x9762;&#x8BD5;&#x5B98;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x4E00;&#x5B9A;&#x7684;&#x7B80;&#x5386;&#x7B5B;&#x9009;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x559C;&#x6B22;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x3001;&#x6536;&#x85CF;&#x3001;&#x5206;&#x4EAB;&#x3001;&#x8BC4;&#x8BBA;&#x54E6;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/35d19951a5c7234ddbb79a7c705b2361.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/后端-面试-Java/" rel="tag"># 后端,面试,Java</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7356154581208072226.html" rel="next" title="看不懂来打我，vue3如何将template编译成rende">
                <i class="fa fa-chevron-left"></i> 看不懂来打我，vue3如何将template编译成rende
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7356233295850586146.html" rel="prev" title="iOS 隐私协议清单整理">
                iOS 隐私协议清单整理 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#一、背景"><span class="nav-number">1.</span> <span class="nav-text">一、背景</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#二、简历筛选"><span class="nav-number">2.</span> <span class="nav-text">二、简历筛选</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#三、面试问题"><span class="nav-number">3.</span> <span class="nav-text">三、面试问题</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#四、简历共性问题"><span class="nav-number">4.</span> <span class="nav-text">四、简历共性问题</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#五、AI建议的简历内容"><span class="nav-number">5.</span> <span class="nav-text">五、AI建议的简历内容</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
