<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="架构,设计,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x901A;&amp;#x8FC7;&amp;#x524D;&amp;#x9762;&amp;#x7684;&amp;#x4ECB;&amp;#x7ECD;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5BF9;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x5386;&amp;#x53F2;&amp;#x8109;&amp;#x7EDC;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#x57FA;&amp;#x672C;&amp;#x7684;">
<meta name="keywords" content="架构,设计">
<meta property="og:type" content="article">
<meta property="og:title" content="介绍了那么多，技术中架构到底什么？">
<meta property="og:url" content="https://dev.newban.cn/7360990621853138970.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x901A;&amp;#x8FC7;&amp;#x524D;&amp;#x9762;&amp;#x7684;&amp;#x4ECB;&amp;#x7ECD;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5BF9;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x5386;&amp;#x53F2;&amp;#x8109;&amp;#x7EDC;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#x57FA;&amp;#x672C;&amp;#x7684;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/e36e92745fe689196e50a13d861565ecc7308875cfd91d1b73a05f6e6fb33fd4">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/2c45d690ca60b3b47e73fd2314c718199a4020b3b075386a753dcf2ca893137f">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/43a633d08b2f064c4e9623547c402010a5f9db7327af6cad5aabf0e75bc8199e">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/d157bf19a1e1f5654645d363189b3fca455f01ad81af795206020909ce24057c">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/ae968069fefbf041b27399d927c5e53c8644f3ca1475819b1cb31330639acab9">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/60cdb2ca43fa26e9e93d5834c6706205d85c6272d234731b1cae28f66c5ab003">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/b0723695aa2dbcf8e267f3bac2073372d7ca9cb6834253a207d955bf6d50bb1a">
<meta property="og:updated_time" content="2024-04-24T04:36:48.756Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="介绍了那么多，技术中架构到底什么？">
<meta name="twitter:description" content="&amp;#x901A;&amp;#x8FC7;&amp;#x524D;&amp;#x9762;&amp;#x7684;&amp;#x4ECB;&amp;#x7ECD;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5BF9;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x5386;&amp;#x53F2;&amp;#x8109;&amp;#x7EDC;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#x57FA;&amp;#x672C;&amp;#x7684;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/e36e92745fe689196e50a13d861565ecc7308875cfd91d1b73a05f6e6fb33fd4">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7360990621853138970.html">





  <title>介绍了那么多，技术中架构到底什么？ | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">介绍了那么多，技术中架构到底什么？</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-04-24T10:33:37+08:00">
                2024-04-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x67B6;&#x6784;&#x7684;&#x5386;&#x53F2;&#x8109;&#x7EDC;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF1A;&#x8FD9;&#x4E2A;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x5404;&#x79CD;&#x6280;&#x672F;&#x8BA8;&#x8BBA;&#x4E2D;&#x7684;&#x201C;&#x67B6;&#x6784;&#x201D;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x201C;&#x67B6;&#x6784;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x505C;&#x4E0B;&#x6765;&#x601D;&#x8003;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x5185;&#x6DB5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x5728;&#x6280;&#x672F;&#x754C;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;&#x201C;&#x67B6;&#x6784;&#x201D;&#x51E0;&#x4E4E;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x65F6;&#x9AE6;&#x7684;&#x8BCD;&#x6C47;&#xFF0C;&#x4EBA;&#x4EBA;&#x90FD;&#x5728;&#x8C08;&#x8BBA;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x7CBE;&#x9AD3;&#x7684;&#x4EBA;&#x5374;&#x4E0D;&#x591A;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5462;&#xFF1F;&#x5B83;&#x53C8;&#x4E3A;&#x4EC0;&#x4E48;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF1F;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x63A2;&#x7D22;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6F84;&#x6E05;&#x4E00;&#x4E0B;&#x201C;&#x67B6;&#x6784;&#x201D;&#x7684;&#x57FA;&#x672C;&#x542B;&#x4E49;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x8C08;&#x8D77;&#xFF0C;&#x63A2;&#x7D22;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;&#x5B83;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x548C;&#x4EF7;&#x503C;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x67B6;&#x6784;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x80FD;&#x591F;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x9AD8;&#x6548;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5982;&#x6B64;&#x5173;&#x952E;&#x3002;</p>
<h3 id="1&#x3001;&#x67B6;&#x6784;&#x7684;&#x8BDE;&#x751F;"><a href="#1&#x3001;&#x67B6;&#x6784;&#x7684;&#x8BDE;&#x751F;" class="headerlink" title="1&#x3001;&#x67B6;&#x6784;&#x7684;&#x8BDE;&#x751F;"></a>1&#x3001;&#x67B6;&#x6784;&#x7684;&#x8BDE;&#x751F;</h3><p>&#x5728;&#x63A2;&#x8BA8;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x4F17;&#x591A;&#x65B0;&#x65B9;&#x6CD5;&#x548C;&#x7406;&#x5FF5;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x663E;&#x5F97;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3002;&#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x4ED6;&#x4E3A;&#x5E94;&#x5BF9;&#x65B0;&#x5174;&#x8F6F;&#x4EF6;&#x5371;&#x673A;&#x800C;&#x8BDE;&#x751F;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x51FA;&#x73B0;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x6E90;&#x4E8E;&#x884C;&#x4E1A;&#x5171;&#x9762;&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x4F55;&#x7384;&#x673A;&#x5462;&#xFF1F;</p>
<p>&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x7684;&#x65E5;&#x76CA;&#x5E9E;&#x5927;&#xFF0C;&#x4E00;&#x9879;&#x660E;&#x663E;&#x7684;&#x53D8;&#x5316;&#x662F;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x8BA1;&#x7B97;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5DF2;&#x4E0D;&#x518D;&#x662F;&#x8BBE;&#x8BA1;&#x6311;&#x6218;&#x7684;&#x4E3B;&#x8981;&#x7126;&#x70B9;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7531;&#x4F17;&#x591A;&#x90E8;&#x4EF6;&#x6784;&#x6210;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5982;&#x4F55;&#x9AD8;&#x6548;&#x5730;&#x7EC4;&#x7EC7;&#x8FD9;&#x4E9B;&#x90E8;&#x4EF6;&#x2014;&#x2014;&#x5373;&#x6211;&#x4EEC;&#x6240;&#x79F0;&#x7684;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201D;&#x2014;&#x2014;&#x6210;&#x4E3A;&#x4E86;&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x65B0;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x5982;&#x4E0B;&#x6311;&#x6218;&#xFF1A;</p>
<ul>
<li>&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x5E9E;&#x5927;&#x81F3;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#xFF0C;&#x5185;&#x90E8;&#x8026;&#x5408;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x4E25;&#x91CD;&#x62D6;&#x6162;&#x4E86;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x90E8;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#xFF0C;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x4EFB;&#x4F55;&#x5FAE;&#x5C0F;&#x4FEE;&#x6539;&#x90FD;&#x53EF;&#x80FD;&#x5F15;&#x53D1;&#x8FDE;&#x9501;&#x53CD;&#x5E94;&#xFF0C;&#x4F7F;&#x5F97;&#x540E;&#x7EED;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x6269;&#x5C55;&#x5DE5;&#x4F5C;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x56F0;&#x96BE;&#xFF1B;</li>
<li>&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x903B;&#x8F91;&#x4F7F;&#x5F97;&#x95EE;&#x9898;&#x9891;&#x53D1;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5B9A;&#x4F4D;&#x548C;&#x4FEE;&#x590D;&#x7684;&#x96BE;&#x5EA6;&#x6781;&#x5927;&#x3002;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x6837;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x5176;&#x5386;&#x53F2;&#x5730;&#x4F4D;&#x548C;&#x5FC5;&#x7136;&#x6027;&#x4E0D;&#x8A00;&#x800C;&#x55BB;&#x3002;&#x56DE;&#x671B;&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8F6F;&#x4EF6;&#x5371;&#x673A;&#x63A8;&#x52A8;&#x4E86;&#x201C;&#x7ED3;&#x6784;&#x5316;&#x7F16;&#x7A0B;&#x201D;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x201C;&#x6A21;&#x5757;&#x201D;&#x7684;&#x6982;&#x5FF5;&#xFF1B;&#x968F;&#x540E;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8F6F;&#x4EF6;&#x5371;&#x673A;&#x4FC3;&#x4F7F;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x201D;&#x7684;&#x666E;&#x53CA;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x6982;&#x5FF5;&#x3002;&#x800C;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201D;&#x7684;&#x63D0;&#x51FA;&#xFF0C;&#x5219;&#x6807;&#x5FD7;&#x7740;&#x201C;&#x7EC4;&#x4EF6;&#x201D;&#x6982;&#x5FF5;&#x7684;&#x8BDE;&#x751F;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x53D1;&#x5C55;&#x5386;&#x7A0B;&#x63ED;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF1A;<code>&#x65E0;&#x8BBA;&#x662F;&#x201C;&#x6A21;&#x5757;&#x201D;&#x3001;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x8FD8;&#x662F;&#x201C;&#x7EC4;&#x4EF6;&#x201D;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x90FD;&#x5728;&#x4E8E;&#x5BF9;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x89C4;&#x6A21;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x62C6;&#x5206;&#x548C;&#x9AD8;&#x5C42;&#x6B21;&#x7EC4;&#x7EC7;&#x3002;</code>&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x65AD;&#x6500;&#x5347;&#xFF0C;&#x8FD9;&#x79CD;&#x62C6;&#x5206;&#x7684;&#x7C92;&#x5EA6;&#x548C;&#x5C42;&#x6B21;&#x4E5F;&#x968F;&#x4E4B;&#x63D0;&#x9AD8;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x597D;&#x5730;&#x5E94;&#x5BF9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5404;&#x79CD;&#x6311;&#x6218;&#xFF0C;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</p>
<h3 id="2&#x3001;&#x67B6;&#x6784;&#x6307;&#x4EC0;&#x4E48;"><a href="#2&#x3001;&#x67B6;&#x6784;&#x6307;&#x4EC0;&#x4E48;" class="headerlink" title="2&#x3001;&#x67B6;&#x6784;&#x6307;&#x4EC0;&#x4E48;"></a>2&#x3001;&#x67B6;&#x6784;&#x6307;&#x4EC0;&#x4E48;</h3><p>&#x5728;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x201C;&#x67B6;&#x6784;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x51E0;&#x4E4E;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x5B83;&#x5C31;&#x50CF;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8001;&#x670B;&#x53CB;&#xFF0C;&#x7ECF;&#x5E38;&#x6302;&#x5728;&#x5634;&#x8FB9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x771F;&#x6B63;&#x505C;&#x4E0B;&#x811A;&#x6B65;&#xFF0C;&#x8BD5;&#x56FE;&#x53BB;&#x63A2;&#x7A76;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x67B6;&#x6784;&#x201D;&#x7A76;&#x7ADF;&#x6307;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60CA;&#x8BB6;&#x5730;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x4E2D;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x968F;&#x4FBF;&#x95EE;1000&#x4E2A;&#x6280;&#x672F;&#x4EBA;&#x5458;&#xFF0C;&#x201C;&#x67B6;&#x6784;&#x201D;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;1001&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7B54;&#x6848;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x754C;&#x7684;&#x8C1C;&#x9898;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5FC3;&#x4E2D;&#x7684;&#x7B54;&#x6848;&#x90FD;&#x6709;&#x5FAE;&#x5999;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F17;&#x8BF4;&#x7EB7;&#x7EAD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x627E;&#x5230;&#x5BF9;&#x201C;&#x67B6;&#x6784;&#x201D;&#x7684;&#x51C6;&#x786E;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5148;&#x4ECE;&#x7406;&#x89E3;&#x4E0E;&#x201C;&#x67B6;&#x6784;&#x201D;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#x4E14;&#x76F8;&#x4F3C;&#x7684;&#x51E0;&#x5BF9;&#x6982;&#x5FF5;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x805A;&#x7126;&#x4E8E;&#x4E09;&#x5BF9;&#x57FA;&#x672C;&#x4F46;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#xFF1A;<strong>&#x7CFB;&#x7EDF;&#x4E0E;&#x5B50;&#x7CFB;&#x7EDF;&#x3001;&#x6A21;&#x5757;&#x4E0E;&#x7EC4;&#x4EF6;&#x3001;&#x4EE5;&#x53CA;&#x6846;&#x67B6;&#x4E0E;&#x67B6;&#x6784;</strong>&#x3002;</p>
<h4 id="2-1&#x3001;&#x7CFB;&#x7EDF;&#x4E0E;&#x5B50;&#x7CFB;&#x7EDF;"><a href="#2-1&#x3001;&#x7CFB;&#x7EDF;&#x4E0E;&#x5B50;&#x7CFB;&#x7EDF;" class="headerlink" title="2.1&#x3001;&#x7CFB;&#x7EDF;&#x4E0E;&#x5B50;&#x7CFB;&#x7EDF;"></a>2.1&#x3001;&#x7CFB;&#x7EDF;&#x4E0E;&#x5B50;&#x7CFB;&#x7EDF;</h4><p>&#x5F53;&#x6211;&#x4EEC;&#x804A;&#x5230;&#x201C;&#x7CFB;&#x7EDF;&#x201D;&#xFF0C;&#x53EF;&#x80FD;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x662F;&#x5404;&#x79CD;&#x590D;&#x6742;&#x7684;&#x6280;&#x672F;&#x6216;&#x673A;&#x68B0;&#x8BBE;&#x5907;&#x3002;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5BBD;&#x6CDB;&#x4F46;&#x7CBE;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;</p>
<blockquote>
<p>&#x7CFB;&#x7EDF;&#x6CDB;&#x6307;&#x7531;&#x4E00;&#x7FA4;&#x6709;&#x5173;&#x8054;&#x7684;&#x4E2A;&#x4F53;&#x7EC4;&#x6210;&#xFF0C;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x89C4;&#x5219;&#x8FD0;&#x4F5C;&#xFF0C;&#x80FD;&#x5B8C;&#x6210;&#x4E2A;&#x522B;&#x5143;&#x4EF6;&#x4E0D;&#x80FD;&#x5355;&#x72EC;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x7684;&#x7FA4;&#x4F53;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x5316;&#x4E00;&#x4E0B;&#x4E0A;&#x9762;&#x7684;&#x9AD8;&#x6DF1;&#x8BBA;&#x8FF0;&#xFF0C;&#x6293;&#x4F4F;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x70B9;&#xFF1A;</p>
<ul>
<li><strong>&#x5173;&#x8054;</strong>&#xFF1A;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4EC5;&#x4EC5;&#x628A;&#x4E00;&#x4E2A;&#x53D1;&#x52A8;&#x673A;&#x548C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x6446;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x8BA9;&#x5B83;&#x4EEC;&#x53D8;&#x6210;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x628A;&#x53D1;&#x52A8;&#x673A;&#x3001;&#x5E95;&#x76D8;&#x3001;&#x8F6E;&#x80CE;&#x548C;&#x8F66;&#x67B6;&#x8FD9;&#x4E9B;&#x6709;&#x5173;&#x8054;&#x7684;&#x90E8;&#x5206;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x80FD;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x53F0;&#x6C7D;&#x8F66;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7CFB;&#x7EDF;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x5F97;&#x6709;&#x70B9;&#x5173;&#x7CFB;&#xFF0C;&#x624D;&#x80FD;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x6574;&#x4F53;&#x3002;</li>
<li><strong>&#x89C4;&#x5219;</strong>&#xFF1A;&#x5728;&#x8FD9;&#x4E2A;&#x7EC4;&#x5408;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x4E0D;&#x662F;&#x968F;&#x4FBF;&#x5E72;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x3002;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x6765;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6C7D;&#x8F66;&#x91CC;&#x7684;&#x53D1;&#x52A8;&#x673A;&#x4EA7;&#x751F;&#x52A8;&#x529B;&#xFF0C;&#x901A;&#x8FC7;&#x53D8;&#x901F;&#x5668;&#x548C;&#x4F20;&#x52A8;&#x8F74;&#x8FD9;&#x6837;&#x7684;&#x88C5;&#x7F6E;&#xFF0C;&#x6700;&#x7EC8;&#x628A;&#x52A8;&#x529B;&#x4F20;&#x5230;&#x8F6E;&#x80CE;&#x4E0A;&#xFF0C;&#x8BA9;&#x6C7D;&#x8F66;&#x80FD;&#x591F;&#x524D;&#x8FDB;&#x3002;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x51B3;&#x5B9A;&#x4E86;&#x8C01;&#x8D1F;&#x8D23;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x534F;&#x4F5C;&#x3002;</li>
<li><strong>&#x80FD;&#x529B;</strong>&#xFF1A;&#x5F53;&#x8FD9;&#x4E9B;&#x90E8;&#x4EF6;&#x6309;&#x89C4;&#x5219;&#x5408;&#x4F5C;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x5355;&#x4E2A;&#x90E8;&#x4EF6;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x6C7D;&#x8F66;&#x7684;&#x8F7D;&#x4EBA;&#x8F7D;&#x7269;&#x3002;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x628A;&#x5404;&#x4E2A;&#x90E8;&#x4EF6;&#x7684;&#x80FD;&#x529B;&#x52A0;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x662F;&#x80FD;&#x521B;&#x9020;&#x51FA;&#x65B0;&#x7684;&#x80FD;&#x529B;&#x6765;&#x3002;</li>
</ul>
<p>&#x518D;&#x8BF4;&#x8BF4;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x5B9E;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x7CFB;&#x7EDF;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x3002;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5728;&#x66F4;&#x5927;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF1A;</p>
<blockquote>
<p>&#x5B50;&#x7CFB;&#x7EDF;&#x7531;&#x4E00;&#x7FA4;&#x6709;&#x5173;&#x8054;&#x7684;&#x4E2A;&#x4F53;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x591A;&#x534A;&#x4F1A;&#x662F;&#x66F4;&#x5927;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
</blockquote>
<p>&#x5B50;&#x7CFB;&#x7EDF;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x53EA;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7AD9;&#x5728;&#x54EA;&#x4E2A;&#x89C6;&#x89D2;&#x770B;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5728;&#x66F4;&#x5927;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x5C31;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x6709;&#x70B9;&#x7ED5;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x5FAE;&#x4FE1;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#xFF0C;&#x4E00;&#x5207;&#x5C31;&#x53D8;&#x5F97;&#x6E05;&#x6670;&#x591A;&#x4E86;&#x3002;</p>
<ul>
<li><strong>&#x5FAE;&#x4FE1;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;</strong>&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x628A;&#x5FAE;&#x4FE1;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x751F;&#x6001;&#x5708;&#xFF0C;&#x5B83;&#x81EA;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x751F;&#x6001;&#x5708;&#x91CC;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#x548C;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x804A;&#x5929;&#x3001;&#x767B;&#x5F55;&#x3001;&#x652F;&#x4ED8;&#x3001;&#x670B;&#x53CB;&#x5708;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x5728;&#x5FAE;&#x4FE1;&#x8FD9;&#x4E2A;&#x5927;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x5171;&#x540C;&#x652F;&#x6491;&#x8D77;&#x5FAE;&#x4FE1;&#x8FD9;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x3002;</li>
<li><strong>&#x670B;&#x53CB;&#x5708;&#x7684;&#x7ED3;&#x6784;</strong>&#xFF1A;&#x518D;&#x6DF1;&#x5165;&#x5230;&#x670B;&#x53CB;&#x5708;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5FAE;&#x4FE1;&#x7684;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x591A;&#x4E2A;&#x529F;&#x80FD;&#x7EC4;&#x6210;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x52A8;&#x6001;&#x53D1;&#x5E03;&#x3001;&#x8BC4;&#x8BBA;&#x3001;&#x70B9;&#x8D5E;&#x7B49;&#x529F;&#x80FD;&#xFF0C;&#x5728;&#x670B;&#x53CB;&#x5708;&#x8FD9;&#x4E2A;&#x201C;&#x5C0F;&#x7CFB;&#x7EDF;&#x201D;&#x91CC;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;</li>
<li><strong>&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#x7684;&#x6DF1;&#x5C42;&#x6B21;</strong>&#xFF1A;&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#x867D;&#x7136;&#x662F;&#x670B;&#x53CB;&#x5708;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x81EA;&#x8EAB;&#x4E5F;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x9632;&#x5237;&#x5B50;&#x7CFB;&#x7EDF;&#x3001;&#x5BA1;&#x6838;&#x5B50;&#x7CFB;&#x7EDF;&#x3001;&#x53D1;&#x5E03;&#x5B50;&#x7CFB;&#x7EDF;&#x3001;&#x5B58;&#x50A8;&#x5B50;&#x7CFB;&#x7EDF;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5B50;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x7CBE;&#x5BC6;&#x7684;&#x534F;&#x4F5C;&#xFF0C;&#x5171;&#x540C;&#x786E;&#x4FDD;&#x4E86;&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x548C;&#x6570;&#x636E;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</li>
<li><strong>&#x6280;&#x672F;&#x5C42;&#x9762;&#x7684;&#x7CFB;&#x7EDF;</strong>&#xFF1A;&#x5F53;&#x6211;&#x4EEC;&#x805A;&#x7126;&#x4E8E;&#x8BC4;&#x8BBA;&#x5BA1;&#x6838;&#x8FD9;&#x4E00;&#x73AF;&#x8282;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x518D;&#x88AB;&#x5212;&#x5206;&#x4E3A;&#x66F4;&#x591A;&#x7684;&#x4E1A;&#x52A1;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x662F;&#x8F6C;&#x5411;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x89C6;&#x89D2;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x5404;&#x79CD;&#x6280;&#x672F;&#x6A21;&#x5757;&#x548C;&#x7EC4;&#x4EF6;&#xFF0C;&#x5982;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;MySQL&#x3001;&#x7F13;&#x5B58;&#x7CFB;&#x7EDF;Redis&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x867D;&#x7136;&#x662F;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x6784;&#x6210;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x5728;&#x6574;&#x4E2A;&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#x4E2D;&#x626E;&#x6F14;&#x7740;&#x5173;&#x952E;&#x7684;&#x89D2;&#x8272;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7EC4;&#x4EF6;&#x786E;&#x4FDD;&#x4E86;&#x6570;&#x636E;&#x7684;&#x5FEB;&#x901F;&#x5904;&#x7406;&#x548C;&#x5B89;&#x5168;&#x5B58;&#x50A8;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x4E0D;&#x76F4;&#x63A5;&#x53C2;&#x4E0E;&#x5230;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x4E2D;&#xFF0C;&#x5374;&#x662F;&#x652F;&#x6491;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x90E8;&#x5206;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x4ECE;&#x6574;&#x4F53;&#x5230;&#x90E8;&#x5206;&#xFF0C;&#x518D;&#x4ECE;&#x90E8;&#x5206;&#x56DE;&#x5230;&#x6574;&#x4F53;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x4E0D;&#x4EC5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x4E86;&#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x7684;&#x590D;&#x6742;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x8BA9;&#x6211;&#x4EEC;&#x660E;&#x767D;&#x4E86;&#x5728;&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x5EFA;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5C42;&#x6B21;&#x5206;&#x660E;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x6765;&#x7BA1;&#x7406;&#x548C;&#x7B80;&#x5316;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x3002;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8003;&#x8651;&#x5982;&#x4F55;&#x4E0E;&#x5176;&#x4ED6;&#x5B50;&#x7CFB;&#x7EDF;&#x534F;&#x4F5C;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;&#x6EE1;&#x8DB3;&#x5F53;&#x524D;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4FDD;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5FAE;&#x4FE1;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x548C;&#x5B50;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x7684;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#xFF0C;&#x8FD8;&#x6709;&#x5BF9;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x5982;&#x4F55;&#x88AB;&#x8FD0;&#x7528;&#x4EE5;&#x89E3;&#x51B3;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x7684;&#x6D1E;&#x89C1;&#x3002;&#x8FD9;&#x79CD;&#x7406;&#x8BBA;&#x4E0E;&#x5B9E;&#x8DF5;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x6307;&#x5BFC;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x5730;&#x8BBE;&#x8BA1;&#x548C;&#x4F18;&#x5316;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x548C;&#x6311;&#x6218;&#x3002;</p>
<h4 id="2-2&#x3001;&#x6A21;&#x5757;&#x4E0E;&#x7EC4;&#x4EF6;"><a href="#2-2&#x3001;&#x6A21;&#x5757;&#x4E0E;&#x7EC4;&#x4EF6;" class="headerlink" title="2.2&#x3001;&#x6A21;&#x5757;&#x4E0E;&#x7EC4;&#x4EF6;"></a>2.2&#x3001;<strong>&#x6A21;&#x5757;&#x4E0E;&#x7EC4;&#x4EF6;</strong></h4><p>&#x8981;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x63A2;&#x8BA8;&#xFF1A;&#x903B;&#x8F91;&#x548C;&#x7269;&#x7406;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x770B;&#x5F85;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x673A;&#x5668;&#x7684;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x62C6;&#x5206;&#x4EA7;&#x751F;&#x4E86;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x6A21;&#x5757;&#x201D;&#xFF0C;&#x800C;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x62C6;&#x5206;&#x5219;&#x7ED9;&#x6211;&#x4EEC;&#x201C;&#x7EC4;&#x4EF6;&#x201D;&#x3002;</p>
<ul>
<li>&#x6A21;&#x5757;&#xFF1A;&#x628A;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x60F3;&#x8C61;&#x6210;&#x662F;&#x628A;&#x4E00;&#x672C;&#x539A;&#x539A;&#x7684;&#x6559;&#x79D1;&#x4E66;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7AE0;&#x8282;&#xFF0C;&#x6BCF;&#x4E00;&#x7AE0;&#x8282;&#x4E13;&#x6CE8;&#x4E8E;&#x8BB2;&#x89E3;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x91CC;&#xFF0C;&#x6A21;&#x5757;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x5B83;&#x5C01;&#x88C5;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#xFF0C;&#x5171;&#x540C;&#x5B8C;&#x6210;&#x4E00;&#x9879;&#x6216;&#x51E0;&#x9879;&#x7279;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5212;&#x5206;&#x6A21;&#x5757;&#x7684;&#x76EE;&#x7684;&#x5F88;&#x660E;&#x786E;&#xFF1A;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x6709;&#x6761;&#x7406;&#xFF0C;&#x6BCF;&#x90E8;&#x5206;&#x90FD;&#x6709;&#x660E;&#x786E;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x8FD8;&#x80FD;&#x5728;&#x56E2;&#x961F;&#x4E2D;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x534F;&#x4F5C;&#x3002;</li>
<li>&#x7EC4;&#x4EF6;&#xFF1A;&#x518D;&#x60F3;&#x60F3;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x6BD4;&#x55BB;&#x4E3A;&#x4E50;&#x9AD8;&#x79EF;&#x6728;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5757;&#x79EF;&#x6728;&#x3002;&#x8FD9;&#x4E9B;&#x79EF;&#x6728;&#x662F;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x7EC4;&#x4EF6;&#x662F;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x5C31;&#x50CF;&#x662F;&#x6807;&#x51C6;&#x5316;&#x7684;&#x96F6;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x7EC4;&#x88C5;&#x6216;&#x66F4;&#x6362;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x5F00;&#x53D1;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x6548;&#x7387;&#x3002;</li>
</ul>
<p>&#x63D0;&#x5230;&#x201C;&#x7EC4;&#x4EF6;&#x201D;&#x7684;&#x82F1;&#x6587;&#x201C;component&#x201D;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x8BD1;&#x4E3A;&#x201C;&#x96F6;&#x4EF6;&#x201D;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x52A0;&#x5F62;&#x8C61;&#x548C;&#x6613;&#x61C2;&#x3002;&#x8FD9;&#x4E2A;&#x8BCD;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x628A;&#x63E1;&#x7EC4;&#x4EF6;&#x7684;&#x672C;&#x8D28;&#xFF1A;&#x5B83;&#x4EEC;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x3001;&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#x7684;&#x7269;&#x7406;&#x5355;&#x4F4D;&#xFF0C;&#x6B63;&#x5982;&#x673A;&#x68B0;&#x4E2D;&#x7684;&#x96F6;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x5177;&#x5907;&#x4E86;&#x53EF;&#x63D2;&#x62D4;&#x548C;&#x53EF;&#x590D;&#x7528;&#x7684;&#x7279;&#x6027;&#x3002;&#x8FD9;&#x79CD;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x62C6;&#x5206;&#x4E0D;&#x4EC5;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x66F4;&#x52A0;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x8FD8;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x5347;&#x7EA7;&#x548C;&#x7EF4;&#x62A4;&#x63D0;&#x4F9B;&#x4E86;&#x6781;&#x5927;&#x7684;&#x4FBF;&#x5229;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x903B;&#x8F91;&#x548C;&#x7269;&#x7406;&#x62C6;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x66F4;&#x7CBE;&#x7EC6;&#x5730;&#x7BA1;&#x7406;&#x548C;&#x6784;&#x5EFA;&#x590D;&#x6742;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F7F;&#x4E4B;&#x65E2;&#x6709;&#x6761;&#x7406;&#x53C8;&#x9AD8;&#x6548;&#x3002;&#x6A21;&#x5757;&#x5316;&#x548C;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#xFF0C;&#x662F;&#x73B0;&#x4EE3;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x5F97;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x50CF;&#x642D;&#x5EFA;&#x4E50;&#x9AD8;&#x4E00;&#x6837;&#x65E2;&#x6709;&#x8DA3;&#x53C8;&#x5BCC;&#x6709;&#x521B;&#x9020;&#x6027;&#x3002;</p>
<h4 id="2-3&#x3001;&#x6846;&#x67B6;&#x4E0E;&#x67B6;&#x6784;"><a href="#2-3&#x3001;&#x6846;&#x67B6;&#x4E0E;&#x67B6;&#x6784;" class="headerlink" title="2.3&#x3001;&#x6846;&#x67B6;&#x4E0E;&#x67B6;&#x6784;"></a>2.3&#x3001;<strong>&#x6846;&#x67B6;&#x4E0E;&#x67B6;&#x6784;</strong></h4><p><strong>&#x5355;&#x7EAF;&#x4ECE;&#x5B9A;&#x4E49;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6846;&#x67B6;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x201C;&#x89C4;&#x8303;&#x201D;&#xFF0C;&#x67B6;&#x6784;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x201C;&#x7ED3;&#x6784;&#x201D;</strong> &#x3002;&#x6846;&#x67B6;&#xFF08;Framework&#xFF09;&#x4E3A;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x9884;&#x8BBE;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x5E93;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x7279;&#x5B9A;&#x7684;&#x89C4;&#x8303;&#x548C;&#x6A21;&#x5F0F;&#x6765;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x642D;&#x5EFA;&#x4E00;&#x5EA7;&#x623F;&#x5B50;&#xFF0C;&#x6846;&#x67B6;&#x5C31;&#x50CF;&#x662F;&#x63D0;&#x4F9B;&#x7ED9;&#x4F60;&#x7684;&#x65BD;&#x5DE5;&#x5957;&#x4EF6;&#x548C;&#x8BE6;&#x7EC6;&#x6307;&#x5357;&#xFF0C;&#x5B83;&#x6307;&#x5BFC;&#x4F60;&#x6BCF;&#x4E00;&#x6B65;&#x5982;&#x4F55;&#x5EFA;&#x9020;&#xFF0C;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x90FD;&#x80FD;&#x6B63;&#x786E;&#x5730;&#x627F;&#x62C5;&#x8D77;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x67B6;&#x6784;&#xFF08;Architecture&#xFF09;&#xFF0C;&#x5219;&#x66F4;&#x50CF;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF0C;&#x5B83;&#x8BE6;&#x7EC6;&#x89C4;&#x5212;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#xFF0C;&#x5C55;&#x793A;&#x4E86;&#x7EC4;&#x4EF6;&#x5982;&#x4F55;&#x4E92;&#x76F8;&#x914D;&#x5408;&#xFF0C;&#x6570;&#x636E;&#x5982;&#x4F55;&#x6D41;&#x8F6C;&#xFF0C;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x89C4;&#x5212;&#x6574;&#x4E2A;&#x623F;&#x5B50;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x51B3;&#x5B9A;&#x54EA;&#x91CC;&#x653E;&#x7F6E;&#x5BA2;&#x5385;&#xFF0C;&#x54EA;&#x91CC;&#x662F;&#x53A8;&#x623F;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x623F;&#x5B50;&#x65E2;&#x6EE1;&#x8DB3;&#x5C45;&#x4F4F;&#x529F;&#x80FD;&#x53C8;&#x5177;&#x6709;&#x7F8E;&#x89C2;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x8BF4;&#xFF0C;&#x201C;&#x5DE5;&#x7A0B;&#x91C7;&#x7528;&#x7684;&#x662F;MVC&#x67B6;&#x6784;&#x201D;&#x3001;&#x201C;&#x5DE5;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x662F;SSH&#x6846;&#x67B6;&#x201D;&#x7B49;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;<strong>&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x7AD9;&#x5728;&#x7ED3;&#x6784;&#x7684;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#x660E;</strong>&#xFF0C;&#x5B83;&#x50CF;&#x662F;&#x5728;&#x63CF;&#x8FF0;&#x623F;&#x5B50;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x548C;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x5982;&#x4F55;&#x5212;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x529F;&#x80FD;&#x533A;&#x57DF;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x662F;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x7684;&#x3002;<strong>&#x7B2C;&#x4E8C;&#x53E5;&#x8BDD;&#x662F;&#x7AD9;&#x5728;&#x89C4;&#x8303;&#x7684;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#x660E;</strong>&#xFF0C;&#x5B83;&#x66F4;&#x591A;&#x5173;&#x6CE8;&#x4E8E;&#x5EFA;&#x9020;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x7684;&#x6807;&#x51C6;&#x548C;&#x89C4;&#x5219;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6280;&#x672F;&#x6808;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x6765;&#x5B9E;&#x73B0;&#x9884;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89D2;&#x4F1A;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x5BF9;&#x67B6;&#x6784;&#x7684;&#x7406;&#x89E3;&#x548C;&#x63CF;&#x8FF0;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li><strong>&#x4ECE;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x89D2;&#x5EA6;&#x5206;&#x89E3;&#xFF0C;&#x201C;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x67B6;&#x6784;</strong>(&#x56FE;1-3&#x6240;&#x793A;)&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5173;&#x6CE8;&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x7528;&#x6237;&#x7684;&#x6CE8;&#x518C;&#x3001;&#x4FE1;&#x606F;&#x7BA1;&#x7406;&#x3001;&#x4E1A;&#x52A1;&#x9009;&#x62E9;&#x548C;&#x6570;&#x636E;&#x7EDF;&#x8BA1;&#x7B49;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x8BA9;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x652F;&#x6301;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x7684;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/e36e92745fe689196e50a13d861565ecc7308875cfd91d1b73a05f6e6fb33fd4" alt></p>
<p>&#x56FE;1-3</p>
<ul>
<li><strong>&#x4ECE;&#x7269;&#x7406;&#x90E8;&#x7F72;&#x7684;&#x89D2;&#x5EA6;&#x5206;&#x89E3;&#xFF0C;&#x201C;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x67B6;&#x6784;</strong>(&#x5982;&#x56FE;1-4&#x6240;&#x793A;)&#xFF0C;&#x5219;&#x5173;&#x6CE8;&#x7CFB;&#x7EDF;&#x7684;&#x786C;&#x4EF6;&#x5E03;&#x5C40;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x3001;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B49;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x6765;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x548C;&#x9AD8;&#x6027;&#x80FD;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/2c45d690ca60b3b47e73fd2314c718199a4020b3b075386a753dcf2ca893137f" alt="&#x56FE;1-4"></p>
<ul>
<li><strong>&#x4ECE;&#x5F00;&#x53D1;&#x7ED3;&#x6784;&#x7684;&#x89D2;&#x5EA6;&#x5206;&#x89E3;&#xFF0C;&#x201C;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x67B6;&#x6784;</strong>(&#x5982;&#x56FE;1-5&#x6240;&#x793A;)&#xFF0C;&#x6211;&#x4EEC;&#x5219;&#x66F4;&#x52A0;&#x5173;&#x6CE8;&#x4EE3;&#x7801;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x3001;&#x6A21;&#x5757;&#x7684;&#x5212;&#x5206;&#x4EE5;&#x53CA;&#x6280;&#x672F;&#x6846;&#x67B6;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x3001;&#x529F;&#x80FD;&#x8FED;&#x4EE3;&#x548C;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/43a633d08b2f064c4e9623547c402010a5f9db7327af6cad5aabf0e75bc8199e" alt="&#x56FE;1-5"></p>
<p>&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x66F4;&#x5168;&#x9762;&#x5730;&#x7406;&#x89E3;&#x6846;&#x67B6;&#x548C;&#x67B6;&#x6784;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x6839;&#x636E;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#xFF0C;&#x4ECE;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x8BC4;&#x4F30;&#x548C;&#x9009;&#x62E9;&#x6700;&#x5408;&#x9002;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x548C;&#x6280;&#x672F;&#x6846;&#x67B6;&#x3002;&#x8FD9;&#x79CD;&#x591A;&#x89D2;&#x5EA6;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5B83;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x51FA;&#x65E2;&#x7A33;&#x5065;&#x53C8;&#x7075;&#x6D3B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x548C;&#x6280;&#x672F;&#x6311;&#x6218;&#x3002;</p>
<h3 id="3&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x53CA;&#x8FB9;&#x754C;"><a href="#3&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x53CA;&#x8FB9;&#x754C;" class="headerlink" title="3&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x53CA;&#x8FB9;&#x754C;"></a>3&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x53CA;&#x8FB9;&#x754C;</h3><p>&#x8C08;&#x5230;&#x201C;&#x67B6;&#x6784;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x516C;&#x53F8;&#x3001;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x4E43;&#x81F3;&#x4E8E;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x5BF9;&#x4E8E;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201D;&#x7684;&#x7406;&#x89E3;&#x90FD;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x7CBE;&#x786E;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x4ECE;&#x591A;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5C1D;&#x8BD5;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x60F3;&#x8981;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x7684;&#x201C;&#x67B6;&#x6784;&#x5B9A;&#x4E49;&#x201D;&#xFF0C;&#x90A3;&#x57FA;&#x672C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x9053;&#x53EF;&#x9053;&#xFF0C;&#x975E;&#x5E38;&#x9053;&#x3002;&#x540D;&#x53EF;&#x540D;&#xFF0C;&#x975E;&#x5E38;&#x540D;&#x201D;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5185;&#x90E8;&#xFF0C;&#x5145;&#x6EE1;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x58F0;&#x97F3;&#x548C;&#x89C2;&#x70B9;&#x3002;&#x6709;&#x7684;&#x7EC4;&#x7EC7;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x6280;&#x672F;&#x7684;&#x5B9E;&#x7528;&#x6027;&#x51FA;&#x53D1;&#xFF0C;&#x5B9A;&#x4E49;&#x67B6;&#x6784;&#x662F;&#x4E00;&#x79CD;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x3001;&#x9AD8;&#x6548;&#x8FD0;&#x884C;&#x7684;&#x5E03;&#x5C40;&#xFF1B;&#x6709;&#x7684;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x66F4;&#x6CE8;&#x91CD;&#x67B6;&#x6784;&#x5728;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x7B56;&#x7565;&#x89D2;&#x8272;&#xFF0C;&#x89C6;&#x4E4B;&#x4E3A;&#x4E00;&#x79CD;&#x827A;&#x672F;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5728;&#x5C1D;&#x8BD5;&#x4ECE;&#x81EA;&#x5DF1;&#x72EC;&#x7279;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x89E3;&#x8BFB;&#x548C;&#x5B9A;&#x4E49;&#x201C;&#x67B6;&#x6784;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x65E0;&#x6570;&#x7684;&#x8272;&#x5F69;&#x4E2D;&#x5BFB;&#x627E;&#x90A3;&#x4E00;&#x62B9;&#x6700;&#x4E3A;&#x5408;&#x9002;&#x7684;&#x84DD;&#xFF0C;&#x65E2;&#x5145;&#x6EE1;&#x4E86;&#x4E2A;&#x4EBA;&#x8272;&#x5F69;&#xFF0C;&#x4E5F;&#x53CD;&#x6620;&#x4E86;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x591A;&#x5143;&#x548C;&#x590D;&#x6742;&#x3002;</p>
<h4 id="3-1&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;"><a href="#3-1&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;" class="headerlink" title="3.1&#x3001;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;"></a>3.1&#x3001;<strong>&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;</strong></h4><blockquote>
<p>the fundamental <strong>organization</strong> of a system, embodied in its <strong>components</strong>, their <strong>relationships</strong> to each other and the <strong>environment</strong>, and the <strong>principles</strong> governing its design and evolution &#x2013;ANSI/IEEE</p>
</blockquote>
<p><strong>IEEE &#x5173;&#x4E8E;&#x67B6;&#x6784;&#x7684;</strong>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x5176;&#x5B9E;&#xFF0C;&#x628A;&#x5B83;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x4E09;&#x660E;&#x6CBB;&#xFF0C;&#x4E0A;&#x9762;&#x662F;<strong>&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x67B6;&#x6784;</strong>&#xFF0C;&#x4E2D;&#x95F4;&#x5939;&#x7740;&#x7684;&#x662F;<strong>&#x5404;&#x4E2A;&#x7EC4;&#x4EF6;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x7EBD;&#x5E26;</strong>&#xFF08;&#x8FD9;&#x91CC;&#x7684;&#x7EBD;&#x5E26;&#xFF0C;&#x65E2;&#x5305;&#x62EC;&#x7EC4;&#x4EF6;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x4E5F;&#x6DB5;&#x76D6;&#x4E86;&#x5B83;&#x4EEC;&#x4E0E;&#x5916;&#x754C;&#x73AF;&#x5883;&#x7684;&#x4E92;&#x52A8;&#xFF09;&#xFF0C;&#x5E95;&#x4E0B;&#x5219;&#x662F;<strong>&#x4E00;&#x5957;&#x884C;&#x52A8;&#x51C6;&#x5219;</strong>&#x3002;&#x54B1;&#x4EEC;&#x82E5;&#x662F;&#x7528;&#x56FE;&#x5F62;&#x6765;&#x8868;&#x8FBE;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x90A3;&#x4E48;&#x5236;&#x4F5C;&#x51FA;&#x6765;&#x7684;&#x56FE;&#x793A;&#x5E94;&#x8BE5;&#x65E2;&#x6E05;&#x723D;&#x53C8;&#x76F4;&#x89C2;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x67B6;&#x6784;&#x7684;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x548C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF0C;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x5730;&#x5C55;&#x793A;&#x51FA;&#x6765;(&#x5982;&#x56FE;1-6&#x6240;&#x793A;)&#xFF1A;</p>
<ul>
<li><strong>&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x67B6;&#x6784;</strong>&#xFF1A;&#x8FD9;&#x90E8;&#x5206;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5728;&#x8BB2;&#xFF0C;&#x8BA9;&#x4EBA;&#x4E00;&#x773C;&#x5C31;&#x80FD;&#x770B;&#x61C2;&#x7684;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x5E03;&#x5C40;&#x3002;&#x5C31;&#x50CF;&#x662F;&#x7ED9;&#x4F60;&#x4E00;&#x5F20;&#x5730;&#x56FE;&#xFF0C;&#x4E0A;&#x9762;&#x6807;&#x6CE8;&#x4E86;&#x6240;&#x6709;&#x91CD;&#x8981;&#x7684;&#x5730;&#x6807;&#x548C;&#x8DEF;&#x5F84;&#xFF0C;&#x8BA9;&#x4F60;&#x5BF9;&#x6574;&#x4E2A;&#x5730;&#x5F62;&#x6709;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</li>
<li><strong>&#x7EC4;&#x4EF6;&#x53CA;&#x5176;&#x5173;&#x7CFB;</strong>&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x628A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x62C6;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x4FBF;&#x4E8E;&#x7406;&#x89E3;&#x548C;&#x7BA1;&#x7406;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5F3A;&#x8C03;&#x4E86;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x6A21;&#x5757;&#x4E0E;&#x5916;&#x90E8;&#x73AF;&#x5883;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x548C;&#x8054;&#x7CFB;&#x3002;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x5F20;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7EDC;&#x56FE;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x7EBF;&#x5219;&#x8868;&#x793A;&#x4E86;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x3002;</li>
<li><strong>&#x884C;&#x52A8;&#x51C6;&#x5219;</strong>&#xFF1A;&#x8FD9;&#x90E8;&#x5206;&#x63D0;&#x4F9B;&#x7684;&#x662F;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x8FDB;&#x7CFB;&#x7EDF;&#x65F6;&#x9700;&#x8981;&#x9075;&#x5B88;&#x7684;&#x89C4;&#x5219;&#x548C;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x3002;&#x5C31;&#x597D;&#x6BD4;&#x662F;&#x4E00;&#x672C;&#x6307;&#x5357;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x5728;&#x8FFD;&#x6C42;&#x76EE;&#x6807;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x5E94;&#x8BE5;&#x575A;&#x6301;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x9700;&#x8981;&#x907F;&#x514D;&#x7684;&#x9519;&#x8BEF;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/d157bf19a1e1f5654645d363189b3fca455f01ad81af795206020909ce24057c" alt="&#x56FE;1-6"></p>
<p>&#x5927;&#x5E08; <strong>Martin Fowler</strong>&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x6709;&#x7740;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#x7684;&#x62BD;&#x8C61;&#xFF0C;Martin Fowler &#x8BA4;&#x4E3A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x662F;&#xFF1A;<strong>&#x91CD;&#x8981;&#x5E76;&#x4E14;&#x96BE;&#x4EE5;&#x6539;&#x53D8;&#x7684;&#x51B3;&#x7B56;</strong>&#x3002;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x662F;&#x5173;&#x4E8E;&#x6743;&#x8861;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5145;&#x6EE1;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x8FD9;&#x4E9B;&#x51B3;&#x7B56;&#x4E5F;&#x7EC8;&#x5C06;&#x53CD;&#x5E94;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x5728;&#x8BA8;&#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8FD9;&#x4E2A;&#x8BFE;&#x9898;&#x65F6;&#xFF0C;&#x5927;&#x5E08; <strong>Martin Fowler</strong> &#x7ED9;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x65E2;&#x7CBE;&#x70BC;&#x53C8;&#x6DF1;&#x523B;&#xFF1A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x90A3;&#x4E9B;<strong>&#x7279;&#x522B;&#x91CD;&#x8981;&#x800C;&#x4E14;&#x6539;&#x8D77;&#x6765;&#x5934;&#x75BC;&#x7684;&#x51B3;&#x7B56;</strong>&#x3002;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x662F;&#x5728;&#x8BF4;&#xFF0C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x667A;&#x6167;&#x7684;&#x6743;&#x8861;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x505A;&#x51FA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x51B3;&#x7B56;&#xFF0C;&#x90FD;&#x50CF;&#x662F;&#x5728;&#x672A;&#x6765;&#x7684;&#x7CFB;&#x7EDF;&#x84DD;&#x56FE;&#x4E0A;&#xFF0C;&#x6084;&#x6084;&#x5730;&#x52A0;&#x4E0A;&#x4E86;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x7B7E;&#x540D;&#x3002;</p>
<blockquote>
<p>Software Architecture = <strong>Important</strong> and <strong>hard</strong> to change <strong>decisions</strong> &#x2013;<strong>Martin Fowler</strong></p>
</blockquote>
<p>&#x800C; <strong>Ralph Johnson</strong> &#x8FD9;&#x4F4D;&#x5927;&#x4F6C;&#xFF0C;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x54F2;&#x5B66;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x561B;&#xFF0C;&#x7B80;&#x5355;&#x70B9;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x90A3;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5177;&#x4F53;&#x662F;&#x5565;&#x5462;&#xFF1F;&#x4ED6;&#x4F3C;&#x4E4E;&#x5728;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF1A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7B54;&#x6848;&#x5C31;&#x50CF;&#x662F;&#x5B87;&#x5B99;&#x7684;&#x7EC8;&#x6781;&#x95EE;&#x9898;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F60;&#x600E;&#x4E48;&#x53BB;&#x7406;&#x89E3;&#x5B83;&#xFF01;</p>
<blockquote>
<p>The software architecutre is the <strong>important stuff</strong> ! <strong>Whatever it is</strong> ! &#x2013;<strong>Ralph Johnson</strong></p>
</blockquote>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x6BD4;&#xFF0C;Neil Ford &#x5219;&#x50CF;&#x662F;&#x90A3;&#x4F4D;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7684;&#x5B9E;&#x8DF5;&#x8005;&#xFF0C;&#x4ED6;&#x4E0D;&#x5728;&#x4E91;&#x7AEF;&#x98D8;&#xFF0C;&#x800C;&#x662F;&#x5E26;&#x7740;&#x5DE5;&#x5177;&#x7BB1;&#x8D70;&#x5230;&#x4E86;&#x524D;&#x7EBF;&#x3002;&#x4ED6;&#x4ECE;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x8BE6;&#x7EC6;&#x5217;&#x51FA;&#x4E86;&#x6784;&#x6210;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x57FA;&#x77F3;(&#x5982;&#x56FE;1-7&#x6240;&#x793A;)&#xFF1A;</p>
<ul>
<li><strong>&#x7ED3;&#x6784;</strong>&#xFF1A;&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x9009;&#x4E00;&#x4E2A;&#x98CE;&#x683C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x5B9A;&#x4E49;&#x4E86;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x9AA8;&#x67B6;&#xFF0C;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x3001;&#x662F;&#x5355;&#x4F53;&#xFF0C;&#x8FD8;&#x662F;&#x670D;&#x52A1;&#x5BFC;&#x5411;&#x67B6;&#x6784;&#xFF08;SOA&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x90FD;&#x50CF;&#x662F;&#x5728;&#x5411;&#x7CFB;&#x7EDF;&#x6CE8;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x7075;&#x9B42;&#x3002;</li>
<li><strong>&#x67B6;&#x6784;&#x5C5E;&#x6027;</strong>&#xFF1A;&#x8FD9;&#x4E9B;&#x770B;&#x4E0D;&#x89C1;&#x6478;&#x4E0D;&#x7740;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x6027;&#x80FD;&#x5982;&#x4F55;&#x3001;&#x53EF;&#x7528;&#x6027;&#x9AD8;&#x4F4E;&#x3001;&#x7EF4;&#x62A4;&#x8D77;&#x6765;&#x662F;&#x4E0D;&#x662F;&#x53CB;&#x597D;&#xFF0C;&#x5B83;&#x4EEC;&#x51B3;&#x5B9A;&#x4E86;&#x7CFB;&#x7EDF;&#x80FD;&#x5426;&#x5728;&#x6B8B;&#x9177;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x751F;&#x5B58;&#x4E0B;&#x6765;&#x3002;</li>
<li><strong>&#x67B6;&#x6784;&#x51B3;&#x7B56;</strong>&#xFF1A;&#x5728;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x90A3;&#x4E9B;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x9009;&#x62E9;&#x70B9;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x832B;&#x832B;&#x5927;&#x6D77;&#x4E2D;&#x822A;&#x884C;&#x7684;&#x8235;&#x624B;&#xFF0C;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x5730;&#x51B3;&#x5B9A;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x672A;&#x6765;&#x65B9;&#x5411;&#x3002;</li>
<li><strong>&#x8BBE;&#x8BA1;&#x539F;&#x5219;</strong>&#xFF1A;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x5C31;&#x50CF;&#x662F;&#x8001;&#x8239;&#x957F;&#x7684;&#x667A;&#x6167;&#xFF0C;&#x6307;&#x5F15;&#x7740;&#x8BBE;&#x8BA1;&#x8005;&#x907F;&#x5F00;&#x6697;&#x7901;&#xFF0C;&#x987A;&#x5229;&#x62B5;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/ae968069fefbf041b27399d927c5e53c8644f3ca1475819b1cb31330639acab9" alt="&#x56FE; 1-7"></p>
<h4 id="3-2&#x3001;&#x7ED3;&#x6784;"><a href="#3-2&#x3001;&#x7ED3;&#x6784;" class="headerlink" title="3.2&#x3001;&#x7ED3;&#x6784;"></a>3.2&#x3001;<strong>&#x7ED3;&#x6784;</strong></h4><p>&#x7ED3;&#x6784;&#x662F;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x4ECE;&#x5B8F;&#x89C2;&#x4E0A;&#x8868;&#x8FF0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x7EC4;&#x6210;&#x3002;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x6838;&#x5FC3;&#x4EFB;&#x52A1;&#x4E4B;&#x4E00;&#x662F;&#x4E3A;&#x7CFB;&#x7EDF;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x3002;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x57FA;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x6743;&#x8861;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6A21;&#x5757;&#x5316;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x201C;&#x7ED3;&#x6784;&#x201D;&#xFF0C;&#x8FD9;&#x5757;&#x53EF;&#x4E0D;&#x662F;&#x968F;&#x4FBF;&#x4E00;&#x8BF4;&#x5C31;&#x80FD;&#x8FC7;&#x53BB;&#x7684;&#x3002;&#x5B83;&#x5728;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x91CC;&#x9762;&#x5360;&#x7684;&#x4F4D;&#x5B50;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x5FC3;&#x810F;&#x5728;&#x4EBA;&#x4F53;&#x91CC;&#x7684;&#x89D2;&#x8272;&#x4E00;&#x6837;&#x91CD;&#x8981;&#x3002;&#x5B83;&#x4ECE;&#x4E00;&#x4E2A;&#x5B8F;&#x5927;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x6BCF;&#x90E8;&#x5206;&#x53C8;&#x662F;&#x600E;&#x4E48;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x641E;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x6070;&#x5230;&#x597D;&#x5904;&#x7684;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x6838;&#x5FC3;&#x65E5;&#x5E38;&#x4E86;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x4EEC;&#x5728;&#x9762;&#x5BF9;&#x5177;&#x4F53;&#x7684;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x5F97;&#x5148;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x8FC7;&#x4E00;&#x904D;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5168;&#x8C8C;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x548C;&#x6311;&#x6218;&#xFF0C;&#x6765;&#x505A;&#x4E00;&#x4E2A;&#x6743;&#x8861;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x9009;&#x62E9;&#x8D70;&#x6A21;&#x5757;&#x5316;&#x7684;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x597D;&#x5904;&#x662F;&#x7B80;&#x5355;&#x3001;&#x76F4;&#x63A5;&#xFF0C;&#x5BB9;&#x6613;&#x7BA1;&#x7406;&#xFF1B;&#x4F46;&#x5982;&#x679C;&#x9879;&#x76EE;&#x7279;&#x522B;&#x590D;&#x6742;&#xFF0C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x9700;&#x8981;&#x9AD8;&#x5EA6;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x90A3;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x53EF;&#x80FD;&#x5C31;&#x66F4;&#x5408;&#x9002;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x7BA1;&#x7406;&#x548C;&#x534F;&#x8C03;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x5B83;&#x80FD;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<p>&#x201C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x201D;&#x7684;&#x8FC7;&#x7A0B;(&#x5982;&#x56FE; 1-8&#x6240;&#x793A;)&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x505A;&#x4E00;&#x573A;&#x7CBE;&#x5FC3;&#x7B56;&#x5212;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x51ED;&#x501F;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x5BF9;&#x9879;&#x76EE;&#x9700;&#x6C42;&#x7684;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x8BE6;&#x7EC6;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x8D62;&#x5F97;&#x672A;&#x6765;&#x7684;&#x4FBF;&#x5229;&#x548C;&#x6548;&#x7387;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5145;&#x6EE1;&#x4E86;&#x6311;&#x6218;&#xFF0C;&#x4F46;&#x4E5F;&#x6B63;&#x662F;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x8BA9;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x95E8;&#x827A;&#x672F;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/60cdb2ca43fa26e9e93d5834c6706205d85c6272d234731b1cae28f66c5ab003" alt="&#x56FE; 1-8"></p>
<h4 id="3-3&#x3001;&#x67B6;&#x6784;&#x5C5E;&#x6027;"><a href="#3-3&#x3001;&#x67B6;&#x6784;&#x5C5E;&#x6027;" class="headerlink" title="3.3&#x3001;&#x67B6;&#x6784;&#x5C5E;&#x6027;"></a>3.3&#x3001;<strong>&#x67B6;&#x6784;&#x5C5E;&#x6027;</strong></h4><p>&#x5728;&#x804A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EDD;&#x4E0D;&#x80FD;&#x5FFD;&#x89C6;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x67B6;&#x6784;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x5E38;&#x8BF4;&#x7684;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x6216;&#x975E;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5728;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x7684;&#x4E00;&#x4E9B;&#x201C;&#x8D85;&#x80FD;&#x529B;&#x201D;&#xFF0C;&#x6BD4;&#x5982;&#x80FD;&#x8DD1;&#x5F97;&#x5FEB;&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#xFF09;&#x3001;&#x80FD;&#x7075;&#x6D3B;&#x6269;&#x5927;&#x6216;&#x7F29;&#x5C0F;&#x89C4;&#x6A21;&#xFF08;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x4F38;&#x7F29;&#x6027;&#xFF09;&#x3001;&#x78B0;&#x5230;&#x95EE;&#x9898;&#x4E0D;&#x5D29;&#x6E83;&#xFF08;&#x5F39;&#x6027;&#x548C;&#x5BB9;&#x9519;&#x6027;&#xFF09;&#x3001;&#x597D;&#x6D4B;&#x597D;&#x4FEE;&#xFF08;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF09;&#x7B49;&#x7B49;&#x3002;&#x8BBE;&#x8BA1;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x8981;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x67B6;&#x6784;&#x5C5E;&#x6027;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#x5230;&#x7CFB;&#x7EDF;&#x80FD;&#x5426;&#x5728;&#x91CE;&#x86EE;&#x751F;&#x957F;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x5B58;&#x6D3B;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x91CC;&#x5934;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x67B6;&#x6784;&#x5C5E;&#x6027;&#x591A;&#x5F97;&#x8DDF;&#x661F;&#x661F;&#x4E00;&#x6837;&#x6570;&#x4E0D;&#x6E05;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x660E;&#x767D;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#x548C;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x67B6;&#x6784;&#x5E08;&#x5F97;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#x57DF;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#xFF0C;&#x6765;&#x505A;&#x51FA;&#x7CBE;&#x51C6;&#x7684;&#x5206;&#x6790;&#x548C;&#x9009;&#x62E9;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x6781;&#x9AD8;&#x7684;&#x91D1;&#x878D;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9AD8;&#x6027;&#x80FD;&#x548C;&#x5BB9;&#x9519;&#x6027;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x4F60;&#x5F97;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7684;&#x5C5E;&#x6027;&#xFF1B;&#x800C;&#x5728;&#x4E00;&#x4E2A;&#x4E91;&#x670D;&#x52A1;&#x4EA7;&#x54C1;&#x4E2D;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x4F38;&#x7F29;&#x6027;&#x53EF;&#x80FD;&#x66F4;&#x4E3A;&#x5173;&#x952E;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0D;&#x662F;&#x4E00;&#x5E06;&#x98CE;&#x987A;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x67B6;&#x6784;&#x5C5E;&#x6027;(&#x5982;&#x56FE; 1-9&#x6240;&#x793A;)&#x4E4B;&#x95F4;&#x5F88;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7740;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x7684;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x727A;&#x7272;&#x4E00;&#x5B9A;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x548C;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#x3002;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5C31;&#x5F97;&#x50CF;&#x662F;&#x5728;&#x73A9;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x6E38;&#x620F;&#xFF0C;&#x65E2;&#x8981;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#xFF0C;&#x53C8;&#x8981;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4ED6;&#x4EEC;&#x8FD0;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x667A;&#x6167;&#xFF0C;&#x505A;&#x51FA;&#x6070;&#x5F53;&#x7684;&#x6743;&#x8861;&#x548C;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x6743;&#x8861;&#x548C;&#x9009;&#x62E9;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x65E8;&#x5728;&#x6253;&#x9020;&#x4E00;&#x4E2A;&#x65E2;&#x5F3A;&#x5927;&#x53C8;&#x5E73;&#x8861;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x8272;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4F4D;&#x827A;&#x672F;&#x5BB6;&#xFF0C;&#x65E2;&#x8981;&#x6709;&#x79D1;&#x5B66;&#x7684;&#x4E25;&#x8C28;&#x6027;&#xFF0C;&#x53C8;&#x8981;&#x6709;&#x827A;&#x672F;&#x7684;&#x521B;&#x9020;&#x529B;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/b0723695aa2dbcf8e267f3bac2073372d7ca9cb6834253a207d955bf6d50bb1a" alt="&#x56FE;1-9"></p>
<h4 id="3-4&#x3001;&#x67B6;&#x6784;&#x51B3;&#x7B56;"><a href="#3-4&#x3001;&#x67B6;&#x6784;&#x51B3;&#x7B56;" class="headerlink" title="3.4&#x3001;&#x67B6;&#x6784;&#x51B3;&#x7B56;"></a>3.4&#x3001;<strong>&#x67B6;&#x6784;&#x51B3;&#x7B56;</strong></h4><p>&#x5F53;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x7CBE;&#x9AD3;&#x65F6;&#xFF0C;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6D6E;&#x73B0;&#x4E3A;&#x5176;&#x6838;&#x5FC3;&#x3002;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5173;&#x4E8E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x66F4;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x5FC5;&#x987B;&#x9075;&#x5B88;&#x7684;&#x89C4;&#x5219;&#x7684;&#x4F53;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x6216;&#x51B3;&#x7B56;&#xFF0C;&#x6B63;&#x5982;&#x5BFC;&#x822A;&#x706F;&#x6307;&#x5F15;&#x8239;&#x53EA;&#x822A;&#x5411;&#xFF0C;&#x4E3A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x6307;&#x660E;&#x65B9;&#x5411;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8981;&#x8BA4;&#x8BC6;&#x5230;<strong>&#x5E76;&#x975E;&#x6240;&#x6709;&#x51B3;&#x7B56;&#x90FD;&#x80FD;&#x88AB;&#x79F0;&#x4E3A;&#x67B6;&#x6784;&#x51B3;&#x7B56;</strong>&#x3002;&#x53EA;&#x6709;&#x90A3;&#x4E9B;&#x5BF9;&#x7CFB;&#x7EDF;&#x6709;&#x7740;&#x91CD;&#x5927;&#x4E14;&#x6DF1;&#x8FDC;&#x5F71;&#x54CD;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x624D;&#x914D;&#x5F97;&#x4E0A;&#x8FD9;&#x4E2A;&#x79F0;&#x53F7;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x51B3;&#x5B9A;&#x91C7;&#x7528;&#x4F55;&#x79CD;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x4F1A;&#x6DF1;&#x523B;&#x5F71;&#x54CD;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E00;&#x65E6;&#x8BBE;&#x5B9A;&#xFF0C;&#x66F4;&#x6539;&#x7684;&#x4EE3;&#x4EF7;&#x6781;&#x4E3A;&#x6602;&#x8D35;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x65E0;&#x7591;&#x5C5E;&#x4E8E;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#x7684;&#x8303;&#x7574;&#x3002;</p>
<p>&#x67B6;&#x6784;&#x51B3;&#x7B56;&#x7684;&#x8303;&#x56F4;&#x5E7F;&#x6CDB;&#xFF0C;&#x5185;&#x5BB9;&#x4E30;&#x5BCC;&#xFF0C;&#x5B83;&#x4EEC;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x9886;&#x57DF;&#xFF1A;</p>
<ul>
<li>&#x76F4;&#x63A5;&#x5BF9;<strong>&#x67B6;&#x6784;&#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x7684;&#x95EE;&#x9898;</strong>&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#xFF1A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#x7B49;&#x5173;&#x952E;&#x67B6;&#x6784;&#x5C5E;&#x6027;&#x7684;&#x51B3;&#x7B56;&#x90FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;</li>
<li><strong>&#x4FEE;&#x6539;&#x5BF9;&#x5916;&#x63A5;&#x53E3;</strong>&#xFF1A;&#x8FD9;&#x7C7B;&#x51B3;&#x7B56;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5468;&#x5168;&#x7684;&#x5F71;&#x54CD;&#x5206;&#x6790;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x7CFB;&#x7EDF;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x6839;&#x672C;&#x6027;&#x7684;&#x6539;&#x53D8;&#x3002;</li>
<li><strong>&#x5F15;&#x5165;&#x6216;&#x79FB;&#x9664;&#x4F9D;&#x8D56;</strong>&#xFF1A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x53D8;&#x5316;&#x6807;&#x5FD7;&#x7740;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x7684;&#x589E;&#x51CF;&#xFF0C;&#x5BF9;&#x67B6;&#x6784;&#x7684;&#x5F71;&#x54CD;&#x6DF1;&#x8FDC;&#xFF0C;&#x9700;&#x8981;&#x614E;&#x91CD;&#x8003;&#x8651;&#x3002;</li>
<li><strong>&#x6539;&#x53D8;&#x7CFB;&#x7EDF;&#x7684;&#x901A;&#x7528;&#x7ED3;&#x6784;</strong>&#xFF1A;&#x8FD9;&#x5173;&#x4E4E;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5E03;&#x5C40;&#xFF0C;&#x4EFB;&#x4F55;&#x8C03;&#x6574;&#x90FD;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x91CD;&#x5927;&#x5E72;&#x9884;&#x3002;</li>
<li><strong>&#x4FC3;&#x4F7F;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x6539;&#x53D8;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x8FD9;&#x7C7B;&#x51B3;&#x7B56;&#x5F80;&#x5F80;&#x6D89;&#x53CA;&#x5230;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x548C;&#x6587;&#x5316;&#xFF0C;&#x5BF9;&#x56E2;&#x961F;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x548C;&#x4EA7;&#x54C1;&#x7684;&#x8D28;&#x91CF;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;</li>
<li><strong>&#x627F;&#x62C5;&#x6218;&#x7565;&#x6027;&#x6280;&#x672F;&#x503A;&#x52A1;</strong>&#xFF1A;&#x6709;&#x65F6;&#x4E3A;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x957F;&#x671F;&#x53D1;&#x5C55;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x77ED;&#x671F;&#x5185;&#x770B;&#x4F3C;&#x4E0D;&#x5229;&#x4F46;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x6709;&#x76CA;&#x7684;&#x6280;&#x672F;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x4E9B;&#x51B3;&#x7B56;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#xFF0C;&#x8FDC;&#x4E0D;&#x6B62;&#x662F;&#x6280;&#x672F;&#x5C42;&#x9762;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5B83;&#x4EEC;&#x80CC;&#x540E;&#x8574;&#x542B;&#x7684;&#x662F;&#x5BF9;&#x9879;&#x76EE;&#x672A;&#x6765;&#x65B9;&#x5411;&#x7684;&#x6DF1;&#x601D;&#x719F;&#x8651;&#x3002;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#x53EF;&#x4EE5;&#x4E3A;&#x9879;&#x76EE;&#x5E26;&#x6765;&#x987A;&#x5229;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x800C;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x9879;&#x76EE;&#x9677;&#x5165;&#x91CD;&#x6784;&#x751A;&#x81F3;&#x5931;&#x8D25;&#x7684;&#x56F0;&#x5883;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x5177;&#x5907;&#x524D;&#x77BB;&#x6027;&#x548C;&#x6DF1;&#x5EA6;&#x7684;&#x601D;&#x8003;&#x80FD;&#x529B;&#xFF0C;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x4E2A;&#x51B3;&#x7B56;&#x90FD;&#x80FD;&#x4FC3;&#x8FDB;&#x9879;&#x76EE;&#x5411;&#x7740;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x3002;</p>
<h4 id="3-5&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;"><a href="#3-5&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;" class="headerlink" title="3.5&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;"></a>3.5&#x3001;<strong>&#x8BBE;&#x8BA1;&#x539F;&#x5219;</strong></h4><p>&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x548C;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x6307;&#x5357;&#x548C;&#x6307;&#x5BFC;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x6307;&#x5F15;&#x7740;&#x4F60;&#x524D;&#x884C;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x5177;&#x4F53;&#x7684;&#x7528;&#x6CD5;&#x548C;&#x610F;&#x4E49;&#xFF0C;&#x5374;&#x5927;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x6838;&#x5FC3;&#x533A;&#x522B;&#x5728;&#x8FD9;&#x513F;&#xFF1A;<strong>&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5B83;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4F4D;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x524D;&#x8F88;&#xFF0C;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x7684;&#x90A3;&#x4E9B;&#x6307;&#x5BFC;&#x548C;&#x5EFA;&#x8BAE;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F3A;&#x8FEB;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x800C;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#xFF0C;&#x90A3;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x8BBE;&#x8BA1;&#x7684;&#x89C4;&#x7AE0;&#x5236;&#x5EA6;&#xFF0C;&#x4E00;&#x65E6;&#x786E;&#x5B9A;&#x4E0B;&#x6765;&#xFF0C;&#x4F60;&#x5C31;&#x5FC5;&#x987B;&#x5F97;&#x9075;&#x5B88;</strong>&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x5F97;&#x66F4;&#x660E;&#x767D;&#x4E00;&#x70B9;&#xFF0C;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x8FD9;&#x6837;&#x5EFA;&#x8BAE;&#x4F60;&#xFF1A;&#x5728;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x4E0A;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5229;&#x7528;&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x5565;&#x5462;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x8DD1;&#x5F97;&#x66F4;&#x5FEB;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x8FD8;&#x80FD;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5EA6;&#xFF0C;&#x8BA9;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x66F4;&#x52A0;&#x677E;&#x6563;&#xFF0C;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x3002;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x662F;&#x5728;&#x6559;&#x4F60;&#x5982;&#x4F55;&#x5728;&#x7E41;&#x5FD9;&#x7684;&#x57CE;&#x5E02;&#x4E2D;&#x5F00;&#x8F66;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x9AD8;&#x6548;&#x5730;&#x4ECE;A&#x70B9;&#x5230;B&#x70B9;&#xFF0C;&#x8FD8;&#x80FD;&#x5728;&#x8DEF;&#x4E0A;&#x4EAB;&#x53D7;&#x98CE;&#x666F;&#xFF0C;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x90FD;&#x662F;&#x5EFA;&#x8BAE;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x5BF9;&#x4F60;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x5FC5;&#x987B;&#x5F97;&#x8FD9;&#x4E48;&#x5E72;&#xFF01;&#x201D;&#x5B83;&#x7559;&#x7ED9;&#x4F60;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x53BB;&#x63A2;&#x7D22;&#x548C;&#x5B9E;&#x9A8C;&#xFF0C;&#x627E;&#x5230;&#x6700;&#x9002;&#x5408;&#x4F60;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x800C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x8C08;&#x5230;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x51B3;&#x5B9A;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x800C;&#x975E;&#x5355;&#x4F53;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x7B7E;&#x4E86;&#x4E00;&#x4E2A;&#x5951;&#x7EA6;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x4E25;&#x683C;&#x9075;&#x5B88;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5173;&#x7CFB;&#x5230;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x57FA;&#x7840;&#x548C;&#x672A;&#x6765;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</p>
<p>&#x5728;&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7406;&#x89E3;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4E0E;&#x67B6;&#x6784;&#x51B3;&#x7B56;&#x4E4B;&#x95F4;&#x7684;&#x8FD9;&#x79CD;&#x5FAE;&#x5999;&#x5DEE;&#x5F02;&#xFF0C;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x5B83;&#x4EEC;&#x4E00;&#x4E2A;&#x7ED9;&#x4F60;&#x7075;&#x611F;&#x548C;&#x81EA;&#x7531;&#xFF0C;&#x4E00;&#x4E2A;&#x7ED9;&#x4F60;&#x65B9;&#x5411;&#x548C;&#x89C4;&#x5219;&#xFF0C;&#x6B63;&#x786E;&#x5730;&#x8FD0;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x5C31;&#x80FD;&#x8BA9;&#x4F60;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x65E2;&#x7075;&#x6D3B;&#x53C8;&#x7A33;&#x5065;&#x3002;</p>
<h4 id="4&#x3001;&#x603B;&#x7ED3;"><a href="#4&#x3001;&#x603B;&#x7ED3;" class="headerlink" title="4&#x3001;&#x603B;&#x7ED3;"></a>4&#x3001;&#x603B;&#x7ED3;</h4><p>&#x5728;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x884C;&#x4E1A;&#x5185;&#x5404;&#x4F4D;&#x5927;&#x5E08;&#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x6837;&#x5316;&#x4E14;&#x5404;&#x5177;&#x7279;&#x8272;&#x7684;&#x89E3;&#x8BFB;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x50CF;&#x662F;&#x4E0D;&#x540C;&#x98CE;&#x683C;&#x7684;&#x753B;&#x6D3E;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x90FD;&#x6709;&#x5176;&#x72EC;&#x5230;&#x4E4B;&#x5904;&#xFF1A;</p>
<ul>
<li><strong>IEEE</strong>&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x662F;&#x7ECF;&#x5178;&#x4E3B;&#x4E49;&#x753B;&#x6D3E;&#xFF0C;&#x8FFD;&#x6C42;&#x7ED3;&#x6784;&#x7684;&#x4E25;&#x8C28;&#x548C;&#x5F62;&#x5F0F;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x51C6;&#x6846;&#x67B6;&#xFF0C;&#x50CF;&#x662F;&#x5728;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5EFA;&#x7B51;&#x7684;&#x6BCF;&#x4E00;&#x7816;&#x6BCF;&#x4E00;&#x74E6;&#x90FD;&#x8981;&#x7B26;&#x5408;&#x5EFA;&#x7B51;&#x5B66;&#x7684;&#x539F;&#x5219;&#x3002;</li>
<li><strong>Martin Fowler</strong>&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5219;&#x50CF;&#x662F;&#x5F3A;&#x8C03;&#x4E86;&#x753B;&#x4F5C;&#x4E2D;&#x7684;&#x6784;&#x56FE;&#x51B3;&#x7B56;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x5728;&#x7ED8;&#x753B;&#x4E2D;&#x9009;&#x62E9;&#x4E3B;&#x9898;&#x548C;&#x8272;&#x5F69;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5728;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x5173;&#x952E;&#x7684;&#x51B3;&#x7B56;&#x662F;&#x6784;&#x7B51;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x77F3;&#x3002;</li>
<li><strong>Ralph Johnson</strong>&#x7684;&#x5B9A;&#x4E49;&#x66F4;&#x50CF;&#x662F;&#x62BD;&#x8C61;&#x827A;&#x672F;&#xFF0C;&#x4ED6;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5F3A;&#x8C03;&#x4E86;&#x201C;&#x91CD;&#x8981;&#x6027;&#x201D;&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x5143;&#x7D20;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x62BD;&#x8C61;&#x753B;&#x4E2D;&#x5F3A;&#x8C03;&#x60C5;&#x611F;&#x548C;&#x6982;&#x5FF5;&#x7684;&#x8868;&#x8FBE;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x5230;&#x67B6;&#x6784;&#x7684;&#x6838;&#x5FC3;&#x5728;&#x4E8E;&#x5176;&#x91CD;&#x8981;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x4F5C;&#x7528;&#x3002;</li>
<li><strong>Neil Ford</strong>&#x7684;&#x770B;&#x6CD5;&#x5219;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E;&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#xFF0C;&#x4ED6;&#x901A;&#x8FC7;&#x5177;&#x4F53;&#x5316;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x901A;&#x8FC7;&#x7EC6;&#x817B;&#x7684;&#x753B;&#x9762;&#x63CF;&#x7ED8;&#x51FA;&#x751F;&#x6D3B;&#x7684;&#x6837;&#x6001;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x5730;&#x7406;&#x89E3;&#x548C;&#x64CD;&#x4F5C;&#x67B6;&#x6784;&#x7684;&#x5177;&#x4F53;&#x5143;&#x7D20;&#x3002;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x7279;&#x522B;&#x504F;&#x7231;<strong>Ralph Johnson</strong>&#x7684;&#x62BD;&#x8C61;&#x5316;&#x5B9A;&#x4E49;&#xFF0C;&#x5B83;&#x7B80;&#x6D01;&#x800C;&#x6DF1;&#x523B;&#xFF0C;&#x50CF;&#x662F;&#x7528;&#x4E00;&#x7B14;&#x5E26;&#x8FC7;&#x5374;&#x53C8;&#x70B9;&#x51FA;&#x67B6;&#x6784;&#x672C;&#x8D28;&#x3002;&#x5728;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x5C06;&#x590D;&#x6742;&#x95EE;&#x9898;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6210;&#x4E3A;&#x4E86;&#x6211;&#x5224;&#x65AD;&#x548C;&#x7406;&#x89E3;&#x67B6;&#x6784;&#x8FB9;&#x754C;&#x65F6;&#x7684;&#x91CD;&#x8981;&#x51C6;&#x5219;&#x3002;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x753B;&#x753B;&#x65F6;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x88AB;&#x5177;&#x4F53;&#x5F62;&#x5F0F;&#x6240;&#x675F;&#x7F1A;&#xFF0C;&#x4F46;&#x80FD;&#x591F;&#x6DF1;&#x523B;&#x628A;&#x63E1;&#x4F5C;&#x54C1;&#x7684;&#x7075;&#x9B42;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#x4E0D;&#x4EC5;&#x6307;&#x5BFC;&#x4E86;&#x6211;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#xFF0C;&#x4E5F;&#x5E2E;&#x52A9;&#x6211;&#x5728;&#x9762;&#x5BF9;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x805A;&#x7126;&#x4E8E;&#x90A3;&#x4E9B;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/cfd2624b5bcccd703547d420ed4ca6c1.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/架构-设计/" rel="tag"># 架构,设计</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7360984753463803930.html" rel="next" title="MySQL千万级数据从190秒优化到1秒全过程">
                <i class="fa fa-chevron-left"></i> MySQL千万级数据从190秒优化到1秒全过程
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7360990621853237274.html" rel="prev" title="消失的字段">
                消失的字段 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">1152</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">481</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#1、架构的诞生"><span class="nav-number">1.</span> <span class="nav-text">1、架构的诞生</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#2、架构指什么"><span class="nav-number">2.</span> <span class="nav-text">2、架构指什么</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#2-1、系统与子系统"><span class="nav-number">2.1.</span> <span class="nav-text">2.1、系统与子系统</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-2、模块与组件"><span class="nav-number">2.2.</span> <span class="nav-text">2.2、模块与组件</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#2-3、框架与架构"><span class="nav-number">2.3.</span> <span class="nav-text">2.3、框架与架构</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#3、架构的定义及边界"><span class="nav-number">3.</span> <span class="nav-text">3、架构的定义及边界</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#3-1、架构的定义"><span class="nav-number">3.1.</span> <span class="nav-text">3.1、架构的定义</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-2、结构"><span class="nav-number">3.2.</span> <span class="nav-text">3.2、结构</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-3、架构属性"><span class="nav-number">3.3.</span> <span class="nav-text">3.3、架构属性</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-4、架构决策"><span class="nav-number">3.4.</span> <span class="nav-text">3.4、架构决策</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#3-5、设计原则"><span class="nav-number">3.5.</span> <span class="nav-text">3.5、设计原则</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#4、总结"><span class="nav-number">3.6.</span> <span class="nav-text">4、总结</span></a></li></ol></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
