<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="前端,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x4E00;.&amp;#x5185;&amp;#x5BB9;&amp;#x603B;&amp;#x89C8;  &amp;#x5B66;&amp;#x4E60;&amp;#x603B;&amp;#x662F;&amp;#x4F34;&amp;#x968F;&amp;#x7740;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x4E00;&amp;#x751F;&amp;#xFF0C;&amp;#x65E0;&amp;#x8BBA;&amp;#x662F;&amp;#x524D;20&amp;#x5E74;&amp;#x7684;&amp;#x">
<meta name="keywords" content="前端">
<meta property="og:type" content="article">
<meta property="og:title" content="当下时代我们该如何学习">
<meta property="og:url" content="https://dev.newban.cn/7362106607511404559.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x4E00;.&amp;#x5185;&amp;#x5BB9;&amp;#x603B;&amp;#x89C8;  &amp;#x5B66;&amp;#x4E60;&amp;#x603B;&amp;#x662F;&amp;#x4F34;&amp;#x968F;&amp;#x7740;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x4E00;&amp;#x751F;&amp;#xFF0C;&amp;#x65E0;&amp;#x8BBA;&amp;#x662F;&amp;#x524D;20&amp;#x5E74;&amp;#x7684;&amp;#x">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3f574f69f1af9a922f7607649c76552788f5a1ea746df8609646ff240a697974">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e14060dea3f195fecf5be38cdb221604b61308f07c343d0bcfb3ff1385c13920">
<meta property="og:updated_time" content="2024-04-28T03:34:35.338Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当下时代我们该如何学习">
<meta name="twitter:description" content="&amp;#x4E00;.&amp;#x5185;&amp;#x5BB9;&amp;#x603B;&amp;#x89C8;  &amp;#x5B66;&amp;#x4E60;&amp;#x603B;&amp;#x662F;&amp;#x4F34;&amp;#x968F;&amp;#x7740;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x4E00;&amp;#x751F;&amp;#xFF0C;&amp;#x65E0;&amp;#x8BBA;&amp;#x662F;&amp;#x524D;20&amp;#x5E74;&amp;#x7684;&amp;#x">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3f574f69f1af9a922f7607649c76552788f5a1ea746df8609646ff240a697974">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7362106607511404559.html">





  <title>当下时代我们该如何学习 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">当下时代我们该如何学习</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-04-28T09:52:55+08:00">
                2024-04-28
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x4E00;-&#x5185;&#x5BB9;&#x603B;&#x89C8;"><a href="#&#x4E00;-&#x5185;&#x5BB9;&#x603B;&#x89C8;" class="headerlink" title="&#x4E00;.&#x5185;&#x5BB9;&#x603B;&#x89C8;"></a>&#x4E00;.&#x5185;&#x5BB9;&#x603B;&#x89C8;</h2><hr>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3f574f69f1af9a922f7607649c76552788f5a1ea746df8609646ff240a697974" alt></p>
<p>&#x5B66;&#x4E60;&#x603B;&#x662F;&#x4F34;&#x968F;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x751F;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x524D;20&#x5E74;&#x7684;&#x5B66;&#x4E60;&#x751F;&#x6DAF;&#xFF0C;&#x8FD8;&#x662F;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x5B66;&#x4E60;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4F1A;&#x50CF;&#x6211;&#x4E00;&#x6837;&#x66FE;&#x7ECF;&#x4E5F;&#x4E3A;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x5B66;&#x4E86;&#x5C31;&#x5FD8;&#xFF0C;&#x5FD8;&#x4E86;&#x518D;&#x5B66;&#xFF0C;&#x6C38;&#x8FDC;&#x5728;&#x8FFD;&#x65B0;&#xFF0C;&#x6C38;&#x8FDC;&#x8D76;&#x4E0D;&#x4E0A;&#x7684;&#x602A;&#x5708;&#x4E2D;&#x6298;&#x817E;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x5C06;&#x6839;&#x636E;&#x6211;&#x7684;&#x771F;&#x5B9E;&#x7ECF;&#x5386;&#x548C;&#x5BF9;&#x4E00;&#x4E9B;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x5168;&#x9762;&#x7684;&#x9610;&#x8FF0;&#x4E0B;&#x5B66;&#x4E60;&#xFF0C;&#x4ECE;&#x4E16;&#x754C;&#x89C2;&#xFF0C;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4EE5;&#x53CA;&#x7406;&#x8BBA;&#x652F;&#x6301;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x6982;&#x8FF0;&#x4E00;&#x4E0B;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x4E5F;&#x6709;&#x8FD9;&#x79CD;&#x82E6;&#x607C;&#x7684;&#x4EBA;&#x6709;&#x6240;&#x5F15;&#x5BFC;&#x548C;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="&#x4E8C;-&#x804A;&#x804A;&#x5B66;&#x4E60;&#x89C2;"><a href="#&#x4E8C;-&#x804A;&#x804A;&#x5B66;&#x4E60;&#x89C2;" class="headerlink" title="&#x4E8C;.&#x804A;&#x804A;&#x5B66;&#x4E60;&#x89C2;"></a>&#x4E8C;.&#x804A;&#x804A;&#x5B66;&#x4E60;&#x89C2;</h2><hr>
<p>&#x1F60A;&#x5728;&#x804A;&#x8FD9;&#x4E9B;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x89C9;&#x7684;&#x5927;&#x5BB6;&#x9700;&#x8981;&#x5148;&#x6452;&#x5F03;&#x4E00;&#x79CD;&#x5FC3;&#x6001;&#xFF0C;<code>&#x5B66;&#x4F1A;&#x4E00;&#x79CD;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x80FD;&#x4E0D;&#x8D39;&#x529B;&#x7684;&#x5B66;&#x597D;</code> &#x5B66;&#x597D;&#x53EF;&#x80FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8D39;&#x529B;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x79D1;&#x5B66;&#x89C4;&#x5F8B;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x771F;&#x7684;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6781;&#x5176;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x6211;&#x4EEC;&#x4E0D;&#x4E00;&#x5B9A;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x5B66;&#x3002;</p>
<p>&#x1F601;&#x9996;&#x5148;&#x6211;&#x60F3;&#x5148;&#x804A;&#x804A;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x8DEF;&#x5386;&#x7A0B;&#xFF0C;&#x770B;&#x770B;&#x4F60;&#x662F;&#x5426;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x5728;&#x8BFB;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x666E;&#x901A;&#x901A;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x6210;&#x7EE9;&#x5E76;&#x4E0D;&#x4F18;&#x79C0;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x5F88;&#x82E6;&#x607C;&#xFF0C;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x5B66;&#x4E0D;&#x597D;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4F1A;&#x89C9;&#x5F97;&#x90A3;&#x4E9B;&#x5B66;&#x4E60;&#x597D;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x662F;&#x975E;&#x5E38;&#x7684;&#x806A;&#x660E;&#xFF0C;&#x4ED6;&#x4EEC;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x8111;&#x5B50;&#x597D;&#xFF0C;&#x65B9;&#x6CD5;&#x5565;&#x7684;&#x90FD;&#x662F;&#x9A97;&#x8D44;&#x8D28;&#x5E73;&#x5E73;&#x7684;&#x4EBA;&#x7684;&#xFF0C;&#x5168;&#x662F;&#x9E21;&#x6C64;&#xFF0C;&#x7136;&#x540E;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5FC3;&#x6001;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x5E7B;&#x60F3;&#x7740;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x806A;&#x660E;&#xFF0C;&#x6216;&#x8005;&#x4EC0;&#x4E48;&#x7EDD;&#x4E16;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x968F;&#x4FBF;&#x542C;&#x542C;&#x8BFE;&#x5C31;&#x80FD;&#x6210;&#x7EE9;&#x4F18;&#x5F02;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x9057;&#x61BE;&#x6211;&#x5728;&#x5F53;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x63D0;&#x5347;&#x667A;&#x529B;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x4E5F;&#x6CA1;&#x6709;&#x73B0;&#x5728;&#x7684;&#x8BA4;&#x77E5;&#x548C;&#x9AD8;&#x5EA6;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x6211;&#x6210;&#x7EE9;&#x4E5F;&#x662F;&#x4F18;&#x79C0;&#x8FC7;&#x7684;&#xFF0C;&#x8BB0;&#x5F97;&#x5728;&#x5C0F;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x76F4;&#x4E5F;&#x662F;&#x540D;&#x5217;&#x524D;&#x8305;&#xFF0C;&#x6210;&#x7EE9;&#x7ECF;&#x5E38;&#x662F;&#x7B2C;&#x4E00;&#xFF0C;&#x6211;&#x5728;&#x601D;&#x8003;&#x8FC7;&#x540E;&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5C31;&#x662F;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x6211;&#x6210;&#x7EE9;&#x4F18;&#x79C0;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x662F;&#x975E;&#x5E38;&#x9759;&#x7684;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x89C9;&#x5F97;&#x67D0;&#x4E9B;&#x4EBA;&#x5F88;&#x5389;&#x5BB3;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E9B;&#x65B9;&#x6CD5;&#x5F88;&#x725B;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E9B;&#x4EBA;&#x6BD4;&#x6211;&#x806A;&#x660E;&#xFF0C;&#x5728;&#x90A3;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x7684;&#x773C;&#x4E2D;&#x7684;&#x4EBA;&#x548C;&#x77E5;&#x8BC6;&#x90FD;&#x662F;&#x5E73;&#x7B49;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x6BD4;&#x8F83;&#x96BE;&#x5C31;&#x4E0D;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x5BF9;&#x77E5;&#x8BC6;&#x548C;&#x4EBA;&#x90FD;&#x662F;&#x4E00;&#x89C6;&#x540C;&#x4EC1;&#x7684;&#xFF0C;&#x6BCF;&#x5929;&#x4E5F;&#x4E0D;&#x4F1A;&#x601D;&#x8003;&#x8981;&#x5404;&#x79D1;&#x8003;&#x591A;&#x5C11;&#x5206;&#xFF0C;&#x80FD;&#x4E0A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5927;&#x5B66;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x4EC5;&#x4EC5;&#x662F;&#x653E;&#x5728;&#x5355;&#x7EAF;&#x7684;&#x77E5;&#x8BC6;&#x4E0A;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x4E0D;&#x4F1A;&#x8BA1;&#x8F83;&#x67D0;&#x4EBA;&#x8BF4;&#x4F60;&#x98CE;&#x51C9;&#x8BDD;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x4F60;&#x6001;&#x5EA6;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x548C;&#x7ECF;&#x5386;&#x4EC5;&#x4EC5;&#x662F;&#x548C;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x73A9;&#x800D;&#x548C;&#x5BF9;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5728;&#x601D;&#x8003;&#x540E;&#x6211;&#x53D1;&#x73B0;&#x60F3;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7ED3;&#x679C;&#x9996;&#x5148;&#x5728;&#x5FC3;&#x6001;&#x4E0A;&#x5C31;&#x8981;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5C31;&#x6BD4;&#x5982;&#x6211;&#x73B0;&#x5728;&#x5728;&#x505A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5E02;&#x573A;&#x4E0A;&#x4E3B;&#x8981;&#x7684;&#x65B9;&#x5411;&#x6709;<code>&#x524D;&#x7AEF;</code> <code>Java&#x670D;&#x52A1;&#x7AEF;</code> <code>C/C++</code> &#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x603B;&#x4F1A;&#x542C;&#x5230;&#x4E00;&#x4E9B;&#x58F0;&#x97F3;&#xFF0C;&#x524D;&#x7AEF;&#x4E0D;&#x884C;&#xFF0C;&#x540E;&#x7AEF;&#x4E0D;&#x884C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x603B;&#x4F1A;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x4E0D;&#x670D;&#x6C14;&#x7684;&#x70B9;&#x60F3;&#x8981;&#x53BB;&#x636E;&#x7406;&#x529B;&#x4E89;&#xFF0C;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#x751A;&#x81F3;&#x89C9;&#x5F97;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#x8FD9;&#x79CD;&#x5FC3;&#x6001;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BF4;&#x6CD5;&#x9996;&#x5148;&#x662F;&#x4E0D;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#x6839;&#x672C;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x89C1;&#x8FC7;&#x5404;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x5927;&#x795E;&#xFF0C;&#x771F;&#x7684;&#x5C31;&#x662F;&#x884C;&#x884C;&#x51FA;&#x72B6;&#x5143;&#xFF0C;&#x751A;&#x81F3;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8DE8;&#x9886;&#x57DF;&#x5B66;&#x4E60;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x628A;&#x5FC3;&#x601D;&#x653E;&#x5728;&#x5177;&#x4F53;&#x6280;&#x672F;&#x4E0A;&#x53BB;&#xFF0C;&#x548C;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#x73A9;&#x800D;&#xFF0C;&#x5BF9;&#x8BDD;&#xFF0C;&#x5E94;&#x8BE5;&#x4ECE;&#x5185;&#x5FC3;&#x91CC;&#x5C31;&#x89C9;&#x5F97;&#x90A3;&#x79CD;&#x8BBA;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x8981;&#x5B8C;&#x5168;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x5FC3;&#x9759;&#x662F;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x8C26;&#x865A;&#x4E0D;&#x9A84;&#x8E81;&#x662F;&#x5B66;&#x4E60;&#x7684;&#x524D;&#x63D0;&#x3002;</p>
<hr>
<p>&#x1F9D9;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x4E60;&#xFF1F; &#x96BE;&#x9053;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x6280;&#x672F;&#x548C;&#x77E5;&#x8BC6;&#x8981;&#x8BA9;&#x6211;&#x4EEC;&#x53BB;&#x5B66;&#x4E60;&#x5417;&#xFF1F; &#x6211;&#x89C9;&#x5F97;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x67D0;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B83;&#x7684;&#x51FA;&#x73B0;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x67D0;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#xFF0C;&#x5C31;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x5B66;&#x4E60;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x60F3;&#x6309;&#x7167;&#x67D0;&#x67D0;<code>&#x7CFB;&#x7EDF;&#x4F53;&#x7CFB;</code>&#x628A;&#x6574;&#x4E2A;&#x4F53;&#x7CFB;&#x7684;&#x77E5;&#x8BC6;&#x5B66;&#x5B8C;&#xFF0C;&#x7136;&#x540E;&#x5230;&#x6700;&#x540E;&#x5404;&#x79CD;&#x575A;&#x6301;&#xFF0C;PUA&#x81EA;&#x5DF1;&#xFF0C;&#x52C9;&#x52C9;&#x5F3A;&#x5F3A;&#x5B66;&#x5B8C;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x672C;&#x575A;&#x6301;&#x4E0D;&#x4E0B;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;<code>&#x4E00;&#x8138;&#x61F5;&#x903C;</code>&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5F88;&#x591A;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x60F3;&#x7740;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x6000;&#x7740;&#x4E00;&#x79CD;&#x5FC3;&#x6001;&#xFF0C;&#x518D;&#x6B21;&#x91CD;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x62B1;&#x7740;<code>&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x7684;&#x5FC3;&#x6001;</code>&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x5C31;&#x66F4;&#x50CF;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x5168;&#x90E8;&#x77E5;&#x8BC6;&#x5B66;&#x4E60;&#x4E00;&#x904D;&#x540E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6839;&#x636E;&#x73B0;&#x5B9E;&#x95EE;&#x9898;&#x53BB;&#x53D1;&#x6325;&#x6211;&#x4EEC;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x5E76;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x539F;&#x56E0;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x5B66;&#x4E60;&#x4E00;&#x904D;&#x518D;&#x53BB;&#x8003;&#x8BD5;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x8BFB;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x6709;&#x8303;&#x56F4;&#xFF0C;&#x4F46;&#x662F;&#x6280;&#x672F;&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x6269;&#x5C55;&#x7684;&#xFF0C;&#x5168;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x5F80;&#x5F80;&#x4E5F;&#x662F;&#x5B66;&#x4E86;&#x5FD8;&#xFF0C;&#x5FD8;&#x4E86;&#x5B66;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x5BF9;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;&#x6216;&#x8005;&#x6280;&#x672F;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x65F6;&#x5019;<code>&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;</code>&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x7684;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x8DEF;&#x7EBF;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x5DF2;&#x7ECF;&#x4E0A;&#x624B;&#x4E86;&#xFF0C;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x518D;&#x53BB;&#x79C9;&#x6301;&#x8FD9;&#x79CD;&#x5B66;&#x4E60;&#x5FC3;&#x6001;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x7B80;&#x76F4;&#x5C31;&#x662F;&#x820D;&#x8FD1;&#x6C42;&#x8FDC;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x4E00;&#x4E2A;&#x611F;&#x89C9;&#x6B3A;&#x9A97;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x4E00;&#x79CD;&#x4F2A;&#x81EA;&#x4FE1;&#xFF0C;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x5F88;&#x96BE;&#x5B8C;&#x5168;&#x5438;&#x6536;&#x548C;&#x638C;&#x63E1;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x90FD;&#x662F;&#x76AE;&#x6BDB;&#xFF0C;&#x5F53;&#x6280;&#x672F;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x4E5F;&#x90FD;&#x767D;&#x8D39;&#x4E86;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x4F60;&#x5B66;&#x4E60;&#x6C38;&#x8FDC;&#x4E5F;&#x7528;&#x4E0D;&#x5230;&#xFF0C;&#x90A3;&#x4E5F;&#x7B49;&#x4E8E;&#x767D;&#x5B66;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;<code>&#x5F53;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x7406;&#x89E3;&#x8D8A;&#x6DF1;&#xFF0C;&#x66F4;&#x65B0;&#x5BF9;&#x4F60;&#x7684;&#x5F71;&#x54CD;&#x8D8A;&#x5C0F;</code>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7ED3;&#x5408;&#x5DE5;&#x4F5C;&#x4E2D;&#x6240;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x5B66;&#x7CBE;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x5B66;&#x900F;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x5F53;&#x4F60;&#x6709;&#x4E86;&#x6DF1;&#x5EA6;&#xFF0C;&#x5F80;&#x5F80;&#x4E5F;&#x5C31;&#x6709;&#x4E86;&#x5E7F;&#x5EA6;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x4E60;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x624D;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x5404;&#x79CD;&#x590D;&#x6742;&#x7684;&#x8BF4;&#x6CD5;&#x548C;&#x8BA4;&#x77E5;&#x6240;&#x5E72;&#x6270;&#xFF0C;&#x52AA;&#x529B;&#x8FBE;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<hr>
<p>&#x1F3AF;&#x5F53;&#x6211;&#x4EEC;&#x660E;&#x767D;&#x4E86;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x54EA;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x95EE;&#x9898;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x9020;&#x6210;&#x77E5;&#x8BC6;&#x4E5F;&#x5F88;&#x591A;&#xFF0C;&#x6280;&#x672F;&#x4E5F;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x9020;&#x6210;&#x9700;&#x8981;&#x5B66;&#x7684;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x54EA;&#x4E9B;&#x77E5;&#x8BC6;&#x54EA;&#xFF1F;&#x82F1;&#x8BED;&#xFF1F;&#x6570;&#x5B66;&#xFF1F;Java&#xFF1F; Python&#xFF1F;JavaScript&#xFF1F; TypeScript? &#x6211;&#x89C9;&#x5F97;&#x5728;&#x5B66;&#x4E60;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x7406;&#x89E3;&#x4E00;&#x53E5;&#x8BDD;<code>&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x9AD8;&#x4F30;&#x81EA;&#x5DF1;</code>&#x8FD9;&#x53E5;&#x8BDD;&#x6211;&#x4E5F;&#x662F;&#x5728;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x611F;&#x609F;&#x7684;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x5728;&#x8FDB;&#x884C;&#x6280;&#x672F;&#x70B9;&#x548C;&#x7406;&#x8BBA;&#x7684;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x7684;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x8DF5;&#x7684;&#x65F6;&#x5019;&#x5374;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#xFF0C;&#x6709;&#x7684;&#x6280;&#x672F;&#x5728;&#x611F;&#x5B98;&#x4E0A;&#x89C9;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x771F;&#x7684;&#x53BB;&#x7814;&#x7A76;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E00;&#x4E2A;&#x53CA;&#x5176;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x9AD8;&#x4F30;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5565;&#x90FD;&#x80FD;&#x5B66;&#x5B8C;&#xFF0C;&#x5565;&#x90FD;&#x80FD;&#x5B66;&#x597D;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x9AD8;&#x4F30;&#x4F1A;&#x5BFC;&#x81F4;&#x5728;&#x5B66;&#x4E60;&#x65F6;&#x5019;&#x7684;&#x632B;&#x8D25;&#x611F;&#xFF0C;&#x8FDB;&#x800C;&#x5BFC;&#x81F4;&#x5BF9;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x201C;&#x6050;&#x60E7;&#x201D;&#x201C;&#x538C;&#x6076;&#x201D;&#x7ED3;&#x679C;&#x672C;&#x6765;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x6280;&#x672F;&#x786C;&#x751F;&#x751F;&#x53D8;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x771F;&#x8001;&#x864E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x54EA;&#x4E9B;&#x54EA;&#xFF1F;</p>
<ol>
<li>&#x81EA;&#x5DF1;&#x4F1A;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x4E2D;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5B66;&#x4E0D;&#x884C;&#x7684;&#x3002;</li>
<li>&#x8981;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x80FD;&#x591F;&#x5B66;&#x4F1A;&#x548C;&#x638C;&#x63E1;&#x7684;&#x3002;</li>
<li>&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x548C;&#x5F53;&#x524D;&#x6709;&#x4FC3;&#x8FDB;&#x7684;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x5C55;&#x6709;&#x5229;&#x597D;&#x7684;&#x3002;</li>
</ol>
<p>&#x7ED3;&#x5408;&#x8FD9;&#x4E09;&#x70B9;&#x6211;&#x4EEC;&#x6765;&#x8BE6;&#x7EC6;&#x7684;&#x804A;&#x4E00;&#x804A;&#xFF0C;&#x4E3E;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x7528;&#x5230;&#x8FC7;<code>Vue</code>&#x4E5F;&#x7528;&#x5230;&#x8FC7;<code>React</code>&#x4F46;&#x662F;&#x6846;&#x67B6;&#x7684;&#x524D;&#x63D0;&#x662F;<code>JavaScript/TypeScript</code> <code>HTML</code> <code>CSS</code> <code>&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5316;</code> <code>Node</code>&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8981;&#x5B66;&#x7684;&#xFF0C;<code>Vue</code> <code>React</code>&#x662F;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x57FA;&#x672C;&#x4E0A;&#x53EA;&#x4F1A;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x90FD;&#x4F1A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x81EA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E24;&#x4E2A;&#x6846;&#x67B6;&#x7528;&#x7684;&#x90FD;&#x4E0D;&#x7CBE;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x5C31;&#x5E94;&#x8BE5;&#x628A;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x66F4;&#x9AD8;&#x7684;&#x5B66;&#x7CBE;&#xFF0C;&#x5B66;&#x900F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6682;&#x65F6;&#x4F1A;&#x7528;&#x5C31;&#x597D;&#xFF0C;&#x4EE5;&#x540E;&#x9047;&#x5230;&#x4E86;&#x518D;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x80FD;&#x6574;&#x4E2A;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x90FD;&#x7528;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x6BD4;&#x5982;&#x6211;&#xFF0C;&#x76EE;&#x524D;&#x5DE5;&#x4F5C;&#x4F7F;&#x7528;&#x7684;&#x662F;<code>Vue</code>&#x90A3;&#x6211;&#x5C31;&#x628A;<code>Vue</code>&#x5B66;&#x7CBE;&#x5B66;&#x900F;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x66F4;&#x5927;&#x7684;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x5176;&#x6B21;&#x8981;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x524D;&#x7AEF;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x603B;&#x6709;&#x53BB;&#x5B66;<code>Java</code> <code>Python</code> <code>C/C++</code>&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5185;&#x5FC3;&#x7684;&#x4E0D;&#x6EE1;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5185;&#x5FC3;&#x89C9;&#x5F97;&#x90A3;&#x4E9B;&#x6280;&#x672F;&#x5389;&#x5BB3;&#xFF0C;&#x524D;&#x7AEF;&#x201C;&#x4E0D;&#x884C;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x662F;&#x56E0;&#x4E3A;&#x5BF9;&#x81EA;&#x5DF1;&#x4E0D;&#x81EA;&#x4FE1;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x4E5F;&#x6709;&#x8FC7;&#x8FD9;&#x79CD;&#x5FC3;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x7814;&#x7A76;&#x8FC7;&#x53D1;&#x73B0;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x5E76;&#x4E0D;&#x662F;&#x50CF;&#x81EA;&#x5DF1;&#x60F3;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7684;&#x795E;&#xFF0C;&#x5E76;&#x4E14;&#x7406;&#x6027;&#x7684;&#x601D;&#x8003;&#x8FC7;&#x540E;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x524D;&#x7AEF;&#x5B66;&#x7684;&#x90FD;&#x4E0D;&#x7B97;&#x5F88;&#x597D;&#xFF0C;&#x820D;&#x8FD1;&#x6C42;&#x8FDC;&#x7684;&#x5B66;&#x4E60;&#x5176;&#x4ED6;&#x5185;&#x5BB9;&#x662F;&#x4E0D;&#x7406;&#x667A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x7684;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#x4EE5;&#x8BA9;&#x6211;&#x505A;&#x5230;&#x5168;&#x77E5;&#x5168;&#x4F1A;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x5C31;&#x5E94;&#x8BE5;&#x653E;&#x5F03;&#x90A3;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#x5B66;&#x4E60;&#xFF0C;&#x8F6C;&#x800C;&#x628A;&#x81EA;&#x5DF1;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x7684;&#x5B66;&#x597D;&#xFF0C;</p>
<p>&#x6700;&#x540E;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#xFF0C;&#x5F88;&#x591A;&#x524D;&#x7AEF;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x5207;&#x56FE;&#x4ED4;&#x201D;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x54EA;&#xFF1F;&#x56E0;&#x4E3A;&#x524D;&#x7AEF;&#x4E00;&#x822C;&#x90FD;&#x53EA;&#x5199;&#x524D;&#x7AEF;&#x9875;&#x9762;&#xFF0C;&#x5F88;&#x5C11;&#x6D89;&#x53CA;&#x6570;&#x636E;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x7AEF;&#x9886;&#x57DF; Node&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x5E76;&#x4E14;SSR&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;&#xFF0C;&#x5DE5;&#x7A0B;&#x5316;&#x90FD;&#x8981;&#x4F9D;&#x8D56;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x73B0;&#x5728;&#x7528;&#x4E0D;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x662F;&#x8FDB;&#x9636;&#x5FC5;&#x5907;&#xFF0C;&#x5BF9;&#x6211;&#x7684;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x6211;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5BF9;&#x6211;&#x7684;&#x7684;&#x53D1;&#x5C55;&#x6709;&#x5229;&#x597D;&#xFF0C;&#x518D;&#x6BD4;&#x5982;&#x82F1;&#x8BED;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x5728;&#x770B;&#x6587;&#x6863;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x8138;&#x61F5;&#x903C;&#xFF0C;&#x5168;&#x662F;&#x82F1;&#x6587;&#xFF0C;&#x5B8C;&#x5168;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x7FFB;&#x8BD1;&#x8F6F;&#x4EF6;&#x53C8;&#x7FFB;&#x8BD1;&#x7684;&#x72D7;&#x5C41;&#x4E0D;&#x662F;&#xFF0C;&#x82F1;&#x8BED;&#x7684;&#x5B66;&#x4E60;&#x4E0D;&#x8BBA;&#x662F;&#x5BF9;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x5BF9;&#x201C;&#x8FDB;&#x5165;&#x5916;&#x4F01;&#x201D;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x80FD;&#x529B;&#x8981;&#x6C42;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#x3002;</p>
<h2 id="&#x4E8C;-&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"><a href="#&#x4E8C;-&#x5B66;&#x4E60;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E8C;.&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"></a>&#x4E8C;.&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</h2><hr>
<p>&#x5728;&#x4E86;&#x89E3;&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;&#x89C2;&#x5FF5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x804A;&#x804A;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E60;&#x5BF9;&#x6211;&#x4EEC;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4E5F;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x6BD4;&#x8F83;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x4E2A;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x56DB;&#x6B65;&#x6CD5;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#x3002;</p>
<ol>
<li>&#x786E;&#x7ACB;&#x5B66;&#x4E60;&#x76EE;&#x6807;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x95E8;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x4EFB;&#x610F;&#x4E8B;&#x7269;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x4F60;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7B5B;&#x9009;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x4ECE;&#x591A;&#x4E2A;&#x89D2;&#x5EA6;&#x5F52;&#x7EB3;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x7528;&#x8F93;&#x51FA;&#x4EE3;&#x66FF;&#x8F93;&#x5165;&#xFF0C;&#x6A21;&#x62DF;&#x4E00;&#x4E2A;&#x6559;&#x5B66;&#x573A;&#x666F;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BDD;&#x8BA9;&#x5BF9;&#x65B9;&#x542C;&#x61C2;&#x3002;</li>
<li>&#x8FDB;&#x884C;&#x56DE;&#x987E;&#x548C;&#x53CD;&#x601D;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x6CA1;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#x6982;&#x5FF5;&#x9700;&#x8981;&#x7740;&#x91CD;&#x5B66;&#x4E60;&#xFF0C;&#x5982;&#x6709;&#x5FC5;&#x8981;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x7684;&#x8F93;&#x51FA;&#x4E00;&#x6B21;&#x3002;</li>
<li>&#x7B80;&#x5316;&#x77E5;&#x8BC6;&#x5E76;&#x5438;&#x6536;&#xFF0C;&#x8BA9;&#x77E5;&#x8BC6;&#x8BB2;&#x51FA;&#x6765;&#x66F4;&#x52A0;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x7B80;&#x6D01;&#x6709;&#x6548;&#x4E5F;&#x65B9;&#x4FBF;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x5185;&#x5316;&#x3002;</li>
</ol>
<p>&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x516C;&#x8BA4;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x521A;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6709;&#x4E9B;&#x4E0D;&#x9002;&#x5E94;&#xFF0C;&#x6BD5;&#x7ADF;&#x56FD;&#x5185;&#x5E94;&#x8BD5;&#x6559;&#x80B2;&#x66F4;&#x5F3A;&#x8C03;&#x8BB0;&#x5FC6;&#x548C;&#x56FA;&#x5B9A;&#x6A21;&#x5F0F;&#x7684;&#x591A;&#x4E00;&#x70B9;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x89D2;&#x5EA6;&#x4E0D;&#x8BA1;&#x5176;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4ECE;&#x5404;&#x4E2A;&#x89D2;&#x5EA6;&#x548C;&#x65B9;&#x5F0F;&#x53BB;&#x4E86;&#x89E3;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#x4E2D;&#x7684;&#x6A21;&#x62DF;&#x6559;&#x5B66;&#x73AF;&#x5883;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BDD;&#x8BA9;&#x5BF9;&#x65B9;&#x542C;&#x61C2;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8FD9;&#x79CD;&#x6761;&#x4EF6;&#x5F53;&#x7136;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x6761;&#x4EF6;&#xFF0C;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x5F55;&#x5236;&#x89C6;&#x9891;&#x4E5F;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E5F;&#x4EC5;&#x4F9B;&#x53C2;&#x8003;&#xFF0C;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x8FD8;&#x662F;&#x8981;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7075;&#x6D3B;&#x66F4;&#x6539;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x56DB;&#x6B65;&#x6CD5;&#xFF0C;&#x51FA;&#x5904;&#x5DF2;&#x7ECF;&#x65E0;&#x4ECE;&#x77E5;&#x6653;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#x3002;</p>
<ol>
<li>&#x542C;&#x61C2;/&#x770B;&#x61C2;</li>
<li>&#x8BB0;&#x4F4F;</li>
<li>&#x5B66;&#x4F1A;</li>
<li>&#x638C;&#x63E1;</li>
</ol>
<p>&#x5B83;&#x4E3B;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x5B66;&#x4E60;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x505C;&#x7559;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x5C31;&#x4E0D;&#x5F80;&#x4E0B;&#x8D70;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x672F;&#x90FD;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x7CBE;&#x719F;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x89C2;&#x5236;&#x5B9A;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x8BA1;&#x5212;&#x3002;</p>
<h2 id="&#x56DB;-&#x7406;&#x8BBA;&#x652F;&#x6301;"><a href="#&#x56DB;-&#x7406;&#x8BBA;&#x652F;&#x6301;" class="headerlink" title="&#x56DB;.&#x7406;&#x8BBA;&#x652F;&#x6301;"></a>&#x56DB;.&#x7406;&#x8BBA;&#x652F;&#x6301;</h2><hr>
<p>&#x1F47D;&#x867D;&#x7136;&#x5217;&#x4E3E;&#x4E86;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x8C01;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x79D1;&#x5B66;&#x7684;&#x54EA;&#xFF1F;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x7406;&#x652F;&#x6301;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x91D1;&#x5B57;&#x5854;&#x7406;&#x8BBA;&#xFF1A;&#x53EA;&#x6709;&#x6559;&#x6388;&#x7ED9;&#x4ED6;&#x4EBA;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x7684;&#x5B66;&#x4F1A;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x91D1;&#x5B57;&#x5854;&#x539F;&#x7406;&#x4E2D;&#xFF0C;&#x542C;&#x8BB2;&#x7684;&#x6548;&#x7387;&#x662F;&#x6700;&#x4F4E;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x6709;5%&#xFF0C;&#x542C;&#x8BB2;&#xFF0C;&#x9605;&#x8BFB;&#xFF0C;&#x58F0;&#x97F3;&#x56FE;&#x7247;&#xFF0C;&#x793A;&#x8303;&#x6F14;&#x793A;&#x7B49;&#x7B49;&#x90FD;&#x662F;&#x88AB;&#x52A8;&#x5B66;&#x4E60;&#xFF0C;&#x6548;&#x7387;&#x90FD;&#x6BD4;&#x8F83;&#x4F4E;&#x4E0B;&#xFF0C;&#x4E3B;&#x52A8;&#x5B66;&#x4E60;&#x7684;&#x7559;&#x5B58;&#x7387;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x8BA8;&#x8BBA;&#xFF0C;&#x5B9E;&#x8DF5;&#xFF0C;&#x6559;&#x6388;&#x7ED9;&#x4ED6;&#x4EBA;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x4E3B;&#x52A8;&#x5B66;&#x4E60;&#xFF0C;&#x5176;&#x4E2D;&#x6559;&#x6388;&#x7ED9;&#x4ED6;&#x4EBA;&#x7684;&#x7559;&#x5B58;&#x7387;&#x662F;&#x6700;&#x9AD8;&#x7684;&#x8FBE;&#x5230;&#x4E86;90%&#xFF0C;&#x8FD9;&#x548C;&#x8D39;&#x66FC;&#x5B66;&#x4E60;&#x6CD5;&#x4E2D;&#x7684;&#x6559;&#x6388;&#x7ED9;&#x4ED6;&#x4EBA;&#x5982;&#x51FA;&#x4E00;&#x8F99;&#x3002;</li>
</ol>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e14060dea3f195fecf5be38cdb221604b61308f07c343d0bcfb3ff1385c13920" alt></p>
<ol start="2">
<li>Effort Reinforces Learning&#xFF08;&#x52AA;&#x529B;&#x52A0;&#x5F3A;&#x5B66;&#x4E60;&#xFF09;&#xFF1A;&#x52AA;&#x529B;&#x52A0;&#x5F3A;&#x5B66;&#x4E60;&#x7B80;&#x5355;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x548C;&#x77E5;&#x8BC6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8017;&#x8D39;&#x81EA;&#x5DF1;&#x7684;&#x7CBE;&#x529B;&#x7684;&#x5B66;&#x4E60;&#x5F80;&#x5F80;&#x6548;&#x679C;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x8BBA;&#x6587;&#x7684;&#x51FA;&#x5904;&#xFF1A;<br><a href="/external_links/b00e6cef2383b69174b7b8418e51852e.html" target="blank" rel="noopener">www.jneurosci.org/content/42/&#x2026;</a></li>
</ol>
<h2 id="&#x516D;-&#x603B;&#x7ED3;"><a href="#&#x516D;-&#x603B;&#x7ED3;" class="headerlink" title="&#x516D;.&#x603B;&#x7ED3;"></a>&#x516D;.&#x603B;&#x7ED3;</h2><hr>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4ECE;&#x5B66;&#x4E60;&#x89C2;&#xFF0C;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x7406;&#x8BBA;&#x652F;&#x6301;&#xFF0C;&#x6765;&#x5206;&#x4EAB;&#x4E86;&#x6211;&#x5BF9;&#x5B66;&#x4E60;&#x7684;&#x7406;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x4E2A;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x501F;&#x9274;&#x7684;&#x540C;&#x65F6;&#x8FD8;&#x662F;&#x8981;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8981;&#x4EBA;&#x4E91;&#x4EA6;&#x4E91;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x4EAB;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5E2E;&#x5230;&#x548C;&#x6211;&#x66FE;&#x7ECF;&#x4E00;&#x6837;&#x8FF7;&#x832B;&#x7684;&#x4F60;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/7e42a4a0da1fb41ec6132bd1747d1087.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/前端/" rel="tag"># 前端</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7362309246555783207.html" rel="next" title="Spring Boot 自定义 Banner，让你的 Ban">
                <i class="fa fa-chevron-left"></i> Spring Boot 自定义 Banner，让你的 Ban
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7362382094360428556.html" rel="prev" title="GitHub介绍，GitHub如何订阅充值？">
                GitHub介绍，GitHub如何订阅充值？ <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#一-内容总览"><span class="nav-number">1.</span> <span class="nav-text">一.内容总览</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#二-聊聊学习观"><span class="nav-number">2.</span> <span class="nav-text">二.聊聊学习观</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#二-学习方法"><span class="nav-number">3.</span> <span class="nav-text">二.学习方法</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#四-理论支持"><span class="nav-number">4.</span> <span class="nav-text">四.理论支持</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#六-总结"><span class="nav-number">5.</span> <span class="nav-text">六.总结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
