<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="架构,设计,">





  <link rel="alternate" href="atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta name="description" content="&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x5E74;&amp;#x91CC;&amp;#xFF0C;&amp;#x6280;&amp;#x672F;&amp;#x754C;&amp;#x548C;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x65B9;&amp;#x6CD5;&amp;#x7ECF;&amp;#x5386;&amp;#x4E86;&amp;#x5267;&amp;#x70C8;&amp;#x7684;">
<meta name="keywords" content="架构,设计">
<meta property="og:type" content="article">
<meta property="og:title" content="具备什么样的技能才能成为架构师">
<meta property="og:url" content="https://dev.newban.cn/7362084722819874856.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:description" content="&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x5E74;&amp;#x91CC;&amp;#xFF0C;&amp;#x6280;&amp;#x672F;&amp;#x754C;&amp;#x548C;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x65B9;&amp;#x6CD5;&amp;#x7ECF;&amp;#x5386;&amp;#x4E86;&amp;#x5267;&amp;#x70C8;&amp;#x7684;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/10f31e111a0bd583f09f2fcfe1ed2e857c58d1a6c4a0a1478a8cb51c1d763bdf">
<meta property="og:updated_time" content="2024-04-28T03:44:05.962Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="具备什么样的技能才能成为架构师">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x5E74;&amp;#x91CC;&amp;#xFF0C;&amp;#x6280;&amp;#x672F;&amp;#x754C;&amp;#x548C;&amp;#x8F6F;&amp;#x4EF6;&amp;#x5F00;&amp;#x53D1;&amp;#x65B9;&amp;#x6CD5;&amp;#x7ECF;&amp;#x5386;&amp;#x4E86;&amp;#x5267;&amp;#x70C8;&amp;#x7684;">
<meta name="twitter:image" content="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/10f31e111a0bd583f09f2fcfe1ed2e857c58d1a6c4a0a1478a8cb51c1d763bdf">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/7362084722819874856.html">





  <title>具备什么样的技能才能成为架构师 | 开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">具备什么样的技能才能成为架构师</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-04-27T14:00:35+08:00">
                2024-04-27
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x4E8C;&#x5341;&#x5E74;&#x91CC;&#xFF0C;&#x6280;&#x672F;&#x754C;&#x548C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x7ECF;&#x5386;&#x4E86;&#x5267;&#x70C8;&#x7684;&#x53D8;&#x5316;&#x548C;&#x53D1;&#x5C55;&#x3002;&#x65B0;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#x548C;&#x5F00;&#x53D1;&#x5B9E;&#x8DF5;&#x7684;&#x8FDB;&#x6B65;&#x4F7F;&#x5F97;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x548C;&#x7075;&#x6D3B;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x6F14;&#x53D8;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x4F5C;&#x7528;&#x65E5;&#x76CA;&#x663E;&#x8457;&#xFF0C;&#x6210;&#x4E3A;&#x9879;&#x76EE;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x51B3;&#x7B56;&#x7684;&#x5236;&#x5B9A;&#x8005;&#xFF0C;&#x4E5F;&#x662F;&#x56E2;&#x961F;&#x4E4B;&#x95F4;&#x534F;&#x4F5C;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x786E;&#x4FDD;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x65E2;&#x80FD;&#x6EE1;&#x8DB3;&#x5F53;&#x524D;&#x9700;&#x6C42;&#xFF0C;&#x53C8;&#x5177;&#x5907;&#x957F;&#x8FDC;&#x7684;&#x89C6;&#x91CE;&#x3002;</p>
<p>&#x7279;&#x522B;&#x662F;&#x5728;&#x5F53;&#x4ECA;&#x5F3A;&#x8C03;&#x654F;&#x6377;&#x6027;&#x548C;&#x56E2;&#x961F;&#x81EA;&#x6CBB;&#x7684;&#x6587;&#x5316;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x8272;&#x5E76;&#x6CA1;&#x6709;&#x56E0;&#x4E3A;&#x654F;&#x6377;&#x5B9E;&#x8DF5;&#x7684;&#x63A8;&#x5E7F;&#x800C;&#x53D8;&#x5F97;&#x8FB9;&#x7F18;&#x5316;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x534F;&#x52A9;&#x56E2;&#x961F;&#x5FEB;&#x901F;&#x9002;&#x5E94;&#x53D8;&#x5316;&#x3001;&#x4FDD;&#x6301;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#x6E05;&#x6670;&#x548C;&#x524D;&#x77BB;&#x6027;&#x65B9;&#x9762;&#x626E;&#x6F14;&#x7740;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#x3002;&#x5728;&#x524D;&#x51E0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x8BE6;&#x7EC6;&#x63A2;&#x8BA8;&#x4E86;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x5728;&#x9002;&#x5E94;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x672C;&#x8282;&#x7684;&#x91CD;&#x70B9;&#x8F6C;&#x5411;&#x67B6;&#x6784;&#x5E08;&#x672C;&#x4EBA;&#xFF0C;&#x63A2;&#x8BA8;&#x4E86;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x6210;&#x529F;&#x67B6;&#x6784;&#x5E08;&#x6240;&#x9700;&#x7684;&#x5173;&#x952E;&#x7279;&#x8D28;&#x548C;&#x6280;&#x80FD;(&#x5982;&#x56FE;1&#x6240;&#x793A;)&#x3002;&#x5C3D;&#x7BA1;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x51FA;&#x8272;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x5E7F;&#x6CDB;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x80FD;&#xFF0C;&#x4F46;&#x57FA;&#x4E8E;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x5C06;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x51E0;&#x9879;&#x88AB;&#x5E7F;&#x6CDB;&#x8BA4;&#x4E3A;&#x6700;&#x4E3A;&#x5173;&#x952E;&#x7684;&#x6280;&#x80FD;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#x5E0C;&#x671B;&#x80FD;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x57F9;&#x517B;&#x8FD9;&#x4E9B;&#x80FD;&#x529B;&#x4EE5;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x6280;&#x672F;&#x9886;&#x57DF;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/10f31e111a0bd583f09f2fcfe1ed2e857c58d1a6c4a0a1478a8cb51c1d763bdf" alt="&#x56FE;1"></p>
<h3 id="1&#x3001;&#x7B80;&#x5316;&#x80FD;&#x529B;"><a href="#1&#x3001;&#x7B80;&#x5316;&#x80FD;&#x529B;" class="headerlink" title="1&#x3001;&#x7B80;&#x5316;&#x80FD;&#x529B;"></a>1&#x3001;&#x7B80;&#x5316;&#x80FD;&#x529B;</h3><p>&#x5927;&#x591A;&#x6570;&#x67B6;&#x6784;&#x56FE;&#x548C;&#x89C4;&#x8303;&#x90FD;&#x56E0;&#x8BBE;&#x8BA1;&#x800C;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x3002;&#x5EFA;&#x7B51;&#x5E08;&#x6709;&#x76EE;&#x7684;&#x5730;&#x901A;&#x8FC7;&#x8BA4;&#x4E3A;&#x590D;&#x6742;&#x6027;&#x6765;&#x5C55;&#x793A;&#x4ED6;&#x4EEC;&#x7684;&#x80FD;&#x529B;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E8B;&#x5B9E;&#x6070;&#x6070;&#x76F8;&#x53CD;&#x2014;&#x2014;&#x590D;&#x6742;&#x7684;&#x67B6;&#x6784;&#x65E0;&#x52A9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3002;&#x67B6;&#x6784;&#x5FC5;&#x987B;&#x9010;&#x6B65;&#x6784;&#x5EFA;&#xFF0C;&#x4EE5;&#x4FBF;&#x65B0;&#x63A5;&#x89E6;&#x95EE;&#x9898;&#x7A7A;&#x95F4;&#x7684;&#x4EBA;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x7406;&#x89E3;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x7EA7;&#x522B;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x7EA7;&#x522B; 0 &#x5F00;&#x59CB;&#x9010;&#x6B65;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;L0 &#x662F;&#x6846;&#x56FE;&#xFF0C;L1 &#x662F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x56FE;&#xFF0C;L2 &#x662F;&#x6280;&#x672F;&#x548C;&#x4F9B;&#x5E94;&#x5546;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x52A9;&#x4E8E;&#x89E3;&#x91CA;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x89E3;&#x4E3A;&#x6A21;&#x5757;&#x3002;&#x8BFB;&#x6216;&#x542C;&#x7684;&#x4EBA;&#x786E;&#x5B9E;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x67B6;&#x6784;&#x6784;&#x5EFA;&#x5C42;&#x5C42;&#x9012;&#x8FDB;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8BA8;&#x8BBA;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x6280;&#x80FD;&#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x80FD;&#x529B;&#x2014;&#x2014;&#x7B80;&#x5316;&#x590D;&#x6742;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x56FE;&#x548C;&#x89C4;&#x8303;&#x6587;&#x6863;&#x56E0;&#x4E3A;&#x8BD5;&#x56FE;&#x5C55;&#x73B0;&#x6DF1;&#x5965;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x800C;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x590D;&#x6742;&#x548C;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x4F3C;&#x4E4E;&#x662F;&#x6709;&#x610F;&#x4E3A;&#x4E4B;&#xFF0C;&#x4EE5;&#x663E;&#x793A;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x4E13;&#x4E1A;&#x80FD;&#x529B;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5E76;&#x4E0D;&#x5229;&#x4E8E;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x7406;&#x89E3;&#x3002;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x6210;&#x5458;&#x9010;&#x6B65;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x521A;&#x521A;&#x63A5;&#x89E6;&#x5230;&#x9879;&#x76EE;&#x7684;&#x65B0;&#x6210;&#x5458;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8FD9;&#x4E00;&#x6311;&#x6218;&#xFF0C;&#x6211;&#x91C7;&#x7EB3;&#x5E76;&#x63A8;&#x8350;&#x4E00;&#x79CD;&#x9010;&#x5C42;&#x9012;&#x8FDB;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6784;&#x5EFA;&#x548C;&#x89E3;&#x91CA;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4ECE;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x6982;&#x62EC;&#x7684;&#x89C6;&#x56FE;&#x5F00;&#x59CB;&#xFF0C;&#x5373;&#x7EA7;&#x522B;0&#xFF08;L0&#xFF09;&#xFF0C;&#x8FD9;&#x4E00;&#x7EA7;&#x522B;&#x901A;&#x5E38;&#x4EE5;&#x6846;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#xFF0C;&#x65E8;&#x5728;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x6982;&#x89C8;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7EA7;&#x522B;1&#xFF08;L1&#xFF09;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5316;&#x4E3A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x56FE;&#xFF0C;&#x5C55;&#x73B0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x952E;&#x7EC4;&#x4EF6;&#x53CA;&#x5176;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x7EA7;&#x522B;2&#xFF08;L2&#xFF09;&#x6DF1;&#x5165;&#x5230;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#x9009;&#x62E9;&#x548C;&#x4F9B;&#x5E94;&#x5546;&#x4EA7;&#x54C1;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4E86;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x5C42;&#x6B21;&#x5206;&#x660E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x5C06;&#x590D;&#x6742;&#x7684;&#x67B6;&#x6784;&#x95EE;&#x9898;&#x62C6;&#x89E3;&#x4E3A;&#x66F4;&#x5C0F;&#x3001;&#x66F4;&#x6613;&#x7BA1;&#x7406;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x4E14;&#x786E;&#x4FDD;&#x4E86;&#x4FE1;&#x606F;&#x7684;&#x63A5;&#x6536;&#x8005;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x9010;&#x5C42;&#x6DF1;&#x5165;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9010;&#x6B65;&#x5EFA;&#x7ACB;&#x5BF9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x7406;&#x89E3;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F3A;&#x8C03;&#x4E86;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x7B80;&#x5316;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#x6765;&#x5C55;&#x793A;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x6E05;&#x6670;&#x3001;&#x6709;&#x6761;&#x7406;&#x7684;&#x9012;&#x8FDB;&#xFF0C;&#x4F7F;&#x5F97;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x7B80;&#x5316;&#x548C;&#x53EF;&#x7406;&#x89E3;&#x3002;</p>
<h3 id="1-2&#x3001;&#x89C6;&#x89C9;&#x601D;&#x7EF4;"><a href="#1-2&#x3001;&#x89C6;&#x89C9;&#x601D;&#x7EF4;" class="headerlink" title="1.2&#x3001;&#x89C6;&#x89C9;&#x601D;&#x7EF4;"></a>1.2&#x3001;&#x89C6;&#x89C9;&#x601D;&#x7EF4;</h3><p>&#x5728;&#x6DF1;&#x5165;&#x8BA8;&#x8BBA;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x5907;&#x6280;&#x80FD;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5F3A;&#x8C03;&#x89C6;&#x89C9;&#x601D;&#x7EF4;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x67B6;&#x6784;&#x5E08;&#x5929;&#x751F;&#x503E;&#x5411;&#x4E8E;&#x5229;&#x7528;&#x89C6;&#x89C9;&#x624B;&#x6BB5;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#x548C;&#x60F3;&#x6CD5;&#x5171;&#x4EAB;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x638C;&#x63E1;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x56FE;&#x5F62;&#x6A21;&#x578B;&#x8868;&#x8FBE;&#x601D;&#x7EF4;&#x6210;&#x4E3A;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;&#x4E4B;&#x4E00;&#x3002;&#x4E3A;&#x4E86;&#x9AD8;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x89C6;&#x89C9;&#x5DE5;&#x5177;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x57F9;&#x517B;&#x51FA;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5C06;&#x590D;&#x6742;&#x6982;&#x5FF5;&#x76F4;&#x89C2;&#x5316;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x89C6;&#x89C9;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x4F53;&#x73B0;&#x5728;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x767D;&#x677F;&#x3001;&#x8BB0;&#x4E8B;&#x672C;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x7D27;&#x6025;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x8349;&#x7A3F;&#x7EB8;&#x4E0A;&#x753B;&#x51FA;&#x8349;&#x56FE;&#x7684;&#x4E60;&#x60EF;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x7ECF;&#x5386;&#x6070;&#x597D;&#x53CD;&#x6620;&#x4E86;&#x89C6;&#x89C9;&#x601D;&#x7EF4;&#x5728;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x53D1;&#x5C55;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x4ECE;&#x9752;&#x5C11;&#x5E74;&#x65F6;&#x671F;&#x5F00;&#x59CB;&#x7ED8;&#x5236;&#x7684;&#x4E03;&#x9F99;&#x73E0;&#x5361;&#x901A;&#xFF0C;&#x5230;&#x5728;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x5229;&#x7528;&#x89C6;&#x89C9;&#x7B14;&#x8BB0;&#x5E2E;&#x52A9;&#x8BB0;&#x5FC6;&#x8BFE;&#x7A0B;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ECF;&#x5386;&#x65E9;&#x671F;&#x5C31;&#x57F9;&#x517B;&#x4E86;&#x6211;&#x5BF9;&#x89C6;&#x89C9;&#x8868;&#x8FBE;&#x7684;&#x559C;&#x7231;&#x548C;&#x80FD;&#x529B;&#x3002;&#x5F53;&#x6211;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x8F6F;&#x4EF6;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x8FDB;&#x5165;&#x5DE5;&#x4E1A;&#x754C;&#x540E;&#xFF0C;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x8F6C;&#x5316;&#x4E3A;&#x4E86;&#x7528;&#x8349;&#x56FE;&#x6765;&#x6C9F;&#x901A;&#x590D;&#x6742;&#x7684;&#x8F6F;&#x4EF6;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x89C6;&#x89C9;&#x601D;&#x7EF4;&#x7684;&#x80FD;&#x529B;&#x5141;&#x8BB8;&#x67B6;&#x6784;&#x5E08;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x67B6;&#x6784;&#x53CB;&#x597D;&#x7684;&#x7B26;&#x53F7;&#x548C;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x4ECE;&#x57FA;&#x672C;&#x7684;&#x5757;&#x56FE;&#x3001;&#x6D41;&#x7A0B;&#x56FE;&#x5230;UML&#x548C;&#x975E;&#x6807;&#x51C6;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x56FE;&#x5F62;&#xFF0C;&#x4EE5;&#x6E05;&#x6670;&#x548C;&#x5F15;&#x4EBA;&#x5165;&#x80DC;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x8FBE;&#x590D;&#x6742;&#x7684;&#x67B6;&#x6784;&#x7406;&#x5FF5;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x4F7F;&#x6211;&#x80FD;&#x591F;&#x66F4;&#x6709;&#x6548;&#x5730;&#x4E0E;&#x540C;&#x4E8B;&#x548C;&#x793E;&#x533A;&#x6210;&#x5458;&#x6C9F;&#x901A;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x76F4;&#x89C2;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x67B6;&#x6784;&#x7684;&#x590D;&#x6742;&#x6027;&#x53D8;&#x5F97;&#x66F4;&#x6613;&#x4E8E;&#x7BA1;&#x7406;&#x548C;&#x7406;&#x89E3;&#x3002;&#x89C6;&#x89C9;&#x601D;&#x7EF4;&#x4E0D;&#x4EC5;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x4E2A;&#x4EBA;&#x6280;&#x80FD;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x662F;&#x63A8;&#x52A8;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#x548C;&#x521B;&#x65B0;&#x7684;&#x5F3A;&#x5927;&#x5DE5;&#x5177;&#x3002;</p>
<h3 id="1-3&#x3001;&#x6280;&#x672F;&#x7ED8;&#x56FE;"><a href="#1-3&#x3001;&#x6280;&#x672F;&#x7ED8;&#x56FE;" class="headerlink" title="1.3&#x3001;&#x6280;&#x672F;&#x7ED8;&#x56FE;"></a>1.3&#x3001;&#x6280;&#x672F;&#x7ED8;&#x56FE;</h3><p>&#x5728;&#x8BA8;&#x8BBA;&#x67B6;&#x6784;&#x5E08;&#x6240;&#x9700;&#x6280;&#x80FD;&#x7684;&#x65F6;&#xFF0C;&#x6280;&#x672F;&#x7ED8;&#x56FE;&#x80FD;&#x529B;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x501F;&#x52A9;&#x4E8E;&#x6280;&#x672F;&#x56FE;&#x8868;&#x6765;&#x5C55;&#x793A;&#x4ED6;&#x4EEC;&#x7684;&#x89C6;&#x89C9;&#x601D;&#x7EF4;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x56FE;&#x8868;&#x8FDC;&#x975E;&#x7B80;&#x5355;&#x7684;&#x7F8E;&#x672F;&#x4F5C;&#x54C1;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x6280;&#x672F;&#x4FE1;&#x606F;&#x7684;&#x89C6;&#x89C9;&#x4F20;&#x8FBE;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x4EEC;&#x9700;&#x8981;&#x4E0D;&#x4EC5;&#x5B66;&#x4F1A;&#x57FA;&#x672C;&#x7684;&#x6280;&#x672F;&#x5236;&#x56FE;&#x6280;&#x5DE7;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x638C;&#x63E1;&#x5982;&#x4F55;&#x7CBE;&#x786E;&#x7ED8;&#x5236;&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x3001;&#x6709;&#x6548;&#x5229;&#x7528;&#x56FE;&#x8868;&#x7684;&#x7A7A;&#x95F4;&#x5E03;&#x5C40;&#x4EE5;&#x53CA;&#x63D0;&#x9AD8;&#x56FE;&#x8868;&#x7684;&#x6574;&#x4F53;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6240;&#x7ED8;&#x5236;&#x56FE;&#x8868;&#x7684;&#x98CE;&#x683C;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x771F;&#x5B9E;&#x6027;&#xFF0C;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x914D;&#x8272;&#x65B9;&#x6848;&#x548C;&#x56FE;&#x6807;&#x5E93;&#x7684;&#x5A92;&#x4F53;&#x5DE5;&#x5177;&#x5305;&#x4E5F;&#x663E;&#x5F97;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4ECE;&#x4E2A;&#x4EBA;&#x7ECF;&#x5386;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x9AD8;&#x4E2D;&#x671F;&#x95F4;&#x5C31;&#x5DF2;&#x7ECF;&#x63A5;&#x89E6;&#x5E76;&#x4F7F;&#x7528;&#x6D41;&#x7A0B;&#x56FE;&#x6765;&#x63CF;&#x8FF0;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x65E9;&#x671F;&#x63A5;&#x89E6;&#x6280;&#x672F;&#x7ED8;&#x56FE;&#x7684;&#x7ECF;&#x5386;&#x4E4B;&#x4E00;&#x3002;&#x968F;&#x7740;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x6280;&#x672F;&#x7ED8;&#x56FE;&#x6210;&#x4E86;&#x6211;&#x8868;&#x8FBE;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x7684;&#x5173;&#x952E;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x7684;&#x540C;&#x4E8B;&#x4EEC;&#x7ECF;&#x5E38;&#x5BF9;&#x6211;&#x5236;&#x4F5C;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x56FE;&#x8868;&#x8868;&#x793A;&#x597D;&#x5947;&#xFF0C;&#x8BE2;&#x95EE;&#x6211;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x60F3;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;&#x771F;&#x6B63;&#x4F7F;&#x56FE;&#x8868;&#x7A81;&#x51FA;&#x7684;&#x4E0D;&#x4EC5;&#x662F;&#x5DE5;&#x5177;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x66F4;&#x591A;&#x662F;&#x80CC;&#x540E;&#x7684;&#x601D;&#x8003;&#x548C;&#x7ED8;&#x56FE;&#x6A21;&#x5F0F;&#x3002;&#x6211;&#x957F;&#x671F;&#x4F7F;&#x7528;&#x7684;processon&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x6280;&#x672F;&#x7ED8;&#x56FE;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x5176;&#x6613;&#x7528;&#x6027;&#x548C;&#x9AD8;&#x6548;&#x6027;&#x8D62;&#x5F97;&#x4E86;&#x6211;&#x7684;&#x9752;&#x7750;&#x3002;</p>
<p>&#x6280;&#x672F;&#x7ED8;&#x56FE;&#x6280;&#x80FD;&#x7684;&#x638C;&#x63E1;&#x4F7F;&#x67B6;&#x6784;&#x5E08;&#x80FD;&#x591F;&#x5C06;&#x590D;&#x6742;&#x7684;&#x6280;&#x672F;&#x6982;&#x5FF5;&#x4EE5;&#x4E00;&#x79CD;&#x6E05;&#x6670;&#x4E14;&#x76F4;&#x89C2;&#x7684;&#x65B9;&#x5F0F;&#x5448;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x65E2;&#x4FDD;&#x8BC1;&#x4E86;&#x4FE1;&#x606F;&#x7684;&#x4F20;&#x8FBE;&#x65E2;&#x6709;&#x903B;&#x8F91;&#x6027;&#x53C8;&#x6709;&#x6761;&#x7406;&#xFF0C;&#x53C8;&#x786E;&#x4FDD;&#x4E86;&#x4E0D;&#x540C;&#x80CC;&#x666F;&#x7684;&#x8BFB;&#x8005;&#x90FD;&#x80FD;&#x8F7B;&#x677E;&#x7406;&#x89E3;&#x548C;&#x8DDF;&#x8FDB;&#x3002;&#x8FD9;&#x4E00;&#x80FD;&#x529B;&#x5BF9;&#x4E8E;&#x5728;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x4FC3;&#x8FDB;&#x6709;&#x6548;&#x6C9F;&#x901A;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x5916;&#x90E8;&#x5229;&#x76CA;&#x76F8;&#x5173;&#x8005;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5B83;&#x8BA9;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x7684;&#x8BA8;&#x8BBA;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x3001;&#x660E;&#x786E;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x5347;&#x4E86;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x548C;&#x6210;&#x679C;&#x7684;&#x8D28;&#x91CF;&#x3002;</p>
<h3 id="1-4&#x3001;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;"><a href="#1-4&#x3001;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;" class="headerlink" title="1.4&#x3001;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;"></a>1.4&#x3001;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;</h3><p>&#x6211;&#x4EEC;&#x76F4;&#x5954;&#x4E3B;&#x9898;&#xFF1A;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x89E3;&#x51B3;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4E3A;&#x4E86;&#x6709;&#x6548;&#x5E94;&#x5BF9;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x88C5;&#x5907;&#x81EA;&#x5DF1;&#x4EE5;&#x4E00;&#x79CD;&#x5173;&#x952E;&#x7684;&#x80FD;&#x529B;&#x2014;&#x2014;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;&#x3002;&#x8FD9;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x8981;&#x6C42;&#x67B6;&#x6784;&#x5E08;&#x5177;&#x5907;&#x4E00;&#x4E2A;&#x53CC;&#x91CD;&#x89C6;&#x89D2;&#xFF1A;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x80FD;&#x529B;&#x4ECE;&#x5B8F;&#x89C2;&#x4E0A;&#x628A;&#x63E1;&#x548C;&#x7406;&#x89E3;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x529F;&#x80FD;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD8;&#x8981;&#x80FD;&#x591F;&#x6DF1;&#x5165;&#x81F3;&#x7CFB;&#x7EDF;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6784;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x6D1E;&#x5BDF;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x7EC6;&#x8282;&#x548C;&#x4F5C;&#x7528;&#x3002;&#x7B80;&#x8A00;&#x4E4B;&#xFF0C;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;&#x4E0D;&#x4EC5;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#x5728;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x53CA;&#x76EE;&#x6807;&#x63D0;&#x4F9B;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x5728;&#x4FDD;&#x6301;&#x5BF9;&#x5927;&#x5C40;&#x7684;&#x628A;&#x63E1;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7CBE;&#x7EC6;&#x7BA1;&#x7406;&#x7EC6;&#x8282;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5C06;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x8272;&#x4E0E;&#x5E2E;&#x52A9;&#x516C;&#x53F8;&#x63D0;&#x5347;&#x4E1A;&#x52A1;&#x6548;&#x7387;&#x53CA;&#x964D;&#x4F4E;&#x8FD0;&#x8425;&#x6210;&#x672C;&#x7684;&#x76EE;&#x6807;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x6211;&#x6DF1;&#x523B;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x89C6;&#x4F01;&#x4E1A;&#x4E3A;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x81EA;&#x9002;&#x5E94;&#x7CFB;&#x7EDF;&#xFF08;CAS&#xFF09;&#xFF0C;&#x8D85;&#x8D8A;&#x4E86;&#x6211;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x4F20;&#x7EDF;&#x7406;&#x89E3;&#xFF0C;&#x8BA9;&#x6211;&#x4EE5;&#x4E00;&#x79CD;&#x66F4;&#x5168;&#x9762;&#x3001;&#x66F4;&#x7EFC;&#x5408;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x5BA1;&#x89C6;&#x548C;&#x6784;&#x601D;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E0D;&#x4EC5;&#x52A0;&#x6DF1;&#x4E86;&#x6211;&#x5BF9;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x548C;&#x9700;&#x6C42;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x800C;&#x4E14;&#x4FC3;&#x8FDB;&#x4E86;&#x6211;&#x4E0E;&#x540C;&#x4E8B;&#x4EEC;&#x7684;&#x7D27;&#x5BC6;&#x5408;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5171;&#x540C;&#x8BBE;&#x8BA1;&#x51FA;&#x7684;&#x67B6;&#x6784;&#x65B9;&#x6848;&#xFF0C;&#x65E8;&#x5728;&#x670D;&#x52A1;&#x4E1A;&#x52A1;&#x76EE;&#x6807;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x63D0;&#x5347;&#x8FD0;&#x8425;&#x6548;&#x7387;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x516C;&#x53F8;&#x521B;&#x9020;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x601D;&#x7EF4;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x8BBE;&#x8BA1;&#x9AD8;&#x6548;&#x3001;&#x6709;&#x6548;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x57FA;&#x77F3;&#x3002;&#x5B83;&#x4E0D;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x6280;&#x80FD;&#xFF0C;&#x66F4;&#x662F;&#x4E00;&#x4E2A;&#x8DE8;&#x5B66;&#x79D1;&#x3001;&#x8DE8;&#x90E8;&#x95E8;&#x5408;&#x4F5C;&#x3001;&#x4F18;&#x5316;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x5F3A;&#x5927;&#x5DE5;&#x5177;&#x3002;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x5730;&#x57F9;&#x517B;&#x548C;&#x5E94;&#x7528;&#x8FD9;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x80FD;&#x591F;&#x4E3A;&#x4F01;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x8D21;&#x732E;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5E26;&#x6765;&#x6301;&#x7EED;&#x7684;&#x3001;&#x957F;&#x8FDC;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<h3 id="1-5&#x3001;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;"><a href="#1-5&#x3001;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;" class="headerlink" title="1.5&#x3001;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;"></a>1.5&#x3001;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;</h3><p>&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x804C;&#x8D23;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x65BD;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x5177;&#x5907;&#x654F;&#x9510;&#x7684;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;&#x529B;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x5BC6;&#x5207;&#x5173;&#x6CE8;&#x884C;&#x4E1A;&#x4E2D;&#x7684;&#x6700;&#x65B0;&#x52A8;&#x6001;&#x2014;&#x2014;&#x5305;&#x62EC;&#x6280;&#x672F;&#x7684;&#x5FEB;&#x901F;&#x8FDB;&#x6B65;&#x3001;&#x65B0;&#x6A21;&#x5F0F;&#x7684;&#x51FA;&#x73B0;&#x4EE5;&#x53CA;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x91C7;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x4F7F;&#x4ED6;&#x4EEC;&#x5E94;&#x7528;&#x6700;&#x524D;&#x6CBF;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6784;&#x5EFA;&#x7CBE;&#x786E;&#x800C;&#x9AD8;&#x6548;&#x7684;&#x67B6;&#x6784;&#x89C4;&#x5212;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x8FC5;&#x901F;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x7740;&#x773C;&#x672A;&#x6765;&#xFF0C;&#x5F15;&#x9886;&#x6F6E;&#x6D41;&#x3002;</p>
<p>&#x79D1;&#x6280;&#x884C;&#x4E1A;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x7ED9;&#x67B6;&#x6784;&#x5E08;&#x5E26;&#x6765;&#x4E86;&#x4E0D;&#x5C0F;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x8981;&#x7D27;&#x8DDF;&#x8FD9;&#x6837;&#x7684;&#x53D1;&#x5C55;&#x6B65;&#x4F10;&#xFF0C;&#x9700;&#x8981;&#x6301;&#x7EED;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x9002;&#x5E94;&#x3002;&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x91C7;&#x53D6;&#x4E86;&#x591A;&#x79CD;&#x7B56;&#x7565;&#x6765;&#x4FDD;&#x6301;&#x4E0E;&#x884C;&#x4E1A;&#x8FDB;&#x6B65;&#x7684;&#x6B65;&#x8C03;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x5728;&#x6398;&#x91D1;&#x3001;CSDN&#x3001;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x3001;GitHub&#x4EE5;&#x53CA;&#x77E5;&#x4E4E;&#x7B49;&#x5E73;&#x53F0;&#x4E0A;&#x5173;&#x6CE8;&#x90A3;&#x4E9B;&#x5728;&#x884C;&#x4E1A;&#x4E2D;&#x5177;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x89C1;&#x89E3;&#x548C;&#x5206;&#x4EAB;&#x5F80;&#x5F80;&#x662F;&#x6D1E;&#x5BDF;&#x884C;&#x4E1A;&#x8D8B;&#x52BF;&#x7684;&#x7A97;&#x53E3;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x8BA2;&#x9605;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6280;&#x672F;&#x65B0;&#x95FB;&#x8D44;&#x8BAF;&#xFF0C;&#x5E76;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x7684;&#x6280;&#x672F;&#x8BBA;&#x575B;&#xFF0C;&#x53C2;&#x52A0;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x6D3B;&#x52A8;&#xFF0C;&#x89C2;&#x770B;&#x6700;&#x65B0;&#x7684;&#x6559;&#x5B66;&#x89C6;&#x9891;&#x3002;&#x6211;&#x8FD8;&#x5E7F;&#x6CDB;&#x9605;&#x8BFB;&#x4E66;&#x7C4D;&#x548C;&#x6587;&#x7AE0;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x7406;&#x89E3;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x6211;&#x7279;&#x522B;&#x91CD;&#x89C6;&#x7684;&#x662F;&#x6559;&#x5B66;&#x7684;&#x529B;&#x91CF;&#x2014;&#x2014;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x6027;&#x5730;&#x6559;&#x6388;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x9886;&#x57DF;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x4E0D;&#x4EC5;&#x52A0;&#x6DF1;&#x4E86;&#x6211;&#x5BF9;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4E3A;&#x6280;&#x672F;&#x793E;&#x533A;&#x505A;&#x51FA;&#x4E86;&#x8D21;&#x732E;&#x3002;</p>
<p>&#x5E02;&#x573A;&#x6D1E;&#x5BDF;&#x529B;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x800C;&#x8A00;&#xFF0C;&#x662F;&#x4E00;&#x9879;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x6280;&#x80FD;&#x3002;&#x5B83;&#x8981;&#x6C42;&#x67B6;&#x6784;&#x5E08;&#x4E0D;&#x505C;&#x5730;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x5E93;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x8BBE;&#x8BA1;&#x7684;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x65E2;&#x80FD;&#x6EE1;&#x8DB3;&#x5F53;&#x524D;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x53C8;&#x80FD;&#x9884;&#x89C1;&#x672A;&#x6765;&#x7684;&#x6311;&#x6218;&#x5E76;&#x4E3A;&#x4E4B;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;&#x901A;&#x8FC7;&#x5229;&#x7528;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#x8D44;&#x6E90;&#x548C;&#x6E20;&#x9053;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x5FEB;&#x901F;&#x53D8;&#x5316;&#x7684;&#x79D1;&#x6280;&#x73AF;&#x5883;&#x4E2D;&#x4FDD;&#x6301;&#x9886;&#x5148;&#x5730;&#x4F4D;&#x3002;</p>
<h3 id="1-6&#x3001;&#x6C9F;&#x901A;&#x80FD;&#x529B;"><a href="#1-6&#x3001;&#x6C9F;&#x901A;&#x80FD;&#x529B;" class="headerlink" title="1.6&#x3001;&#x6C9F;&#x901A;&#x80FD;&#x529B;"></a>1.6&#x3001;&#x6C9F;&#x901A;&#x80FD;&#x529B;</h3><p>&#x67B6;&#x6784;&#x5E08;&#x5728;&#x4E1A;&#x52A1;&#x548C;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x626E;&#x6F14;&#x7684;&#x72EC;&#x7279;&#x89D2;&#x8272;&#x2014;&#x2014;&#x4ED6;&#x4EEC;&#x662F;&#x8FDE;&#x63A5;&#x8FD9;&#x4E24;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x6865;&#x6881;&#x3002;&#x501F;&#x7528;&#x524D;&#x65B0;&#x52A0;&#x5761;&#x667A;&#x80FD;&#x56FD;&#x5BB6;&#x7814;&#x7A76;&#x5458;Gregor Hohpe&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x5927;&#x53A6;&#x7684;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7535;&#x68AF;&#x8FDE;&#x63A5;&#x9876;&#x5C42;&#x51B3;&#x7B56;&#x8005;&#x548C;&#x5730;&#x4E0B;&#x673A;&#x623F;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#xFF0C;&#x786E;&#x4FDD;&#x4FE1;&#x606F;&#x7684;&#x81EA;&#x7531;&#x6D41;&#x901A;&#x548C;&#x7406;&#x89E3;&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x67B6;&#x6784;&#x5E08;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD8;&#x8981;&#x80FD;&#x591F;&#x4EE5;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x7684;&#x65B9;&#x5F0F;&#x5411;&#x975E;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x3002;&#x6709;&#x6548;&#x6C9F;&#x901A;&#x7684;&#x65B9;&#x5F0F;&#x591A;&#x6837;&#xFF0C;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x53E3;&#x5934;&#x4EA4;&#x6D41;&#x3001;&#x4E66;&#x9762;&#x6587;&#x6863;&#x4EE5;&#x53CA;&#x89C6;&#x89C9;&#x5C55;&#x793A;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5728;&#x67B6;&#x6784;&#x9886;&#x57DF;&#x8FD1;&#x4E8C;&#x5341;&#x5E74;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#xFF0C;&#x6211;&#x6DF1;&#x523B;&#x4F53;&#x4F1A;&#x5230;&#x6C9F;&#x901A;&#x6280;&#x80FD;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x5B83;&#x4F7F;&#x6211;&#x9010;&#x6E10;&#x6210;&#x4E3A;&#x4E00;&#x4F4D;&#x80FD;&#x591F;&#x6709;&#x6548;&#x4F20;&#x8FBE;&#x6280;&#x672F;&#x7406;&#x5FF5;&#x7684;&#x6280;&#x672F;&#x4F20;&#x64AD;&#x8005;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6307;&#x5BFC;&#x56E2;&#x961F;&#x6210;&#x5458;&#x3001;&#x53C2;&#x4E0E;&#x5E02;&#x573A;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x62C5;&#x4EFB;&#x9762;&#x5411;&#x5BA2;&#x6237;&#x7684;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x67B6;&#x6784;&#x5E08;&#x548C;&#x4E1A;&#x52A1;&#x5206;&#x6790;&#x5E08;&#x7B49;&#x89D2;&#x8272;&#x4E2D;&#xFF0C;&#x6211;&#x90FD;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x9524;&#x70BC;&#x81EA;&#x5DF1;&#x7684;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x4E9B;&#x7ECF;&#x5386;&#x4E0D;&#x4EC5;&#x52A0;&#x6DF1;&#x4E86;&#x6211;&#x7684;&#x6280;&#x672F;&#x7406;&#x89E3;&#xFF0C;&#x4E5F;&#x63D0;&#x5347;&#x4E86;&#x6211;&#x4E0E;&#x56E2;&#x961F;&#x6210;&#x5458;&#x3001;&#x5BA2;&#x6237;&#x53CA;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x4E4B;&#x95F4;&#x7684;&#x6C9F;&#x901A;&#x6548;&#x7387;&#xFF0C;&#x4FC3;&#x8FDB;&#x4E86;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x7684;&#x7406;&#x89E3;&#x548C;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x800C;&#x8A00;&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x4E00;&#x9879;&#x57FA;&#x672C;&#x6280;&#x80FD;&#xFF0C;&#x66F4;&#x662F;&#x5176;&#x6210;&#x529F;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x3002;&#x901A;&#x8FC7;&#x6709;&#x6548;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x548C;&#x6280;&#x672F;&#x5B9E;&#x65BD;&#x4E4B;&#x95F4;&#x7684;&#x987A;&#x7545;&#x5BF9;&#x63A5;&#xFF0C;&#x4FC3;&#x8FDB;&#x9879;&#x76EE;&#x7684;&#x987A;&#x5229;&#x8FDB;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x5B66;&#x4E60;&#x548C;&#x63D0;&#x9AD8;&#x6C9F;&#x901A;&#x6280;&#x80FD;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4F4D;&#x67B6;&#x6784;&#x5E08;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x4E00;&#x9879;&#x6301;&#x7EED;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x4FC3;&#x8FDB;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x3001;&#x63A8;&#x52A8;&#x9879;&#x76EE;&#x6210;&#x529F;&#x65B9;&#x9762;&#x53D1;&#x6325;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="1-7&#x3001;&#x7F16;&#x7A0B;&#x80FD;&#x529B;"><a href="#1-7&#x3001;&#x7F16;&#x7A0B;&#x80FD;&#x529B;" class="headerlink" title="1.7&#x3001;&#x7F16;&#x7A0B;&#x80FD;&#x529B;"></a>1.7&#x3001;&#x7F16;&#x7A0B;&#x80FD;&#x529B;</h3><p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6E05;&#x6670;&#x5730;&#x8BA4;&#x8BC6;&#x5230;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x56FA;&#x7136;&#x5BF9;&#x67B6;&#x6784;&#x5E08;&#x6765;&#x8BF4;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x4E13;&#x6CE8;&#x4E8E;&#x6C9F;&#x901A;&#x800C;&#x5FFD;&#x89C6;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x8272;&#x5C31;&#x53EF;&#x80FD;&#x6CA6;&#x4E3A;&#x4EC5;&#x5B58;&#x5728;&#x4E8E;&#x7406;&#x8BBA;&#x6216;&#x6F14;&#x793A;&#x6587;&#x7A3F;&#x4E2D;&#x7684;&#x201C;PPT&#x67B6;&#x6784;&#x5E08;&#x201D;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x6295;&#x8EAB;&#x4E8E;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x7684;&#x5177;&#x4F53;&#x7EC6;&#x8282;&#x4E4B;&#x4E2D;&#xFF0C;&#x4EB2;&#x81EA;&#x53C2;&#x4E0E;&#x5230;&#x65E5;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x91CC;&#x3002;&#x501F;&#x52A9;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x548C;&#x81EA;&#x7EC4;&#x7EC7;&#x56E2;&#x961F;&#x7684;&#x73B0;&#x4EE3;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x53EF;&#x4EE5;&#x4E0E;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7D27;&#x5BC6;&#x5408;&#x4F5C;&#xFF0C;&#x76F4;&#x63A5;&#x53C2;&#x4E0E;&#x5230;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x7684;&#x529B;&#x91CF;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x67B6;&#x6784;&#x5E08;&#x9700;&#x8981;&#x6709;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD8;&#x610F;&#x5473;&#x7740;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x52A8;&#x624B;&#x7F16;&#x7801;&#xFF0C;&#x76F4;&#x63A5;&#x9762;&#x5BF9;&#x5404;&#x79CD;&#x6280;&#x672F;&#x914D;&#x7F6E;&#x6311;&#x6218;&#x3002;</p>
<p>&#x4EE5;&#x6211;&#x7684;&#x7ECF;&#x5386;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x6DF1;&#x5207;&#x5730;&#x7406;&#x89E3;&#x5230;&#x7F16;&#x7801;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x89D2;&#x8272;&#x7684;&#x6781;&#x7AEF;&#x91CD;&#x8981;&#x6027;&#x3002;&#x5728;&#x6211;&#x957F;&#x8FBE;&#x5341;&#x51E0;&#x5E74;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#xFF0C;&#x6211;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x4E86;&#x4F17;&#x591A;&#x7F16;&#x7801;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x56FD;&#x5185;&#x67D0;&#x9886;&#x5148;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x7684;&#x9996;&#x4E2A;&#x667A;&#x80FD;&#x5BA2;&#x670D;&#x548C;&#x667A;&#x80FD;&#x5916;&#x547C;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x4E00;&#x5BB6;&#x4E3B;&#x4E1A;&#x7535;&#x89C6;&#x4F01;&#x4E1A;&#x7684;&#x667A;&#x80FD;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x5EFA;&#x8BBE;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5316;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x7684;&#x521B;&#x5EFA;&#x7B49;&#x3002;&#x5373;&#x4FBF;&#x540E;&#x6765;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x89D2;&#x8272;&#x66F4;&#x591A;&#x5730;&#x8F6C;&#x5411;&#x4E86;&#x4F5C;&#x4E3A;&#x5BF9;&#x5916;&#x7684;&#x6280;&#x672F;&#x987E;&#x95EE;&#xFF0C;&#x6211;&#x4ECD;&#x672A;&#x653E;&#x5F03;&#x7F16;&#x7801;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x901A;&#x8FC7;&#x4E3A;&#x4EA7;&#x54C1;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x793A;&#x4F8B;&#x3001;&#x6269;&#x5C55;&#x70B9;&#x4EE5;&#x53CA;&#x5F00;&#x53D1;&#x6F14;&#x793A;&#x4E2D;&#x6240;&#x9700;&#x7684;&#x7528;&#x4F8B;&#xFF0C;&#x7EE7;&#x7EED;&#x4E3A;&#x9879;&#x76EE;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x529B;&#x91CF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x5229;&#x7528;&#x665A;&#x95F4;&#x65F6;&#x95F4;&#x62C5;&#x4EFB;&#x6280;&#x672F;&#x8BB2;&#x5E08;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EE5;&#x6B64;&#x5B8C;&#x6210;&#x7F16;&#x7801;&#x4EFB;&#x52A1;&#xFF0C;&#x66F4;&#x5411;&#x90A3;&#x4E9B;&#x6709;&#x5FD7;&#x4E8E;&#x6210;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x975E;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x4F20;&#x6388;&#x7F16;&#x7801;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x800C;&#x8A00;&#xFF0C;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x4E0D;&#x4EC5;&#x662F;&#x4E00;&#x9879;&#x5FC5;&#x5907;&#x6280;&#x80FD;&#xFF0C;&#x66F4;&#x662F;&#x4ED6;&#x4EEC;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x67B6;&#x6784;&#x5E08;&#x6DF1;&#x5165;&#x5230;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x65BD;&#x5C42;&#x9762;&#xFF0C;&#x4EB2;&#x81EA;&#x53C2;&#x4E0E;&#x5230;&#x7F16;&#x7801;&#x548C;&#x6280;&#x672F;&#x914D;&#x7F6E;&#x4E2D;&#x53BB;&#x3002;&#x8FD9;&#x79CD;&#x5B9E;&#x9645;&#x53C2;&#x4E0E;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x6240;&#x8BBE;&#x8BA1;&#x7684;&#x67B6;&#x6784;&#x5F97;&#x5230;&#x6709;&#x6548;&#x5B9E;&#x65BD;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x591F;&#x4FC3;&#x8FDB;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#x548C;&#x5B9E;&#x6218;&#x7ECF;&#x9A8C;&#x7684;&#x63D0;&#x5347;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x5730;&#x7406;&#x89E3;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x9700;&#x6C42;&#x548C;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x8FDB;&#x800C;&#x8BBE;&#x8BA1;&#x51FA;&#x66F4;&#x52A0;&#x7B26;&#x5408;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x5960;&#x5B9A;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<h2 id="2&#x3001;&#x603B;&#x7ED3;"><a href="#2&#x3001;&#x603B;&#x7ED3;" class="headerlink" title="2&#x3001;&#x603B;&#x7ED3;"></a>2&#x3001;&#x603B;&#x7ED3;</h2><p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x805A;&#x7126;&#x4E8E;&#x5927;&#x578B;&#x9879;&#x76EE;&#x6216;&#x4EA7;&#x54C1;&#x91CC;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x89D2;&#x8272;&#xFF0C;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x901A;&#x5E38;&#x9700;&#x6C42;&#x660E;&#x786E;&#xFF0C;&#x591A;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x7B26;&#x5408;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x56E2;&#x961F;&#x90FD;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x89D2;&#x8272;&#x5206;&#x5DE5;&#x3002;&#x7279;&#x522B;&#x662F;&#x5728;&#x521B;&#x4E1A;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x60C5;&#x51B5;&#x5F80;&#x5F80;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x5BF9;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x7D27;&#x8FEB;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x786E;&#x4FDD;&#x9879;&#x76EE;&#x7684;&#x751F;&#x5B58;&#x548C;&#x53D1;&#x5C55;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ED6;&#x4EEC;&#x91C7;&#x7EB3;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3001;&#x5FEB;&#x901F;&#x7684;&#x5F00;&#x53D1;&#x54F2;&#x5B66;&#x2014;&#x2014;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F3A;&#x8C03;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x3001;&#x7075;&#x6D3B;&#x8BD5;&#x9519;&#xFF0C;37signals&#x51FA;&#x7248;&#x7684;&#x300A;Getting Real&#x300B;&#x4E00;&#x4E66;&#x4FBF;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x7ECF;&#x5178;&#x4E4B;&#x4F5C;&#x3002;&#x5B83;&#x7279;&#x522B;&#x9002;&#x5408;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x4F9D;&#x8D56;&#x590D;&#x6742;&#x5E95;&#x5C42;&#x67B6;&#x6784;&#x3001;&#x529F;&#x80FD;&#x8F83;&#x4E3A;&#x7B80;&#x5355;&#x3001;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x5F00;&#x53D1;&#x539F;&#x578B;&#x5E76;&#x901A;&#x8FC7;&#x8FDE;&#x7EED;&#x5C0F;&#x8FED;&#x4EE3;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5982;Web&#x5E94;&#x7528;&#x548C;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x8FDB;&#x4E00;&#x6B65;&#x8BB2;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5E76;&#x975E;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x552F;&#x4E00;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6210;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#x8981;&#x6C42;&#x4F60;&#x5728;&#x6280;&#x672F;&#x7684;&#x5E7F;&#x5EA6;&#x4E0E;&#x6DF1;&#x5EA6;&#x4E0A;&#x90FD;&#x6709;&#x6240;&#x5EFA;&#x6811;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x5927;&#x91CF;&#x7684;&#x4E1A;&#x52A1;&#x77E5;&#x8BC6;&#x548C;&#x7EC4;&#x7EC7;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F88;&#x591A;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x66F4;&#x613F;&#x610F;&#x6DF1;&#x5165;&#x6316;&#x6398;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x7684;&#x6DF1;&#x5EA6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x4E8E;&#x6295;&#x5165;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x53BB;&#x4E86;&#x89E3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x63D0;&#x5347;&#x6C9F;&#x901A;&#x6280;&#x5DE7;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x66F4;&#x9002;&#x5408;&#x8D70;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x6DF1;&#x5EA6;&#x63A2;&#x7D22;&#x7279;&#x5B9A;&#x7684;&#x6280;&#x672F;&#x9886;&#x57DF;&#xFF0C;&#x5982;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x6DF1;&#x5EA6;&#x5E94;&#x7528;&#x3001;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x5305;&#x62EC;&#x865A;&#x62DF;&#x673A;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x3001;&#x4E2D;&#x95F4;&#x4EF6;&#xFF09;&#x4EE5;&#x53CA;&#x590D;&#x6742;&#x7684;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x7B49;&#x3002;&#x4ED6;&#x4EEC;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x4E3A;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x62BD;&#x8C61;&#x5316;&#x548C;&#x6A21;&#x5F0F;&#x5316;&#x5960;&#x5B9A;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x663E;&#x793A;&#x51FA;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x8DEF;&#x5F84;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E0D;&#x4E9A;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/5e1ff7b6d2b3c28a7b0fb2a4e7eadf7c.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="tags/架构-设计/" rel="tag"># 架构,设计</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="7362046148709138467.html" rel="next" title="我不想再翻代码找export了, 所以">
                <i class="fa fa-chevron-left"></i> 我不想再翻代码找export了, 所以
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="7362084371057164288.html" rel="prev" title="介绍riverpod中的refinvalidate、ref">
                介绍riverpod中的refinvalidate、ref <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


    <!-- 有瓣音频文章内嵌广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block; text-align:center;" data-ad-layout="in-article" data-ad-format="fluid" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6145016388"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>

    <div class="post-spread">
      
    </div>
  </div>
  <!-- 有瓣音频信息流广告 -->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle" style="display:block" data-ad-format="fluid" data-ad-layout-key="-6t+ed+2i-1n-4w" data-ad-client="ca-pub-2626449904708114" data-ad-slot="6455528644"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">2975</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1162</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#1、简化能力"><span class="nav-number">1.</span> <span class="nav-text">1、简化能力</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-2、视觉思维"><span class="nav-number">2.</span> <span class="nav-text">1.2、视觉思维</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-3、技术绘图"><span class="nav-number">3.</span> <span class="nav-text">1.3、技术绘图</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-4、系统思维"><span class="nav-number">4.</span> <span class="nav-text">1.4、系统思维</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-5、市场洞察"><span class="nav-number">5.</span> <span class="nav-text">1.5、市场洞察</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-6、沟通能力"><span class="nav-number">6.</span> <span class="nav-text">1.6、沟通能力</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#1-7、编程能力"><span class="nav-number">7.</span> <span class="nav-text">1.7、编程能力</span></a></li></ol><li class="nav-item nav-level-2"><a class="nav-link" href="#2、总结"><span class="nav-number"></span> <span class="nav-text">2、总结</span></a></li></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
