<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="../../lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="../../lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="../../css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="../../images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="../../images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="../../images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="../../images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="Hexo, NexT">





  <link rel="alternate" href="../../atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta property="og:type" content="website">
<meta property="og:title" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:url" content="https://dev.newban.cn/page/79/index.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:locale" content="zh-Hans">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="开发者博客 – IT技术 尽在开发者博客">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/page/79/">





  <title>开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left 
  page-home">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338721296866656296.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338721296866656296.html" itemprop="url">想进国企，跳槽真的不要太频繁 想进国企，跳槽真的不要太频繁</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-25T12:05:03+08:00">
                2024-02-25
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x8DF3;&#x69FD;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x592A;&#x9891;&#x7E41;"><a href="#&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x8DF3;&#x69FD;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x592A;&#x9891;&#x7E41;" class="headerlink" title="&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x8DF3;&#x69FD;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x592A;&#x9891;&#x7E41;"></a>&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x8DF3;&#x69FD;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x592A;&#x9891;&#x7E41;</h1><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/88a8ca0e75a45426b0772ac5c1e4fc34aa83df9c503ba860b51daea571cd7f67" alt="image.png"></p>
<p>&#x53BB;&#x5E74;&#x5185;&#x63A8;&#x7684;&#x4E00;&#x4E2A;&#x5B66;&#x5F1F;&#xFF0C;&#x9762;&#x8BD5;&#x515C;&#x515C;&#x8F6C;&#x8F6C;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x6700;&#x7EC8;&#x5317;&#x4EAC;&#x7684;&#x9886;&#x5BFC;&#x8FD8;&#x662F;&#x628A;&#x4ED6;&#x6302;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x4ED6;&#x8DF3;&#x69FD;&#x662F;&#x5728;&#x592A;&#x9891;&#x7E41;&#x4E86;&#xFF0C;&#x62C5;&#x5FC3;&#x7A33;&#x5B9A;&#x6027;&#x4E0D;&#x884C;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x5B66;&#x5F1F;&#x672C;&#x8EAB;&#x662F;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#x7684;&#xFF0C;&#x672C;&#x79D1;&#x548C;&#x7814;&#x7A76;&#x751F;&#x90FD;&#x6BD5;&#x4E1A;&#x4E8E;985&#x5927;&#x5B66;&#xFF0C;&#x5B66;&#x6821;&#x671F;&#x95F4;&#x5B9E;&#x4E60;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x90FD;&#x662F;&#x817E;&#x8BAF;&#x3001;&#x963F;&#x91CC;&#x3001;&#x5B57;&#x8282;&#x8FD9;&#x6837;&#x7684;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x6BD5;&#x4E1A;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x5927;&#x5BB6;&#x8033;&#x719F;&#x80FD;&#x8BE6;&#x7684;&#x67D0;&#x56FD;&#x6709;&#x5927;&#x94F6;&#x884C;&#x7684;&#x8F6F;&#x5F00;&#x5C97;&#x3002;</p>
<p>&#x7B80;&#x5386;&#x548C;&#x5C65;&#x5386;&#x90FD;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x4ED6;&#x5374;&#x9009;&#x62E9;&#x4E86;&#x6BD5;&#x4E1A;&#x521A;&#x5DE5;&#x4F5C;&#x534A;&#x5E74;&#x5C31;&#x88F8;&#x8F9E;&#xFF0C;&#x5F53;&#x6211;&#x521A;&#x8BA4;&#x8BC6;&#x4ED6;&#x7684;&#x65F6;&#x5019;&#x4ED6;&#x4EE5;&#x53CA;&#x5728;&#x6210;&#x90FD;&#x5230;&#x5904;&#x6295;&#x7B80;&#x5386;&#x627E;&#x5DE5;&#x4F5C;&#x5FEB;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#x3002;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x5C65;&#x5386;&#x4E5F;&#x4E0D;&#x81F3;&#x4E8E;&#x9897;&#x7C92;&#x65E0;&#x6536;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x8D77;&#x4ED6;&#x4E0A;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x6863;&#x6B21;&#x8FD8;&#x662F;&#x5DEE;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x94F6;&#x884C;&#x7684;&#x79D1;&#x6280;&#x5C97;&#x88AB;&#x5377;&#x6015;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x8DDF;&#x6211;&#x8BF4;&#x60F3;&#x627E;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x7684;&#x5730;&#x65B9;&#x5446;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x9057;&#x61BE;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x5317;&#x4EAC;&#x7684;&#x9886;&#x5BFC;&#x89C9;&#x5F97;&#x4ED6;&#x534A;&#x5E74;&#x5C31;&#x79BB;&#x804C;&#x5341;&#x5206;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x4E5F;&#x5BF9;&#x4ED6;&#x5173;&#x4E0A;&#x4E86;&#x5927;&#x95E8;&#x3002;</p>
<p>&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x62DB;&#x8058;&#x3001;&#x5185;&#x63A8;&#x3001;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#x3001;&#x9762;&#x8BD5;&#x8F85;&#x5BFC;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x77E5;&#x8BC6;&#x661F;&#x7403;<a href="/external_links/45189791276eaf5979b24d934b15b3cf.html" target="blank" rel="noopener">&#x3010;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x6307;&#x5357;&#x3011;</a>&#xFF0C;&#x5E2E;&#x52A9;&#x5E94;&#x5C4A;&#x751F;&#x3001;&#x793E;&#x4F1A;&#x4EBA;&#x58EB;&#x7B49;&#x4E86;&#x89E3;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x8FDB;&#x884C;&#x4E00;&#x5BF9;&#x4E00;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#x3001;&#x804C;&#x4E1A;&#x89C4;&#x9762;&#x8BD5;&#x8F85;&#x5BFC;&#x7B49;&#x3002;</p>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x56FD;&#x4F01;&#x8FD9;&#x4E48;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x56FD;&#x4F01;&#x8FD9;&#x4E48;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x56FD;&#x4F01;&#x8FD9;&#x4E48;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x56FD;&#x4F01;&#x8FD9;&#x4E48;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;</h3><p>&#x6211;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x9762;&#x8BD5;&#x6765;&#x5230;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x62DB;&#x8058;&#x6211;&#x7684;&#x4E3B;&#x4EFB;&#x5FC3;&#x91CC;&#x8FD8;&#x5F88;&#x865A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E5F;&#x662F;&#x5446;&#x4E86;&#x4E00;&#x5E74;&#x5C31;&#x8DF3;&#x69FD;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x62C5;&#x5FC3;&#x6211;&#x8FC7;&#x6765;&#x5FC3;&#x91CC;&#x843D;&#x5DEE;&#x5927;&#xFF0C;&#x5446;&#x4E0D;&#x4E86;&#x591A;&#x4E45;&#x3002;</p>
<p>&#x597D;&#x5728;&#x5F53;&#x65F6;&#x6211;&#x6CA1;&#x6709;&#x79BB;&#x804C;&#xFF0C;&#x6240;&#x4EE5;&#x5FC3;&#x6001;&#x5F88;&#x5E73;&#x548C;&#x7136;&#x540E;&#x624D;&#x8DDF;&#x8FD9;&#x8FB9;&#x628A;offer&#x8C08;&#x4E0B;&#x6765;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x60F3;&#x60F3;&#x5982;&#x679C;&#x5F53;&#x65F6;&#x6211;&#x5DF2;&#x7ECF;&#x79BB;&#x804C;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x4F5C;&#x4E3A;&#x793E;&#x62DB;&#x6211;&#x53EF;&#x80FD;&#x5C31;&#x62FF;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;offer&#x4E86;&#x5427;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x56FD;&#x4F01;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#x5462;&#xFF0C;&#x56FD;&#x4F01;&#x5176;&#x5B9E;&#x548C;&#x79C1;&#x4F01;&#x4E0D;&#x540C;&#xFF08;&#x8FD9;&#x91CC;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x771F;&#x56FD;&#x4F01;&#xFF0C;&#x50CF;&#x4EC0;&#x4E48;&#x79D1;&#x6280;&#x5B50;&#x516C;&#x53F8;&#xFF0C;&#x6709;&#x672B;&#x5C3E;&#x6DD8;&#x6C70;&#x8FD8;&#x771F;&#x7684;&#x641E;&#x7684;&#x4E0D;&#x5728;&#x6211;&#x7684;&#x8BA8;&#x8BBA;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF09;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4F60;&#x4F5C;&#x4E3A;&#x4E2A;&#x4EBA;&#x6709;&#x592A;&#x5927;&#x7684;&#x80FD;&#x529B;&#x548C;&#x4EA7;&#x51FA;&#xFF0C;&#x66F4;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x4F60;&#x538B;&#x69A8;&#x5230;&#x6781;&#x81F4;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x4E0A;&#x56FD;&#x4F01;&#x7684;&#x9879;&#x76EE;&#x662F;&#x901A;&#x8FC7;&#x9886;&#x5BFC;&#x5C42;&#x7684;&#x5173;&#x7CFB;&#x8FD0;&#x4F5C;&#x6765;&#x7684;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x5E02;&#x573A;&#x662F;&#x53AE;&#x6740;&#x6765;&#x62A2;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x6709;&#x4E9B;&#x5784;&#x65AD;&#x884C;&#x4E1A;&#x8FD9;&#x9879;&#x76EE;&#x5C31;&#x5F97;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x505A;&#xFF0C;&#x54EA;&#x6015;&#x662F;&#x62FF;&#x5230;&#x9879;&#x76EE;&#x540E;&#x5916;&#x5305;&#x51FA;&#x53BB;&#xFF0C;&#x90FD;&#x5F97;&#x4F60;&#x4EEC;&#x96C6;&#x56E2;&#x6765;&#x7275;&#x5934;&#x3002;</p>
<p>&#x5E76;&#x4E14;&#x56FD;&#x4F01;&#x7684;&#x9886;&#x5BFC;&#x548C;&#x4F60;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x7ED9;&#x56FD;&#x5BB6;&#x6253;&#x5DE5;&#xFF0C;&#x800C;&#x4E14;&#x56FD;&#x4F01;&#x7684;&#x5347;&#x8FC1;&#x4E5F;&#x4E0D;&#x662F;&#x552F;&#x4E1A;&#x7EE9;&#x8BBA;&#x6210;&#x8D25;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x60C5;&#x5373;&#x4F7F;&#x4F60;&#x5E72;&#x5F97;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x5BF9;&#x9886;&#x5BFC;&#x7684;&#x5F71;&#x54CD;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x4E0D;&#x4F1A;&#x641E;&#x4F60;&#x641E;&#x5F97;&#x592A;&#x96BE;&#x770B;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x8FD9;&#x4E2A;&#x9886;&#x5BFC;&#x6709;&#x7CBE;&#x795E;&#x75BE;&#x75C5;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x822C;&#x5784;&#x65AD;&#x56FD;&#x4F01;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x8FD8;&#x884C;&#xFF0C;&#x5F88;&#x591A;&#x5458;&#x5DE5;&#x90FD;&#x662F;&#x5446;&#x4E0A;&#x597D;&#x51E0;&#x5E74;&#x751A;&#x81F3;&#x6570;&#x5341;&#x5E74;&#x7684;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x786E;&#x5B9E;&#x4E0D;&#x9519;&#xFF0C;&#x6CA1;&#x4EBA;&#x96BE;&#x4E3A;&#x4F60;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5C31;&#x662F;&#x5728;&#x56FD;&#x4F01;&#x5446;&#x4E45;&#x4E86;&#x5C31;&#x786E;&#x5B9E;&#x5931;&#x53BB;&#x4E86;&#x53BB;&#x5916;&#x9762;&#x53AE;&#x6740;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x4E0D;&#x6562;&#x8DF3;&#x69FD;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x7684;&#x8282;&#x594F;&#x4E5F;&#x4F1A;&#x6BD4;&#x8F83;&#x6162;&#xFF0C;&#x5728;&#x56FD;&#x4F01;&#x4F60;&#x5446;&#x4E86;&#x534A;&#x5E74;&#x53EF;&#x80FD;&#x9879;&#x76EE;&#x65B9;&#x9762;&#x624D;&#x4E0A;&#x624B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x5F85;&#x9047;&#x4E5F;&#x6CA1;&#x6709;&#x5916;&#x9762;&#x79C1;&#x4F01;&#x90A3;&#x4E48;&#x9AD8;&#xFF0C;&#x9886;&#x5BFC;&#x62DB;&#x4E00;&#x4E2A;&#x4EBA;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x975E;&#x5E38;&#x614E;&#x91CD;&#x7684;&#x3002;</p>
<p>&#x50CF;&#x8FD9;&#x4E2A;&#x5B66;&#x5F1F;&#x7684;&#x534A;&#x5E74;&#x4E00;&#x8DF3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x56FD;&#x4F01;&#x9886;&#x5BFC;&#x773C;&#x91CC;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x4F60;&#x90FD;&#x8FD8;&#x6CA1;&#x5F00;&#x59CB;&#x4E0A;&#x624B;&#xFF0C;&#x600E;&#x4E48;&#x5C31;&#x8DF3;&#x69FD;&#x4E86;&#xFF0C;&#x90A3;&#x6211;&#x62DB;&#x4F60;&#x8FDB;&#x6765;&#x4F1A;&#x4E0D;&#x4F1A;&#x662F;&#x778E;&#x6298;&#x817E;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x9009;&#x62E9;&#x656C;&#x800C;&#x8FDC;&#x4E4B;&#x4E86;&#x3002;</p>
<h3 id="&#x5982;&#x4F55;&#x5728;&#x62DB;&#x8058;&#x7684;&#x65F6;&#x5019;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;"><a href="#&#x5982;&#x4F55;&#x5728;&#x62DB;&#x8058;&#x7684;&#x65F6;&#x5019;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;" class="headerlink" title="&#x5982;&#x4F55;&#x5728;&#x62DB;&#x8058;&#x7684;&#x65F6;&#x5019;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;"></a>&#x5982;&#x4F55;&#x5728;&#x62DB;&#x8058;&#x7684;&#x65F6;&#x5019;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF1F;</h3><p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x5728;&#x56FD;&#x4F01;&#x7684;&#x62DB;&#x8058;&#x5F53;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x591F;&#x6070;&#x5230;&#x597D;&#x5904;&#x7684;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x56FD;&#x4F01;&#x7684;&#x9886;&#x5BFC;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x52A0;&#x9752;&#x7750;&#x4F60;&#x3002;&#x4E3B;&#x8981;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#x3001;&#x5728;&#x5F53;&#x524D;&#x57CE;&#x5E02;&#x5DF2;&#x7ECF;&#x5B9A;&#x5C45;&#x6216;&#x8005;&#x6709;&#x5B9A;&#x5C45;&#x6253;&#x7B97;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E70;&#x4E86;&#x623F;&#x5B50;&#x6709;&#x4E86;&#x751F;&#x5B58;&#x538B;&#x529B;&#xFF0C;&#x5E76;&#x4E14;&#x6253;&#x7B97;&#x624E;&#x6839;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x8BDD;&#xFF0C;&#x80AF;&#x5B9A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x52A0;&#x5206;&#x9879;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x4E00;&#x822C;&#x662F;&#x4E0D;&#x6562;&#x8F7B;&#x6613;&#x8DF3;&#x69FD;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9886;&#x5BFC;&#x5F88;&#x653E;&#x5FC3;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x3001;&#x80FD;&#x529B;&#x5176;&#x5B9E;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x5F3A;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x79C1;&#x4F01;&#x6DF7;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x4EBA;&#x5176;&#x5B9E;&#x6709;&#x4E00;&#x4E2A;&#x8BEF;&#x533A;&#xFF0C;&#x80FD;&#x529B;&#x8D8A;&#x5F3A;&#x8D8A;&#x597D;&#x3002;&#x5176;&#x5B9E;&#x56FD;&#x4F01;&#x7684;&#x9886;&#x5BFC;&#x5FC3;&#x91CC;&#x6709;&#x6570;&#x7684;&#xFF0C;&#x7B2C;&#x4E00;&#x8FD9;&#x91CC;&#x4E0D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x9AD8;&#x7CBE;&#x5C16;&#x6280;&#x672F;&#xFF0C;&#x7B2C;&#x4E8C;&#xFF0C;&#x80FD;&#x529B;&#x592A;&#x5F3A;&#x7684;&#x5446;&#x4E0D;&#x4E86;&#x591A;&#x4E45;&#x5C31;&#x8DD1;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x80FD;&#x529B;&#x592A;&#x5F3A;&#xFF0C;&#x6216;&#x8005;&#x90A3;&#x79CD;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x80FD;&#x529B;&#x5F3A;&#x5C31;&#x6CBE;&#x6CBE;&#x81EA;&#x559C;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x4E9B;&#x4EBA;&#x6709;&#x66F4;&#x597D;&#x7684;&#x53BB;&#x5904;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x5C0F;&#x5E99;&#x5C31;&#x4E0D;&#x4F9B;&#x8FD9;&#x5EA7;&#x5927;&#x4F5B;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x662F;&#x771F;&#x56FD;&#x4F01;&#x7684;&#x5C97;&#x4F4D;&#x5176;&#x5B9E;&#x50CF;&#x4EC0;&#x4E48;&#x963F;&#x91CC;P8&#x7684;&#x8FD8;&#x771F;&#x4E0D;&#x613F;&#x610F;&#x8981;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x96C6;&#x56E2;&#x9886;&#x5BFC;&#x76F4;&#x63A5;&#x62DB;&#x8FDB;&#x6765;&#xFF0C;&#x666E;&#x901A;&#x5C97;&#x4F4D;&#x62DB;&#x8FDB;&#x6765;&#x771F;&#x6015;&#x4F60;&#x5377;&#x6211;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x3001;&#x6709;&#x5973;&#x670B;&#x53CB;&#x5728;&#x8FD9;&#x8FB9;&#xFF0C;&#x6211;&#x540C;&#x65F6;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x4E3A;&#x4E86;&#x5973;&#x670B;&#x53CB;&#x4ECE;&#x676D;&#x5DDE;&#x8DF3;&#x69FD;&#x5230;&#x6210;&#x90FD;&#x6765;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x8FD9;&#x4E2A;&#x7406;&#x7531;&#x4E5F;&#x4F1A;&#x5F88;&#x653E;&#x5FC3;&#xFF0C;&#x89C9;&#x5F97;&#x4F60;&#x8FC7;&#x6765;&#x5C31;&#x8DD1;&#x4E0D;&#x6389;&#x4E86;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x3001;&#x5E74;&#x9F84;&#x8FD8;&#x4E0D;&#x5927;&#x6216;&#x8005;&#x5E74;&#x9F84;&#x7A0D;&#x5927;&#x4ECE;&#x4E00;&#x7EBF;&#x57CE;&#x5E02;&#x56DE;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x5728;&#x5F53;&#x524D;&#x7684;&#x57CE;&#x5E02;&#x5B9A;&#x5C45;&#x7684;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x8868;&#x73B0;&#x51FA;&#x5B9A;&#x5C45;&#x7684;&#x610F;&#x56FE;&#x90A3;&#x4E48;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x4F18;&#x52BF;&#x3002;</p>
<h3 id="&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x8DF3;&#x69FD;"><a href="#&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x8DF3;&#x69FD;" class="headerlink" title="&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x8DF3;&#x69FD;"></a>&#x60F3;&#x8FDB;&#x56FD;&#x4F01;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x8DF3;&#x69FD;</h3><p>&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x79C1;&#x4F01;&#x90FD;&#x5F88;&#x5728;&#x4E4E;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x4EC0;&#x4E48;&#x4E94;&#x5E74;&#x4E09;&#x8DF3;&#x3001;&#x4E09;&#x5E74;&#x4E24;&#x8DF3;&#x7684;&#x90FD;&#x4F1A;&#x6210;&#x4E3A;&#x7B80;&#x5386;&#x4E0A;&#x7684;&#x52A3;&#x52BF;&#x800C;&#x88AB;&#x65E0;&#x60C5;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x79C1;&#x4F01;&#x672C;&#x8EAB;&#x4EBA;&#x5458;&#x53D8;&#x52A8;&#x5C31;&#x9891;&#x7E41;&#x4F60;&#x8FD8;&#x8981;&#x6C42;&#x4EBA;&#x5BB6;&#x6709;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x8FD9;&#x4E0D;&#x95F9;&#x7740;&#x73A9;&#x5417;&#xFF1F;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x672A;&#x6765;&#x60F3;&#x7740;&#x8DF3;&#x69FD;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x4E0D;&#x5377;&#x7684;&#x56FD;&#x4F01;&#x5E73;&#x7A33;&#x964D;&#x843D;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x8DF3;&#x69FD;&#x5C31;&#x4E0D;&#x8981;&#x592A;&#x5E73;&#x51E1;&#xFF0C;&#x56FD;&#x4F01;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x903B;&#x8F91;&#x548C;&#x79C1;&#x4F01;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x79C1;&#x4F01;&#x662F;&#x65E0;&#x7406;&#x53D6;&#x95F9;&#xFF0C;&#x4F46;&#x662F;&#x56FD;&#x4F01;&#x662F;&#x771F;&#x7684;&#x5E0C;&#x671B;&#x4EBA;&#x5458;&#x7A33;&#x5B9A;&#x4E00;&#x70B9;&#x513F;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x90FD;&#x575A;&#x6301;&#x4E00;&#x4E9B;&#xFF0C;&#x4FDD;&#x8BC1;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x4E0D;&#x8981;&#x82B1;&#x6389;&#xFF0C;&#x4E0D;&#x7136;&#x50CF;&#x8FD9;&#x4F4D;&#x5B66;&#x5F1F;&#x4E00;&#x6837;&#x88AB;&#x62D2;&#x7EDD;&#x5C31;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x96BE;&#x53D7;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</p>
<h3 id="The-End"><a href="#The-End" class="headerlink" title="The End"></a>The End</h3><p>&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x5B66;&#x5F1F;&#x8FD8;&#x662F;&#x62FF;&#x5230;&#x4E86;&#x56DB;&#x5DDD;&#x4E5D;&#x6D32;&#x7684;offer&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x62FF;&#x4E0D;&#x51C6;&#x5230;&#x5E95;&#x8981;&#x4E0D;&#x8981;&#x53BB;&#xFF0C;&#x6015;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5377;&#x7684;&#x519B;&#x5DE5;&#x56FD;&#x4F01;&#x3002;</p>
<p>&#x6211;&#x662F;&#x8FD9;&#x6837;&#x529D;&#x4ED6;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x54EA;&#x91CC;&#x5DE5;&#x4F5C;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x4F60;&#x8981;&#x80FD;&#x625B;&#x4F4F;&#x5DE5;&#x4F5C;&#x7684;&#x538B;&#x529B;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x83AB;&#x540D;&#x5176;&#x5999;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x73BB;&#x7483;&#x5FC3;&#x5C31;&#x79BB;&#x804C;&#x3002;</p>
<p>&#x54EA;&#x6015;&#x4F60;&#x7B49;&#x7740;&#x516C;&#x53F8;&#x88C1;&#x4F60;&#x8FD8;&#x80FD;&#x62FF;&#x4E00;&#x6CE2;n+1&#x8D54;&#x507F;&#x5462;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x5730;&#x65B9;&#x53BB;&#x5C31;&#x5148;&#x5446;&#x7740;&#xFF0C;&#x5148;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x7ED3;&#x675F;&#x5931;&#x4E1A;&#x72B6;&#x6001;&#x518D;&#x8BF4;&#xFF0C;&#x5148;&#x4E0A;&#x5CB8;&#x518D;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x7684;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4E5F;&#x8877;&#x5FC3;&#x5E0C;&#x671B;&#x4ED6;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x62DB;&#x8058;&#x3001;&#x5185;&#x63A8;&#x3001;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#x3001;&#x9762;&#x8BD5;&#x8F85;&#x5BFC;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x77E5;&#x8BC6;&#x661F;&#x7403;<a href="/external_links/45189791276eaf5979b24d934b15b3cf.html" target="blank" rel="noopener">&#x3010;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x6307;&#x5357;&#x3011;</a>&#xFF0C;&#x5E2E;&#x52A9;&#x5E94;&#x5C4A;&#x751F;&#x3001;&#x793E;&#x4F1A;&#x4EBA;&#x58EB;&#x7B49;&#x4E86;&#x89E3;&#x6210;&#x90FD;&#x592E;&#x56FD;&#x4F01;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x8FDB;&#x884C;&#x4E00;&#x5BF9;&#x4E00;&#x7B80;&#x5386;&#x8F85;&#x5BFC;&#x3001;&#x804C;&#x4E1A;&#x89C4;&#x9762;&#x8BD5;&#x8F85;&#x5BFC;&#x7B49;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/633208ce5fb6526dcbe0ccee33e926b0.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338674902282059803.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338674902282059803.html" itemprop="url">IDEA 重装我都会默默的下载这些好用的插件 IDEA 重装</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-24T12:31:33+08:00">
                2024-02-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x672C;&#x6587;&#x5DF2;&#x7ECF;&#x6536;&#x5F55;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<a href="/external_links/f6b47d891a1fef56d28b4f04601d5670.html" target="blank" rel="noopener">IDEA &#x91CD;&#x88C5;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x7684;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x597D;&#x7528;&#x7684;&#x63D2;&#x4EF6; (qq.com)</a></p>
<h1 id="IDEA-&#x91CD;&#x88C5;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x7684;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x597D;&#x7528;&#x7684;&#x63D2;&#x4EF6;"><a href="#IDEA-&#x91CD;&#x88C5;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x7684;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x597D;&#x7528;&#x7684;&#x63D2;&#x4EF6;" class="headerlink" title="IDEA &#x91CD;&#x88C5;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x7684;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x597D;&#x7528;&#x7684;&#x63D2;&#x4EF6;"></a>IDEA &#x91CD;&#x88C5;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x7684;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x597D;&#x7528;&#x7684;&#x63D2;&#x4EF6;</h1><p><strong>&#x8FD9;&#x51E0;&#x5E74;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x3002;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#xFF0C;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#xFF01;&#x6BCF;&#x4E00;&#x6B21;&#x7535;&#x8111;&#x91CD;&#x88C5;&#xFF0C;&#x66F4;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x9ED8;&#x9ED8;&#x5730;&#x6253;&#x5F00;&#x6211;&#x7684;&#x63D2;&#x4EF6;&#x6536;&#x85CF;&#x5355;&#xFF0C;&#x6328;&#x4E2A;&#x4E0B;&#x8F7D;&#x3002;</strong></p>
<blockquote>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x90E8;&#x5206;&#x63D2;&#x4EF6;&#x5BF9; IDEA &#x7684;&#x7248;&#x672C;&#x6709;&#x6700;&#x4F4E;&#x8981;&#x6C42;&#xFF01;&#x8FC7;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4F1A;&#x5403;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x63D2;&#x4EF6;&#x4E5F;&#x8981;&#x9002;&#x53EF;&#x800C;&#x6B62;&#xFF5E;</p>
</blockquote>
<p><strong>&#x6240;&#x6709;&#x7684;&#x63D2;&#x4EF6;&#x90FD;&#x9700;&#x8981;&#x7B80;&#x5355;&#x5B66;&#x4E60;&#x624D;&#x80FD;&#x4E0A;&#x624B;&#xFF0C;&#x88C5;&#x4E0A;&#x4E86;&#x6CA1;&#x7528;&#xFF0C;&#x7528;&#x4E0A;&#x4E86;&#x624D;&#x6709;&#x7528;&#xFF01;</strong></p>
<h2 id="1-1-arthas-idea-&#x548C;-ArthasHotSwap"><a href="#1-1-arthas-idea-&#x548C;-ArthasHotSwap" class="headerlink" title="1.1 arthas idea  &#x548C; ArthasHotSwap"></a>1.1 arthas idea  &#x548C; ArthasHotSwap</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/76a37a810095b8d9cd4f05a89a8f48371457e364f3bc5e3845c78aa05f55f04d" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x5FEB;&#x901F;&#x590D;&#x5236; arthas &#x547D;&#x4EE4;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x4E0D;&#x5FC5;&#x8BB0;&#x5FC6;&#x548C;&#x624B;&#x52A8;&#x62FC;&#x63A5;&#x547D;&#x4EE4;&#x884C;&#xFF1B;&#x51C6;&#x786E;&#x53C8;&#x9AD8;&#x6548;&#x3002;&#x662F;&#x6211;&#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/fcb4279b10b35296d9717b474200f276.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1358&#x2026;</a></p>
<hr>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A; arthas &#x662F;&#x89E3;&#x51B3; java &#x65E5;&#x5E38;&#x95EE;&#x9898;&#x6700;&#x6700;&#x70ED;&#x95E8;&#x7684;&#x5DE5;&#x5177;&#x1F527;</p>
<p>&#x914D;&#x5957;&#x63D2;&#x4EF6;&#xFF1A;ArthasHotSwap arthas <a href="/external_links/e6c460f271838be5cfcbe36d52249605.html" target="blank" rel="noopener">redefine</a></p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x8FDC;&#x7AEF; refine&#xFF0C; &#x70ED;&#x90E8;&#x7F72;&#x4EE3;&#x7801;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a6686e8f8925d0beaa55d610ac0a27aabd63a0140b45fa47caa4021ef4eac99d" alt></p>
<p>&#x5173;&#x4E8E; arthas &#x7684;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x7528;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x7684;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;:</p>
<p><a href="https://dev.newban.cn/7291931708920512527">&#x5DE5;&#x4F5C;&#x516D;&#x5E74;&#xFF0C;&#x6211;&#x5B66;&#x4F1A;&#x4E86;&#x7528; Arthas &#x6765;&#x8F85;&#x52A9;&#x6211;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C; - &#x6398;&#x91D1; (juejin.cn)</a></p>
<h2 id="1-2-JReble"><a href="#1-2-JReble" class="headerlink" title="1.2 JReble"></a>1.2 JReble</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/32b9a8c004732c8fd77ca1cb0f22c2e5e69cb309a72ade01c93d596ad8729714" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x70ED;&#x90E8;&#x7F72;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x672C;&#x5730;&#x5F00;&#x53D1;&#x4E0D;&#x7528;&#x91CD;&#x590D;&#x90E8;&#x7F72;&#x542F;&#x52A8;&#x5E94;&#x7528;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x672C;&#x5730;&#x5E94;&#x7528;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x542F;&#x52A8;&#x9700;&#x8981;&#x5341;&#x6765;&#x5206;&#x949F;&#xFF0C;&#x901A;&#x8FC7;&#x70ED;&#x90E8;&#x7F72;&#x5927;&#x5927;&#x8282;&#x7EA6;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x3002; &#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/e644d2a36156bbb47c7a0daef5c4c6f3.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/4441&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x6536;&#x8D39;&#x3002; &#x7528;&#x4E86;&#x5176;&#x4ED6;&#x5E73;&#x66FF;&#x7684;&#x70ED;&#x90E8;&#x7F72;&#x63D2;&#x4EF6;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x6B3E;&#x6DF1;&#x5F97;&#x6211;&#x5FC3;</p>
<h2 id="1-3-RestfulToolkit"><a href="#1-3-RestfulToolkit" class="headerlink" title="1.3 RestfulToolkit"></a>1.3 RestfulToolkit</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/95ca0e8b04e40173e22eba6dd6c27f9165866c04d48c3ac033ba548fc536399b" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;1. &#x6839;&#x636E; URL &#x76F4;&#x63A5;&#x8DF3;&#x8F6C;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#xFF1B; 2. &#x901A;&#x8FC7; controller &#x590D;&#x5236;&#x51FA;&#x6765;&#x5BF9;&#x5E94;&#x7684; url&#xFF1B; 3. java &#x7C7B;&#x8F6C;&#x6210; json &#x7B49;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x901A;&#x8FC7; url &#x627E;&#x5BF9;&#x5E94; controller &#x7684;&#x65B9;&#x6CD5;&#xFF1B;&#x901A;&#x8FC7;&#x8F6F;&#x4EF6;&#x5FEB;&#x901F;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A; JSON&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7B49;&#x3002;&#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/945e73df94e2793e7ab2ff82dcfa1879.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1029&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x7B2C;&#x4E00;&#x5F20;&#x5FEB;&#x901F;&#x590D;&#x5236; url&#xFF0C;&#x7B2C;&#x4E8C;&#x5F20;&#x662F;&#x5FEB;&#x901F;&#x6839;&#x636E; url &#x627E;&#x5230;&#x65B9;&#x6CD5;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/63ddf397bace6b15640cb16a148a6b9e4755e2d4ac3f3c14513189440080265c" alt></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/d1597f054e4fd2e845ae1a020a6c0925da619c62f474f0a2a342628ae1621b94" alt></p>
<h2 id="1-4-Free-Mybatis-Plugin"><a href="#1-4-Free-Mybatis-Plugin" class="headerlink" title="1.4 Free Mybatis Plugin"></a>1.4 Free Mybatis Plugin</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5cafaf61bec82ca0c4fb52a833548bac5a3b9937e83df36e580c8b25530b4c7e" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x901A;&#x8FC7; mapper &#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684; xml&#xFF0C;&#x901A;&#x8FC7; xml &#x627E;&#x5230; mapper</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;mapper &#x548C; xml &#x5BF9;&#x5E94;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8DF3;&#x8F6C;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x901A;&#x8FC7;&#x5168;&#x6587;&#x641C;&#x7D22;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x627E;&#x3002;&#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/e51d861b9ac6be8d13cff4396330f289.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/8321&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x4E0B;&#x9762;&#x901A;&#x8FC7;&#x7BAD;&#x5934;&#x8FDB;&#x884C;&#x8DF3;&#x8F6C;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/3854f330a5f3483f72c590875767c9b06bee2814011bbaa7b6615041e95f3f70" alt></p>
<h2 id="1-5-Lombok"><a href="#1-5-Lombok" class="headerlink" title="1.5 Lombok"></a>1.5 Lombok</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/476bd9e4da150121c4c2192fb821c1c1e016012b5b68dfc34de4e83c8027042f" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x7B80;&#x5316;&#x4EE3;&#x7801;; &#x6BD4;&#x5982;&#x51CF;&#x5C11; get&#x3001;set&#x7B49;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x4E0D;&#x7528;&#x5199;&#x5927;&#x91CF;&#x7684; getter&#x3001;setter&#x4EE3;&#x7801;&#xFF0C;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x6574;&#x6D01;&#x3002;&#x975E;&#x5E38;&#x559C;&#x6B22; bulder &#x529F;&#x80FD;&#xFF0C;&#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/2ee050f7a0d515b1f169cbcb7d677ec1.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/6317&#x2026;</a></p>
<h2 id="1-6-maven-helper"><a href="#1-6-maven-helper" class="headerlink" title="1.6 maven helper"></a>1.6 maven helper</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/7d767a86ab19955c4a42ac1096d70e91342a2b907f1e9e8d238498d8d7c766f0" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x5BF9;&#x4F9D;&#x8D56;&#x7684; jar &#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4F4D;&#x51B2;&#x7A81;&#x3001;&#x67E5;&#x770B;&#x4F9D;&#x8D56;&#x6811;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x6392;&#x9664; jar &#x51B2;&#x7A81;&#xFF1B;&#x4F9D;&#x8D56;&#x901A;&#x8FC7;&#x56FE;&#x5F62;&#x5316;&#x5C55;&#x793A;&#xFF0C;&#x65E5;&#x5E38;&#x4E2D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x4E4B;&#x4E00;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/6b7ff0ab228d7081828757b2b247737c.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/7179&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x4E0B;&#x9762;&#x662F;&#x4F7F;&#x7528;&#x622A;&#x56FE;&#xFF0C;&#x5149;&#x4E0B;&#x9762;&#x8FD9;&#x51E0;&#x4E2A;&#x529F;&#x80FD;&#x5C31;&#x503C;&#x5F97;&#x70B9;&#x8D5E;&#xFF01;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/53f3e0d03c06df54af8cf1a66a518490c7234c3fb9f2b50959de6f987108f1d5" alt></p>
<h2 id="1-7-translation"><a href="#1-7-translation" class="headerlink" title="1.7 translation"></a>1.7 translation</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/1e4fca6338878952a87c91cb78a2d34a2dfde34cfd3f9074b27f5bd1c7ea2ef8" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x7FFB;&#x8BD1;&#x8F6F;&#x4EF6;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x5BF9;&#x4E8E;&#x82F1;&#x6587;&#x4E0D;&#x592A;&#x597D;&#x7684;&#x540C;&#x5B66;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x7528;&#x518D;&#x5C06;&#x5355;&#x8BCD;&#x590D;&#x5236;&#x5230;&#x5355;&#x72EC;&#x7684;&#x7FFB;&#x8BD1;&#x5DE5;&#x5177;&#x3002;&#x5F53;&#x7136;&#x5BF9;&#x4E8E;&#x751F;&#x50FB;&#x7684;&#x5355;&#x8BCD;&#x66F4;&#x662F;&#x514B;&#x661F;!</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/b7e1ac4b310d8fa1899ead8f593d6550.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/8579&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x7F51;&#x7EDC;&#x6709;&#x9650;&#x5236;&#x3002; &#x5E73;&#x66FF;&#x63D2;&#x4EF6;&#xFF1A; Chinese-English Translate&#xFF0C;</p>
<p>&#x4F46;&#x662F;&#x7FFB;&#x8BD1;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x592A;&#x884C;</p>
<h2 id="1-8-PlantUML-Integration"><a href="#1-8-PlantUML-Integration" class="headerlink" title="1.8 PlantUML Integration"></a>1.8 PlantUML Integration</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/820ced27b96ad4a19aaa978711f0a1628e065155f7187df8a35e43ed8a4eb403" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x901A;&#x8FC7; plantuml &#x8BED;&#x6CD5;&#x7ED8;&#x5236;&#x51FA;&#x5BF9;&#x5E94;&#x7684; uml &#x56FE;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A; &#x559C;&#x6B22;&#x7ED8; uml &#x65F6;&#x5E8F;&#x56FE;&#x7684;&#x540C;&#x5B66;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#xFF1B;&#x5BF9;&#x4E8E;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x5177;&#xFF01;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/b7e1ac4b310d8fa1899ead8f593d6550.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/8579&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x63D2;&#x4EF6;&#x5BF9;&#x65F6;&#x5E8F;&#x56FE;&#x652F;&#x6301;&#x8F83;&#x597D;&#xFF0C;&#x5176;&#x4ED6;&#x652F;&#x6301; uml &#x56FE;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#xFF01;&#x5426;&#x5219;&#x4E0D;&#x80FD;&#x6E32;&#x67D3;&#xFF01;&#x6CA1;&#x6709;&#x5B89;&#x88C5;Graphviz&#xFF0C;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x663E;&#x793A;&#x56FE;&#x50CF;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e589cc6463b07e73a9b68b779731c47389d7568b1c0499f204be43d3216fd707" alt></p>
<p>plant uml &#x8BED;&#x6CD5;&#x53C2;&#x8003;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/8ef4936fc1c16af03c899c94e26035de.html" target="blank" rel="noopener">plantuml.com/zh/</a></p>
<h2 id="1-9-Alibaba-Java-Coding-Guidelines"><a href="#1-9-Alibaba-Java-Coding-Guidelines" class="headerlink" title="1.9 Alibaba Java Coding Guidelines"></a>1.9 Alibaba Java Coding Guidelines</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/19cdad70ac624b52ed7a5934cea9f1d370eea976691c239a17fcdc158fff5ee4" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x6839;&#x636E;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7F16;&#x7801;&#x89C4;&#x8303;&#x6821;&#x9A8C;&#x5DE5;&#x7A0B;&#x4E2D;&#x7684;&#x4EE3;&#x7801;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x5BF9;&#x4E0D;&#x89C4;&#x8303;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF01;&#x7EA6;&#x675F;&#x7F16;&#x7801;&#xFF0C;&#x4E0D;&#x89C4;&#x8303;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x6709;&#x4E0B;&#x5212;&#x7EBF;&#x63D0;&#x793A;&#xFF01;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/ceee33d7fa36092d5d98f7759e1db923.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1004&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x4E0B;&#x5212;&#x7EBF;&#x90E8;&#x5206;&#x7684;&#x63D0;&#x793A;&#x4E0D;&#x60F3;&#x6309;&#x7167;&#x5176;&#x89C4;&#x8303;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x914D;&#x7F6E;&#x4E2D;&#x53BB;&#x6389;&#xFF01;&#x4E0B;&#x6B21;&#x5C31;&#x4E0D;&#x4F1A;&#x63D0;&#x793A;&#x4E86;</p>
<h2 id="1-10-Markdown"><a href="#1-10-Markdown" class="headerlink" title="1.10  Markdown"></a>1.10  Markdown</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/b1fbbe2aaa442e0b52425c9c1afcdf1b3142e204f095a99e24a9d2206da49e73" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x63D0;&#x4F9B; markdown &#x7684;&#x7F16;&#x8F91;&#x548C;&#x9884;&#x89C8;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A; &#x8BFB;&#x5199; Readme &#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x6E32;&#x67D3;&#x80FD;&#x529B;&#x4E00;&#x822C;&#xFF0C;&#x65B9;&#x4FBF;&#x5728;&#x4EE3;&#x7801;&#x5DE5;&#x7A0B;&#x4E2D;&#x9605;&#x8BFB;&#x548C;&#x5199; Readme&#x3002; </p>
<h2 id="1-11-Rainbow-Brackets"><a href="#1-11-Rainbow-Brackets" class="headerlink" title="1.11 Rainbow Brackets"></a>1.11 Rainbow Brackets</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e9da169b12572b74fbc45a756ab4ee49d77d7d29d664d335c2960efc729a957e" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x4E3A;{} ()&#x7B49;&#x7740;&#x8272;&#x3002;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x627E;&#x5BF9;&#x7B26;&#x53F7;&#x5BF9;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/2c3061a045ae83740b1cf31a14056241.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1008&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x5BF9;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x62EC;&#x53F7;&#x7B49;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x3002;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5FC5;&#x9700;&#x7684;&#x63D2;&#x4EF6;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/ac03f78c57d78c1aad8a93e72a1ab182afa97bced427fa61ee62b3bb50428fdf" alt></p>
<h2 id="1-12-SpotBugs"><a href="#1-12-SpotBugs" class="headerlink" title="1.12 SpotBugs"></a>1.12 SpotBugs</h2><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/42a5cdc09926541d8623357d78727c8b4b230914b15e9cf00ca5634c6a917873" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x9759;&#x6001;&#x4EE3;&#x7801;&#x95EE;&#x9898;&#x626B;&#x63CF;&#x68C0;&#x67E5;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x626B;&#x63CF;&#x9759;&#x6001;&#x4EE3;&#x7801;&#x5FEB;&#xFF0C;&#x5FEB;&#x901F;&#x53D1;&#x73B0;&#x53EF;&#x80FD;&#x6709;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;&#x5FEB;&#x3002;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x5177;&#x4F53;&#x5305;&#xFF0C;&#x6A21;&#x5757;&#x7B49;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x90E8;&#x5206;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;&#x5728;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6CBB;&#x7406;&#x65F6;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x7528;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#x6709; FindBugs &#x63D2;&#x4EF6; <a href="/external_links/53eff795f34fe988c617a71fd01d6cf0.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/3847&#x2026;</a>&#x3002; &#x4F46;&#x662F;&#x6709;&#x6700;&#x4F4E;&#x7248;&#x672C;&#x8981;&#x6C42;&#xFF01;</p>
<h2 id="1-13-Database-Navigator"><a href="#1-13-Database-Navigator" class="headerlink" title="1.13 Database Navigator"></a>1.13 Database Navigator</h2><p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5DE5;&#x5177;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x65B9;&#x4FBF;&#x5FEB;&#x6377;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x7684;&#x8868;&#x7ED3;&#x6784;&#x3002;&#x53EF;&#x4EE5;&#x652F;&#x6301; mysql&#x3001;pg&#x7B49;&#xFF0C;&#x6574;&#x4F53;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF01;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/bcbc4526bf879e9bd995ab54b7703c39.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1800&#x2026;</a></p>
<p>&#x5176;&#x5B83;&#x8865;&#x5145;&#xFF1A;&#x529F;&#x80FD;&#x6CA1;&#x6709; navicat &#x5F3A;&#xFF0C;&#x4F46;&#x662F;&#x8DB3;&#x591F;&#x7528;&#x4E86;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/b1c5f05c6dab903394eed5f1113f6854733c1ff8b23434700fb77f4154f43a0e" alt></p>
<h2 id="1-14-AI-code-&#x63D2;&#x4EF6;"><a href="#1-14-AI-code-&#x63D2;&#x4EF6;" class="headerlink" title="1.14 AI code &#x63D2;&#x4EF6;"></a>1.14 AI code &#x63D2;&#x4EF6;</h2><p>AI &#x4EE3;&#x7801;&#x52A9;&#x624B;&#xFF0C;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x6B3E;&#x63D2;&#x4EF6;&#x3002;&#x90FD;&#x9700;&#x8981;&#x6CE8;&#x518C;&#x8D26;&#x53F7;</p>
<h3 id="Github-Copilot"><a href="#Github-Copilot" class="headerlink" title="Github Copilot"></a>Github Copilot</h3><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e9a74def8bc568b65636cf3cff78776ca5be17cbf9a62eb0da360466b559c979" alt></p>
<p><a href="/external_links/84f2d1aabf2644492a68e3178f04bfaf.html" target="blank" rel="noopener">docs.github.com/zh/copilot/&#x2026;</a></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x5927;&#x6A21;&#x578B;&#x52A9;&#x7406;&#x7F16;&#x7801;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x66F4;&#x52A0;&#x667A;&#x80FD;&#x7684;&#x7F16;&#x7801;&#xFF0C;&#x63D0;&#x9AD8;&#x7F16;&#x7801;&#x6548;&#x7387;&#xFF01;&#x7528;&#x4E86;&#x51E0;&#x5929;&#xFF0C;&#x8FD8;&#x4E0D;&#x9519;</p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/d4a9ff869328de112bdc7673f3b20cee.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1771&#x2026;</a></p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x8BD5;&#x7528; 60 &#x5929;&#xFF0C;&#x6536;&#x8D39;</p>
<h3 id="TabNine"><a href="#TabNine" class="headerlink" title="TabNine"></a>TabNine</h3><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/5ed3ddb01c63f65feb6bc8bd54ea9b1d545a919beddd161bfdace5d265191412" alt></p>
<p>&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1A;&#x4EE3;&#x7801;&#x8865;&#x5168;&#x3001;&#x4EE3;&#x7801;&#x63D0;&#x793A;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#xFF01;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/82cd09aef5ea8d0ec2faa774ee547a73.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1279&#x2026;</a></p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x5176;&#x4ED6;&#x8865;&#x5145;&#xFF1A;&#x5B98;&#x7F51;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x641C;&#x7D22;&#x4EE3;&#x7801;&#x7684;&#x7F51;&#x7AD9;&#xFF1A;<a href="/external_links/060026dfb66f904c2afd8c19c4913159.html" target="blank" rel="noopener">www.tabnine.com/code?spm=at&#x2026;</a></p>
<h3 id="TONGYI-Lingma"><a href="#TONGYI-Lingma" class="headerlink" title="TONGYI Lingma"></a>TONGYI Lingma</h3><p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/c40853c1d9944207ca97eee63bd6e856502f0d9c18031755fcf12a0b7a3ba596" alt></p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/82cd09aef5ea8d0ec2faa774ee547a73.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1279&#x2026;</a></p>
<p>&#x4F7F;&#x7528;&#x8BC4;&#x4EF7;&#xFF1A; &#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</p>
<p>&#x63A8;&#x8350;&#x7406;&#x7531;&#xFF1A;&#x751F;&#x6210;&#x5355;&#x6D4B;&#x3001;&#x6CE8;&#x91CA;&#x7B49;&#x90FD;&#x4E0D;&#x9519;</p>
<p>&#x5B98;&#x7F51;&#x5730;&#x5740;&#xFF1A;<a href="/external_links/98cdb85717b42ad4192d19c49ed7ef4e.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1780&#x2026;</a></p>
<p>&#x7279;&#x522B;&#x8BF4;&#x660E;&#xFF1A;&#x8FD9;&#x4E9B;&#x63D0;&#x793A;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x548C;&#x9884;&#x671F;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x662F;&#x6709;&#x51FA;&#x5165;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x9700;&#x5220;&#x9664;&#x91CD;&#x5199;&#xFF01;&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x5199;&#x5DE5;&#x5177;&#x7C7B;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#xFF1B;&#x4F46;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x8FD8;&#x662F;&#x5F97;&#x81EA;&#x5DF1;&#x6162;&#x6162;&#x5199;</p>
<h2 id="1-15-&#x4E3B;&#x9898;&#x8272;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;"><a href="#1-15-&#x4E3B;&#x9898;&#x8272;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;" class="headerlink" title="1.15 &#x4E3B;&#x9898;&#x8272;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;"></a>1.15 &#x4E3B;&#x9898;&#x8272;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;</h2><p>&#x4E0E;&#x4E3B;&#x9898;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x9009;&#x62E9;&#x4E00;&#x6B3E;</p>
<table>
<thead>
<tr>
<th>&#x63D2;&#x4EF6;</th>
<th>&#x53C2;&#x8003;</th>
<th>&#x5B98;&#x7F51;&#x5730;&#x5740;</th>
</tr>
</thead>
<tbody><tr>
<td># Copilot Dark Theme</td>
<td></td>
<td><a href="/external_links/7cee5bf0c023c4d6c8863356ac29e15a.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1953&#x2026;</a></td>
</tr>
</tbody></table>
<p>&#x5173;&#x4E8E;&#x4E3B;&#x9898;&#x76F8;&#x5173;&#xFF0C; &#x63D2;&#x4EF6;&#x5E02;&#x573A;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#xFF1A;</p>
<p><a href="/external_links/63a4377f659093c665dfd668e5ad0b72.html" target="blank" rel="noopener">plugins.jetbrains.com/search?tags&#x2026;</a></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e86bd858939a1b04ad2a7e2987fe4ae55a175df798d8cd6bad01817957c53494" alt></p>
<h2 id="1-16-&#x5176;&#x4ED6;&#x63D2;&#x4EF6;"><a href="#1-16-&#x5176;&#x4ED6;&#x63D2;&#x4EF6;" class="headerlink" title="1.16 &#x5176;&#x4ED6;&#x63D2;&#x4EF6;"></a>1.16 &#x5176;&#x4ED6;&#x63D2;&#x4EF6;</h2><p>&#x63D2;&#x4EF6;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x4E00;&#x4E00;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x63D2;&#x4EF6;&#x4E5F;&#x7528;&#x5F97;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x4F7F;&#x7528;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x63D2;&#x4EF6;</th>
<th>&#x63CF;&#x8FF0;</th>
<th>&#x63A8;&#x8350;</th>
<th>&#x5B98;&#x7F51;&#x5730;&#x5740;</th>
</tr>
</thead>
<tbody><tr>
<td>GitToolBox</td>
<td>&#x589E;&#x52A0;git&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;commit</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/15cdc8f52fbc4a0717011e52a90c8132.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/7499&#x2026;</a></td>
</tr>
<tr>
<td>Mybatis Log&#xFF08;&#x6536;&#x8D39;&#xFF09;</td>
<td>&#x6062;&#x590D; mybatis/ibatis sql&#x65E5;&#x5FD7;&#x4E3A;&#x5B8C;&#x6574;&#x7684;&#x53EF;&#x6267;&#x884C;sql&#x8BED;&#x53E5;;  &#x628A;sql&#x65E5;&#x5FD7;&#x91CC;&#x9762;&#x7684;?&#x66FF;&#x6362;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x503C;.&#x7B49;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/be704e1cefc13e3262bd387c542153cb.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1390&#x2026;</a></td>
</tr>
<tr>
<td>Private Notes</td>
<td>&#x5BF9;&#x6E90;&#x7801;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#xFF0C;&#x5BF9;&#x559C;&#x6B22;&#x7814;&#x7A76;&#x6E90;&#x7801;&#x7684;&#x540C;&#x5B66;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/3e5e5453dce85ac2d5b29dd377422065.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1787&#x2026;</a></td>
</tr>
<tr>
<td>JUnitGenerator</td>
<td>&#x5FEB;&#x901F;&#x751F;&#x6210;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x63D2;&#x4EF6;&#x3002;&#x4F46;&#x662F;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x65F6;&#x5019;&#x5DEE;&#x4E00;&#x70B9;&#x610F;&#x601D;&#x3002;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/c103ea98c158c838f6489a267d3596e1.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/3064&#x2026;</a></td>
</tr>
<tr>
<td>SequenceDiagram</td>
<td>&#x5FEB;&#x901F;&#x751F;&#x6210;&#x65F6;&#x5E8F;&#x56FE;&#xFF1B;&#x4F46;&#x751F;&#x6210;&#x7684;&#x9897;&#x7C92;&#x5EA6;&#x548C;&#x9884;&#x671F;&#x7684;&#x8FD8;&#x662F;&#x6709;&#x5DEE;&#x8DDD;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8F85;&#x52A9;&#x4F5C;&#x7528;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/6543053e2713d82f9e29ee6f424b6dae.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/8286&#x2026;</a></td>
</tr>
<tr>
<td>jclasslib Bytecode Viewer</td>
<td>&#x5B57;&#x8282;&#x7801;&#x53EF;&#x89C6;&#x5316;&#x3002; &#x53EF;&#x4EE5;&#x5C06; Java&#x7C7B;&#x7F16;&#x8BD1;&#x6210;&#x5B57;&#x8282;&#x7801;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/ab31bf9ed63633fb7da7a9fe81d7df0d.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/9248&#x2026;</a></td>
</tr>
<tr>
<td>CodeGlance Pro</td>
<td>&#x53F3;&#x8FB9;&#x5C55;&#x793A;&#x4EE3;&#x7801;&#x6574;&#x4F53;&#x6846;&#x67B6;&#x7684;&#x7F29;&#x7565;&#x56FE;&#xFF1B;&#x7528;&#x5904;&#x4E0D;&#x5927;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x540C;&#x6B65;&#x6ED1;&#x52A8;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/ee5ec3195249dc7fbcd19c1449d6a79e.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/1882&#x2026;</a></td>
</tr>
<tr>
<td>GenerateSerialVersionUID</td>
<td>&#x4E00;&#x952E;&#x4E3A;&#x5B9E;&#x73B0; Serializable &#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x751F;&#x6210; SerialVersionUID</td>
<td>&#x1F31F;&#x1F31F;&#x1F31F;</td>
<td><a href="/external_links/e573f1dac87c6ca0f1bc89787dd2adb8.html" target="blank" rel="noopener">plugins.jetbrains.com/plugin/185-&#x2026;</a></td>
</tr>
</tbody></table>
<p>&#x5176;&#x4ED6;&#x7684;&#x63D2;&#x4EF6;&#x6CA1;&#x6709;&#x7528;&#x8FC7;&#x6216;&#x8005;&#x7528;&#x7684;&#x5F88;&#x5C11;&#xFF0C;&#x5C31;&#x4E0D;&#x518D;&#x63A8;&#x8350;&#x4E86;&#x3002;&#x540E;&#x7EED;&#x6709;&#x518D;&#x8FDB;&#x884C;&#x8865;&#x5145;&#xFF01;</p>
<h2 id="1-17-&#x53D1;&#x73B0;&#x66F4;&#x591A;"><a href="#1-17-&#x53D1;&#x73B0;&#x66F4;&#x591A;" class="headerlink" title="1.17 &#x53D1;&#x73B0;&#x66F4;&#x591A;"></a>1.17 &#x53D1;&#x73B0;&#x66F4;&#x591A;</h2><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D2;&#x4EF6;&#x5E02;&#x573A;&#x641C;&#x7D22;&#x66F4;&#x591A;&#x63D2;&#x4EF6;&#x3002;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x3001;&#x4E0B;&#x8F7D;&#x4F7F;&#x7528;&#x7B49;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x63D2;&#x4EF6;&#x3002;<a href="/external_links/63a4377f659093c665dfd668e5ad0b72.html" target="blank" rel="noopener">Themes for IntelliJ-based IDEs | JetBrains Marketplace</a></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/2cd9adfe0f7c152e10d5e7137ee97beff629b42b9d2fdc2a05faa0e34a2b62ef" alt></p>
<p><strong>&#x6700;&#x540E;&#xFF1A;&#x5DE5;&#x5177;&#x7528;&#x5F97;&#x597D;&#xFF0C;&#x4E0B;&#x73ED;&#x4E0B;&#x5F97;&#x65E9;&#xFF0C;&#x63D2;&#x4EF6;&#x867D;&#x597D;&#xFF0C;&#x53EF;&#x4E0D;&#x8981;&#x8D2A;&#x676F;&#x54E6;&#xFF0C; &#x4E0D;&#x7136; idea &#x4F1A;&#x5403;&#x5185;&#x5B58;&#x7684;!</strong></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/192a892fdbd97225fcbe6a3709a6c811.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338706453059911716.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338706453059911716.html" itemprop="url">做副业要建立正反馈，先赚到一块钱</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-24T10:06:17+08:00">
                2024-02-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/ac42594dd6f9a962047b8d14f3300724bb4c6734e50e645f5250028923b35638" alt="&#x5FC5;&#x770B;&#x5927;&#x5B57;&#x6700;&#x65B0;&#x6D88;&#x606F;&#x91CD;&#x78C5;&#x516C;&#x4F17;&#x53F7;&#x9996;&#x56FE;(2).jpg"></p>
<blockquote>
<p>&#x672C;&#x6587;&#x9996;&#x53D1;&#x4E8E;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<a href="/external_links/507abbb697fdc0ff8c3af1098c65bc9d.html" target="blank" rel="noopener">&#x561F;&#x7237;&#x521B;&#x4E1A;&#x65E5;&#x8BB0;</a> &#x3002; &#x6211;&#x5DF2;&#x7ECF;&#x575A;&#x6301;&#x65E5;&#x66F4;120&#x5929;+&#xFF0C;&#x6B22;&#x8FCE;&#x8FC7;&#x6765;&#x8FFD;&#x5267;~</p>
</blockquote>
<p>&#x8FD9;&#x4E24;&#x5929;&#x526F;&#x4E1A;&#x793E;&#x7FA4;&#x8FDB;&#x6765;&#x7684;&#x4EBA;&#x633A;&#x591A;&#xFF0C;&#x6211;&#x6709;&#x5411;&#x793E;&#x7FA4;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x5F00;&#x653E;&#x4E00;&#x4E9B;&#x6211;&#x7684;&#x4EA7;&#x54C1;&#x7684;&#x5206;&#x9500;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x3010;<strong>&#x4E07;&#x7269;&#x7686;&#x53EF;CPS</strong>&#x3011;&#xFF0C;&#x8FD9;&#x4E0D;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x5C31;&#x6709;&#x7FA4;&#x53CB;&#x51FA;&#x5355;&#x4E86;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/b68f5d4268f3b9c886e302451b96c969bf916d1ca2502977314fa215a8073970" alt="&#x56FE;&#x7247;"></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/826d3c68db4e8d167f74c6faf1b959afd22fe9660452920978d6f4db6d882d90" alt="&#x56FE;&#x7247;"></p>
<p>&#x6211;&#x4E00;&#x76F4;&#x548C;&#x5927;&#x5BB6;&#x63D0;&#x5230;&#x6B63;&#x53CD;&#x9988;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x90A3;&#x4E9B;&#x8FD8;&#x6CA1;&#x4ECE;&#x526F;&#x4E1A;&#x4E0A;&#x8D5A;&#x5230;&#x94B1;&#x7684;&#x4EBA;&#x5C24;&#x5176;&#x91CD;&#x8981;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x6709;GPT4&#x8D26;&#x53F7;&#x670D;&#x52A1;&#x5417;&#xFF0C;&#x8FD9;&#x4E2A;&#x7FA4;&#x53CB;&#x6709;&#x540C;&#x4E8B;&#x9700;&#x8981;&#xFF0C;&#x627E;&#x6211;&#x4E70;&#xFF0C;&#x6211;&#x770B;&#x5BF9;&#x65B9;&#x600E;&#x4E48;&#x8F6C;&#x6211;&#x539F;&#x4EF7;&#xFF0C;&#x5356;&#x7ED9;&#x540C;&#x4E8B;&#x539F;&#x4EF7;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x7ED9;&#x4ED6;&#x6307;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x5E72;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8BA9;&#x81EA;&#x5DF1;&#x8D5A;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x7BA1;&#x591A;&#x5C11;&#xFF0C;&#x8981;&#x80FD;&#x8D5A;&#x5230;&#x94B1;&#x8FD9;&#x4E2A;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p><strong>&#x8D5A;&#x5230;&#x7B2C;&#x4E00;&#x5FEB;&#x94B1;&#x662F;&#x8D5A;&#x94B1;&#x8DEF;&#x4E0A;&#x7684;&#x8D28;&#x53D8;</strong>&#xFF0C;&#x6709;&#x4E86;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#x7684;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x771F;&#x7684;&#x76F8;&#x4FE1;&#xFF0C;&#x539F;&#x6765;&#x9664;&#x4E86;&#x6253;&#x5DE5;&#x4E0A;&#x73ED;&#x8D5A;&#x5DE5;&#x8D44;&#xFF0C;&#x771F;&#x7684;&#x6709;&#x5176;&#x4ED6;&#x8D5A;&#x94B1;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#xFF0C;&#x610F;&#x4E49;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x9EBB;&#x96C0;&#x867D;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x95ED;&#x73AF;&#x5DF2;&#x7ECF;&#x5F62;&#x6210;&#xFF0C;<strong>&#x6D41;&#x91CF;-&#x4EA7;&#x54C1;-&#x53D8;&#x73B0;</strong>&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x4F60;&#x505A;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x8981;&#x56F4;&#x7ED5;&#x8FD9;&#x4E2A;&#x6765;&#x5C55;&#x5F00;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x8D5A;&#x591A;&#x8D5A;&#x5C11;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x6B63;&#x53CD;&#x9988;&#x540E;&#xFF0C;&#x4F1A;&#x8BA9;&#x4F60;&#x7231;&#x4E0A;&#x8D5A;&#x94B1;&#xFF0C;&#x8D5A;&#x94B1;&#x5176;&#x5B9E;&#x6CA1;&#x90A3;&#x4E48;&#x96BE;&#xFF0C;<strong>&#x65E0;&#x975E;&#x5C31;&#x662F;&#x628A;&#x5408;&#x9002;&#x7684;&#x4EA7;&#x54C1;&#x5356;&#x7ED9;&#x9700;&#x8981;&#x7684;&#x4EBA;</strong>&#x3002;&#x53D8;&#x73B0;&#x7684;&#x8DEF;&#x5F84;&#x5176;&#x5B9E;&#x8D8A;&#x77ED;&#x8D8A;&#x597D;&#xFF0C;&#x4E2D;&#x95F4;&#x6B65;&#x9AA4;&#x5982;&#x679C;&#x592A;&#x591A;&#xFF0C;&#x4FDD;&#x4E0D;&#x51C6;&#x54EA;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x64CD;&#x4F5C;&#x53D8;&#x5F62;&#xFF0C;&#x5BFC;&#x81F4;&#x4F60;&#x6574;&#x4F53;&#x7684;&#x53D8;&#x73B0;&#x6982;&#x7387;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x53EF;&#x80FD;&#x4E5F;&#x5C1D;&#x8BD5;&#x8FC7;&#x4E00;&#x4E9B;&#x9879;&#x76EE;&#xFF0C;&#x4F46;&#x662F;&#x6298;&#x817E;&#x4E86;&#x8BB8;&#x4E45;&#x8FD8;&#x662F;&#x6CA1;&#x8D5A;&#x5230;&#x94B1;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x6B63;&#x53CD;&#x9988;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x575A;&#x6301;&#x662F;&#x5341;&#x5206;&#x75DB;&#x82E6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x6709;&#x5F88;&#x5F3A;&#x70C8;&#x7684;&#x8D5A;&#x94B1;&#x6B32;&#x671B;&#x3002;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8BA9;&#x6B63;&#x53CD;&#x9988;&#x6765;&#x5F97;&#x5FEB;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x6765;&#x5F97;&#x5FEB;&#xFF1F;</p>
<p>&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x628A;&#x5927;&#x76EE;&#x6807;&#x62C6;&#x89E3;&#x6210;&#x5C0F;&#x76EE;&#x6807;&#xFF0C;&#x5F62;&#x6210;&#x5C0F;&#x800C;&#x591A;&#x6B21;&#x7684;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x4E00;&#x6B21;&#x7684;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x79CD;&#x6210;&#x529F;&#x7684;&#x6EE1;&#x8DB3;&#x611F;&#x4F1A;&#x8BA9;&#x4F60;&#x66F4;&#x6709;&#x52A8;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x6E38;&#x620F;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6253;&#x6E38;&#x620F;&#x4F1A;&#x4E0A;&#x763E;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x5546;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x79CD;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x6EE1;&#x8DB3;&#x7684;&#x53CD;&#x9988;&#x3002;&#x5347;&#x7EA7;&#x4E86;&#x4F60;&#x5C5E;&#x6027;&#x53D8;&#x5F3A;&#x4E86;&#xFF0C;&#x6253;&#x5230;&#x597D;&#x88C5;&#x5907;&#x4E86;&#x4F60;&#x53C8;&#x53D8;&#x5F3A;&#x4E86;&#xFF0C;&#x9053;&#x7406;&#x662F;&#x76F8;&#x901A;&#x3002;</p>
<p>&#x6211;&#x6700;&#x8FD1;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x8BDD;&#xFF0C;&#x633A;&#x6709;&#x610F;&#x601D;&#xFF1A;</p>
<blockquote>
<p>&#x56E0;&#x4E3A;&#x7A77;&#x5F00;&#x59CB;&#x5728;&#x7F51;&#x4E0A;&#x627E;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x7F3A;&#x94B1;&#x5E26;&#x6765;&#x7684;&#x5F3A;&#x70C8;&#x8D5A;&#x94B1;&#x6B32;&#x671B;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5DE8;&#x5927;&#x7684;&#x8D5A;&#x94B1;&#x4F18;&#x52BF;&#xFF0C;&#x8FD9;&#x79CD;&#x6B32;&#x671B;&#x4F1A;&#x903C;&#x7740;&#x4F60;&#x628A;&#x81EA;&#x5DF1;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5F88;&#x4F4E;&#x7684;&#x59FF;&#x6001;&#x548C;&#x5FC3;&#x7406;&#x4E0A;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x8D5A;&#x94B1;&#x6B32;&#x671B;&#x7684;&#x4EBA;&#xFF0C;&#x7A0D;&#x5FAE;&#x78B0;&#x5230;&#x70B9;&#x56F0;&#x96BE;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x4E0D;&#x7B26;&#x5185;&#x5FC3;&#x4EBA;&#x8BBE;&#x7684;&#x4E8B;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x9000;&#x5230;&#x539F;&#x70B9;&#xFF0C;&#x53CD;&#x6B63;&#x9009;&#x62E9;&#x4E5F;&#x591A;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x56DE;&#x987E;&#x4E86;&#x4E0B;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;&#x505A;&#x526F;&#x4E1A;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x8FD9;&#x4E48;&#x5F3A;&#x70C8;&#x7684;&#x8D5A;&#x94B1;&#x6B32;&#x671B;&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x771F;&#x662F;&#x56E0;&#x4E3A;&#x592A;&#x7A77;&#x4E86;&#xFF0C;&#x5403;&#x8FC7;&#x751F;&#x6D3B;&#x7684;&#x82E6;&#xFF0C;&#x4EE5;&#x540E;&#x4E0D;&#x60F3;&#x518D;&#x5403;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x5F00;&#x5E72;&#x4E86;&#xFF0C; &#x5E76;&#x4E14;&#x8FD9;&#x79CD;&#x6B32;&#x671B;&#x8DB3;&#x591F;&#x5F3A;&#x70C8;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6BD4;&#x8F83;&#x8010;&#x63CD;&#xFF0C;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x4E86;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x6C14;&#x9981;&#x3002;&#x8D5A;&#x5230;&#x94B1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x975E;&#x5E38;&#x5F00;&#x5FC3;&#xFF0C;&#x8FD9;&#x6837;&#x53CD;&#x590D;&#x5FAA;&#x73AF;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x5C31;&#x52A0;&#x5F3A;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x8FD8;&#x662F;&#x559C;&#x6B22;&#x8D5A;&#x94B1;&#xFF0C;&#x4E0D;&#x7BA1;&#x591A;&#x5C11;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x505A;&#x526F;&#x4E1A;&#xFF0C;&#x5FC3;&#x6001;&#x8981;&#x6446;&#x6B63;&#xFF0C;&#x8001;&#x624B;&#x548C;&#x65B0;&#x624B;&#x7684;&#x533A;&#x522B;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5728;&#x5FC3;&#x6001;&#x4E0A;&#xFF0C;&#x65B0;&#x624B;&#x9047;&#x5230;&#x632B;&#x6298;&#x5BB9;&#x6613;&#x653E;&#x5F03;&#xFF0C;&#x8001;&#x624B;&#x662F;&#x53BB;&#x603B;&#x7ED3;&#x95EE;&#x9898;&#x91CD;&#x65B0;&#x4E0A;&#x8DEF;&#x3002;</p>
<p><strong>&#x5931;&#x8D25;&#x662F;&#x5E38;&#x6001;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6536;&#x83B7;</strong>&#x3002;&#x8981;&#x5B66;&#x4F1A;&#x4ECE;&#x5931;&#x8D25;&#x7684;&#x75DB;&#x82E6;&#x4E2D;&#x89C9;&#x9192;&#xFF0C;&#x627E;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#x4E0E;&#x63D0;&#x9AD8;&#x7A7A;&#x95F4;&#x3002;&#x8981;&#x5B66;&#x4F1A;&#x5728;&#x5931;&#x8D25;&#x7684;&#x6EE1;&#x5730;&#x72FC;&#x85C9;&#x4E2D;&#x5BFB;&#x627E;&#x53EF;&#x91C7;&#x7EB3;&#x7684;&#x6559;&#x8BAD;&#x4E0E;&#x542F;&#x53D1;&#xFF0C;&#x8FD9;<strong>&#x4E9B;&#x90FD;&#x662F;&#x4E0B;&#x4E00;&#x6B21;&#x80DC;&#x5229;&#x7684;&#x57FA;&#x77F3;</strong>&#x3002;</p>
<p>&#x6211;&#x662F;&#x561F;&#x561F;MD&#xFF0C;6&#x5E74;&#x526F;&#x4E1A;&#x7ECF;&#x9A8C;&#xFF0C;&#x9177;&#x7231;&#x7761;&#x540E;&#x6536;&#x5165;&#x6A21;&#x5F0F;&#x7814;&#x7A76;&#xFF0C;&#x7D2F;&#x8BA1;&#x526F;&#x4E1A;&#x6536;&#x5165;&#x7834;&#x767E;&#x4E07;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x7231;&#x770B;&#x4E00;&#x4E9B;&#x526F;&#x4E1A;&#x8BA4;&#x77E5;&#xFF0C;&#x70B9;&#x4E2A;&#x8D5E;&#xFF0C;&#x6211;&#x4EE5;&#x540E;&#x591A;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/9d9df8ba8febba5454670d2233237374.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338635448304091151.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338635448304091151.html" itemprop="url">Coze 扣子   AI 养育计划 - "Flutter 大</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-24T09:50:26+08:00">
                2024-02-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6263;&#x5B50;&#xFF08;coze.cn&#xFF09;&#x662F;&#x4E00;&#x6B3E;&#x7528;&#x6765;&#x5F00;&#x53D1;&#x65B0;&#x4E00;&#x4EE3; AI Chat Bot &#x7684;&#x5E94;&#x7528;&#x7F16;&#x8F91;&#x5E73;&#x53F0;&#x3002;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x5E93;&#x4EE5;&#x53CA;&#x4F5C;&#x4E3A;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x8BA9; AI Bot &#x62E5;&#x6709;&#x6211;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x7684; &#x201C;&#x667A;&#x6167;&#x201D;&#xFF0C;&#x5C82;&#x4E0D;&#x662F;&#x4E00;&#x4F4D; <strong>Flutter &#x5927;&#x5E08;</strong> &#x561B;&#x3002;&#x6BD5;&#x7ADF;&#x8FDE;&#x6211;&#x81EA;&#x5DF1;&#x53EF;&#x80FD;&#x90FD;&#x8BB0;&#x4E0D;&#x6E05;&#xFF0C;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x6587;&#x7AE0;&#x91CC;&#x7684;&#x77E5;&#x8BC6;&#x7EC6;&#x8282;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x548C;&#x8FD9;&#x79CD; &#x201C;&#x77E5;&#x8BC6;&#x602A;&#x7269;&#x201D; &#x4EA4;&#x6D41;&#xFF0C;&#x80AF;&#x5B9A;&#x80FD;&#x6709;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x53E6;&#x5916;&#x6709;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8BA9;&#x8BFB;&#x8005;&#x8BFB;&#x5B8C;&#x6211;&#x6240;&#x6709;&#x7684;&#x6587;&#x7AE0;&#x5E76;&#x7406;&#x89E3;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x8270;&#x96BE;&#x7684;&#x4E8B;&#x3002;  </p>
<p>&#x4F46;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x5411;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6211;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x77E5;&#x8BC6;&#x7684; <strong>Flutter &#x5927;&#x5E08;</strong> &#x63D0;&#x95EE;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x56DE;&#x7B54;&#xFF0C;&#x4F1A;&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x68D2;&#x7684;&#x4E8B;&#x3002;</p>
</blockquote>
<hr>
<h4 id="&#x4E00;&#x3001;Flutter-&#x5927;&#x5E08;&#x7684;&#x8BDE;&#x751F;"><a href="#&#x4E00;&#x3001;Flutter-&#x5927;&#x5E08;&#x7684;&#x8BDE;&#x751F;" class="headerlink" title="&#x4E00;&#x3001;Flutter &#x5927;&#x5E08;&#x7684;&#x8BDE;&#x751F;"></a>&#x4E00;&#x3001;Flutter &#x5927;&#x5E08;&#x7684;&#x8BDE;&#x751F;</h4><p>&#x6CE8;&#x518C;&#x767B;&#x5F55;&#x5230;&#x6263;&#x5B50;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <strong>&#x521B;&#x5EFA; Bot</strong> &#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4F4D; <code>Flutter &#x5927;&#x5E08;</code> &#x7684; &#x201C;&#x5C0F;&#x5A74;&#x513F;&#x201D;&#x3002;&#x5728;&#x6B64;&#x4E3A;&#x8FD9;&#x4E2A; AI Bot &#x8D77;&#x4E2A;&#x5C0F;&#x540D;&#x53EB;&#xFF1A; <strong>Toly</strong></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/e94bb9cacb795ffa521537f9a11782752abfd32f0869552b44b091c3c5982f21" alt="image.png"></p>
<p>&#x521B;&#x5EFA;&#x5B8C;&#x540E;&#x53EF;&#x4EE5;&#x5728;&#x4E2A;&#x4EBA;&#x7A7A;&#x95F4;&#xFF0C;&#x67E5;&#x770B;&#x8FD9;&#x4F4D;&#x5904;&#x4E8E;&#x840C;&#x65B0;&#x9636;&#x6BB5;&#x7684; <code>Flutter &#x5927;&#x5E08; - Toly</code> &#x3002;&#x521B;&#x5EFA;&#x65F6;&#x53EF;&#x4EE5; AI &#x6839;&#x636E;&#x63CF;&#x8FF0;&#x751F;&#x6210;&#x56FE;&#x6807;&#x8FD8;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x90A3;&#x4E48;&#x7CBE;&#x786E;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/fbdfbb09cd49364135f5ba105fdf650eca16c88455a7b9074fcec0dce81a533a" alt="image.png"></p>
<hr>
<p>&#x70B9;&#x8FDB;&#x53BB;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x57DF;&#xFF1A;</p>
<ul>
<li>&#x7F16;&#x6392;&#x533A;&#x57DF; : &#x63D0;&#x793A;&#x8BCD;&#x7684;&#x7F16;&#x6392;&#xFF0C;&#x8BBE;&#x8BA1; Toly &#x7684;&#x4EBA;&#x8BBE;&#x548C;&#x529F;&#x80FD;</li>
<li>&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x533A;&#x57DF;&#xFF1A;</li>
<li>&#x9884;&#x89C8;&#x8C03;&#x8BD5;&#x533A;&#x57DF;&#xFF1A;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/55cda232b72413ff945c3ac5f344e1cca18e025d513d4f46c20babd8650ba00b" alt="image.png"></p>
<hr>
<h4 id="&#x4E8C;&#x3001;&#x5582;&#x517B;&#x672A;&#x6765;&#x7684;-Flutter-&#x5927;&#x5E08;"><a href="#&#x4E8C;&#x3001;&#x5582;&#x517B;&#x672A;&#x6765;&#x7684;-Flutter-&#x5927;&#x5E08;" class="headerlink" title="&#x4E8C;&#x3001;&#x5582;&#x517B;&#x672A;&#x6765;&#x7684; Flutter &#x5927;&#x5E08;"></a>&#x4E8C;&#x3001;&#x5582;&#x517B;&#x672A;&#x6765;&#x7684; <code>Flutter &#x5927;&#x5E08;</code></h4><p>&#x867D;&#x7136;&#x6263;&#x5B50;&#x7684; AI Bot &#x6709;&#x4E00;&#x5B9A;&#x7684;&#x77E5;&#x8BC6;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x6BD5;&#x7ADF;&#x5E76;&#x4E0D;&#x662F;&#x4E13;&#x4E1A;&#x7684;&#x3002;&#x73B0;&#x5728;&#x770B;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x5582;&#x4ED6;&#x4E00;&#x4E9B;&#x7CBE;&#x786E;&#x7684;&#x3001;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x7ED9;&#x4E0E;&#x4ED6;&#x4E13;&#x4E1A;&#x7684; &#x201C;&#x8BB0;&#x5FC6;&#x201D; &#x80FD;&#x529B;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;<strong>&#x6784;&#x5EFA;&#x77E5;&#x8BC6;&#x5E93;</strong>&#x6216;&#x8005;<strong>&#x6570;&#x636E;&#x5E93;</strong>&#xFF0C;&#x4F5C;&#x4E3A;&#x4ED6;&#x7684; &#x201C;&#x667A;&#x6167;&#x6E90;&#x6CC9;&#x201D; &#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/4dde68a72affe63d36fc3fdbc7ffb7b6e19d81235f2e866eea8b76be9f5a5411" alt="image.png"></p>
<hr>
<h5 id="1-&#x521B;&#x5EFA;&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x6536;&#x5F55;&#x6570;&#x636E;"><a href="#1-&#x521B;&#x5EFA;&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x6536;&#x5F55;&#x6570;&#x636E;" class="headerlink" title="1. &#x521B;&#x5EFA;&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x6536;&#x5F55;&#x6570;&#x636E;"></a>1. &#x521B;&#x5EFA;&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x6536;&#x5F55;&#x6570;&#x636E;</h5><p>&#x9996;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x77E5;&#x8BC6;&#x5E93;&#xFF0C;&#x5728; <code>&#x4E2A;&#x4EBA;&#x7A7A;&#x95F4;</code> &#x9876;&#x90E8;&#x6709; <code>&#x77E5;&#x8BC6;&#x5E93;</code> &#x7684;&#x9009;&#x9879;&#x5361;&#xFF0C;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x77E5;&#x8BC6;&#x5E93;&#x3002; &#x77E5;&#x8BC6;&#x5E93;&#x4E2D;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5404;&#x4E2A;&#x5206;&#x7C7B;&#x7684;&#x77E5;&#x8BC6;&#x96C6;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/fb9ea746745ba409620e5d0e51efd02d75675ee62e004b0b42af1fc9bcadd86a" alt="image.png"></p>
<p>&#x5BF9;&#x4E8E; Flutter &#x800C;&#x8A00;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F; Widget &#x7EC4;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x91CC;&#x62FF; <code>Flutter &#x7EC4;&#x4EF6;&#x96C6;&#x5F55;</code> &#x77E5;&#x8BC6;&#x5E93;&#x4E3A;&#x4F8B;&#x3002;&#x9700;&#x8981;&#x51C6;&#x5907;&#x77E5;&#x8BC6;&#x96C6;&#xFF0C;&#x521A;&#x597D;&#x672C;&#x4EBA;&#x5199;&#x8FC7;&#x5404;&#x79CD; Flutter &#x7EC4;&#x4EF6;&#x4F7F;&#x7528;&#x7684;&#x4EE5;&#x53CA;&#x6E90;&#x7801;&#x89E3;&#x6790;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x7D20;&#x6750;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/26eba5b9fdafbec69bf59f127634069e0b133309b71cdfd7667e3b277d5f5f54" alt="image.png"></p>
<p>&#x6DFB;&#x52A0;&#x6587;&#x7AE0;&#x7684; URL &#x5373;&#x53EF;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/b6ca8dd0be46252f7a79edd6ba6f997ec43372019094674ae1a5cb2438f8edbd" alt="image.png"></p>
<p>&#x7136;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x8BBF;&#x95EE;&#x6587;&#x7AE0;&#x94FE;&#x63A5;&#xFF0C;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/0838925b650cc693f832370c51a721b36acb0880d5df953a18dfd17a22b83581" alt="image.png"></p>
<p>&#x6700;&#x7EC8;&#x5206;&#x6BB5;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/efc8dbcf49022c3cd26f5eec20f0fba525134a2ddf252a3e655eda07768749a6" alt="image.png"></p>
<hr>
<h5 id="2-&#x77E5;&#x8BC6;&#x5E93;&#x7684;&#x4F7F;&#x7528;"><a href="#2-&#x77E5;&#x8BC6;&#x5E93;&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="2. &#x77E5;&#x8BC6;&#x5E93;&#x7684;&#x4F7F;&#x7528;"></a>2. &#x77E5;&#x8BC6;&#x5E93;&#x7684;&#x4F7F;&#x7528;</h5><p>&#x5728; <strong>&#x8BB0;&#x5FC6;</strong> &#x533A;&#x70B9;&#x51FB;&#x52A0;&#x53F7;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x77E5;&#x8BC6;&#x5E93;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/538c3e73d99174ebe515995e3faa238ac12b1bc862242d3067dc45defe2a1aff" alt="image.png"></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x6709;&#x65E0;&#x77E5;&#x8BC6;&#x5E93;&#x65F6;&#x63D0;&#x95EE; <strong>&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B; ColorFiltered &#x7EC4;&#x4EF6;&#x7684;&#x6E90;&#x7801;&#x5B9E;&#x73B0;</strong> &#x7684;&#x6548;&#x679C;:</p>
<table>
<thead>
<tr>
<th>&#x65E0;&#x77E5;&#x8BC6;&#x5E93;&#x65F6;</th>
<th>&#x6709;&#x77E5;&#x8BC6;&#x5E93;&#x65F6;</th>
</tr>
</thead>
<tbody><tr>
<td>image.png</td>
<td>image.png</td>
</tr>
</tbody></table>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x65E0;&#x77E5;&#x8BC6;&#x5E93;&#x65F6;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x76F8;&#x5F53;&#x4E8E;&#x778E;&#x8BCC;&#x4E86;&#xFF1B;&#x5F53;&#x6DFB;&#x52A0;&#x77E5;&#x8BC6;&#x5E93;&#x540E;&#xFF0C;&#x6709;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4F1A;&#x603B;&#x7ED3;&#x77E5;&#x8BC6;&#x5E93;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x8F93;&#x51FA;&#x3002;&#x4ECE;&#x800C;&#x56DE;&#x7B54;&#x66F4;&#x52A0;&#x7CBE;&#x51C6;&#xFF0C;&#x6240;&#x4EE5; <strong>&#x77E5;&#x8BC6;&#x5E93;&#x5C31;&#x76F8;&#x5F53;&#x4E8E; Toly &#x7684;&#x5927;&#x8111;</strong>&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x63D0;&#x95EE;&#x65F6;&#xFF0C;&#x5339;&#x914D;&#x5230;&#x7684; &#x201C;&#x77E5;&#x8BC6;&#x7247;&#x6BB5;&#x201D; &#x5C06;&#x4F1A;&#x547D;&#x4E2D;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/54ebf6dc39b121d75ba9426a18337452fd10ad612623adf1145ecacc6b1359b6" alt="image.png"></p>
<hr>
<h5 id="3-&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;"><a href="#3-&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;" class="headerlink" title="3. &#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;"></a>3. &#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;</h5><p>&#x6587;&#x5B57;&#x4F5C;&#x4E3A;&#x77E5;&#x8BC6;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x4E07;&#x53D8;&#x4E0D;&#x79BB;&#x5176;&#x5B97;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x90FD;&#x662F; <code>&#x5B57;&#x7B26;&#x8D44;&#x6E90;</code> &#x3002;&#x9664;&#x4E86;&#x901A;&#x8FC7; URL &#x722C;&#x53D6;&#x7F51;&#x9875;&#x8D44;&#x6E90;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x7684; <code>&#x6587;&#x672C;&#x5F62;&#x5F0F;</code> &#x548C; <code>&#x8868;&#x683C;&#x5F62;&#x5F0F;</code> , &#x53EF;&#x4EE5;&#x662F; PDF&#x3001;Text&#x3001;DocX &#x3001;Excel &#x7B49;&#x5F62;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F; json &#x5F62;&#x5F0F;&#x7684; api ; &#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x7F16;&#x8F91;&#x6587;&#x672C;&#x3001;&#x8868;&#x683C;&#x4F5C;&#x4E3A;&#x77E5;&#x8BC6;&#x5E93;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x6587;&#x672C;&#x5F62;&#x5F0F;</th>
<th>&#x8868;&#x683C;&#x5F62;&#x5F0F;</th>
</tr>
</thead>
<tbody><tr>
<td>image.png</td>
<td>image.png</td>
</tr>
</tbody></table>
<p>&#x6BCF;&#x4E2A;&#x7F51;&#x9875;&#x3001;&#x6587;&#x4EF6;&#x3001;&#x63A5;&#x53E3;&#x5185;&#x5BB9;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A; <strong>&#x5355;&#x5143;</strong>&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x4E2D;&#x4F1A;&#x8FDB;&#x884C;&#x5206;&#x6BB5;&#xFF0C;&#x901A;&#x8FC7; URL &#x6293;&#x53D6;&#x7684;&#x4F1A;&#x81EA;&#x52A8;&#x5206;&#x6BB5;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6BCF;&#x4E2A; <code>&#x5206;&#x6BB5;</code> &#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x65F6;&#x60F3;&#x5230;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x88AB;&#x547D;&#x4E2D;&#x4E86;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x6837;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x547D;&#x4E2D;&#x60C5;&#x51B5;&#xFF0C;&#x6765;&#x7EDF;&#x8BA1;&#x54EA;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x6BD4;&#x8F83; &#x201C;&#x6D3B;&#x8DC3;&#x201D;&#xFF0C;&#x611F;&#x89C9;&#x4E5F;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/ce98aa57c460c4f32ce64dbce9b00d5e5e4f2834426df98ff85c574233cc6f38" alt="image.png"></p>
<p>&#x4FD7;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C0F;&#x5B69;&#x5C31;&#x662F;&#x56DB;&#x811A;&#x541E;&#x91D1;&#x517D;&#xFF0C;&#x751F;&#x513F;&#x96BE;&#xFF0C;&#x517B;&#x513F;&#x66F4;&#x96BE;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x67AF;&#x71E5;&#x4E4F;&#x5473;&#x7684;&#x517B;&#x513F;&#x8FC7;&#x7A0B;&#x4E86;&#xFF0C;&#x5582;&#x98DF;&#x5404;&#x79CD; Flutter &#x9886;&#x57DF;&#x4F18;&#x79C0;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6765;&#x8BA9; Toly &#x6709;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x77E5;&#x8BC6;&#x5E93;&#x3002;&#x6210;&#x4E3A;&#x771F;&#x6B63;&#x7684; <strong>&#x201C;Flutter &#x5927;&#x5E08;&#x201D;</strong> &#x3002;</p>
<hr>
<h4 id="&#x4E09;&#x3001;&#x8BED;&#x4E49;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;"><a href="#&#x4E09;&#x3001;&#x8BED;&#x4E49;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;" class="headerlink" title="&#x4E09;&#x3001;&#x8BED;&#x4E49;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;"></a>&#x4E09;&#x3001;&#x8BED;&#x4E49;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;</h4><p>&#x5728;&#x8BB0;&#x5FC6;&#x4E2D;&#x6709;&#x53E6;&#x4E00;&#x79CD; &#x201C;&#x77E5;&#x8BC6;&#x201D; &#x7684;&#x5B58;&#x50A8;&#x5F62;&#x5F0F; &#x2013; <code>&#x6570;&#x636E;&#x5E93;</code>&#x3002; &#x7528;&#x6237;&#x53EF;&#x901A;&#x8FC7;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x63D2;&#x5165;&#x548C;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4FBF;&#x6377;&#x5730;&#x4E0E; Bot &#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/8dc94fafa8e37687ed00b314a2d4893dd2a69fdf9f26bf23f10ae0be05681986" alt="image.png"></p>
<hr>
<h5 id="1-&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x548C;&#x63D2;&#x5165;&#x5185;&#x5BB9;"><a href="#1-&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x548C;&#x63D2;&#x5165;&#x5185;&#x5BB9;" class="headerlink" title="1. &#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x548C;&#x63D2;&#x5165;&#x5185;&#x5BB9;"></a>1. &#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x548C;&#x63D2;&#x5165;&#x5185;&#x5BB9;</h5><p>&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8868;&#x683C;&#x6765;&#x8BB0;&#x5F55;&#x53EA;&#x662F;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x91CC;&#x521B;&#x5EFA; flutter_points &#x7684;&#x8BB0;&#x5F55;&#x8868;&#xFF0C;&#x7531;&#x4E09;&#x4E2A;&#x5B57;&#x6BB5;&#xFF1A;&#x6807;&#x9898;&#x3001;&#x5185;&#x5BB9;&#x548C;&#x7C7B;&#x522B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/bc90919bf7f921ae8a93fd3d4f351af8bf7295644e89e18d17528367ad8a0d55" alt="image.png"></p>
<hr>
<p>&#x7136;&#x540E;&#x901A;&#x8FC7;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x5185;&#x5BB9;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF1A;</p>
<blockquote>
<p>&#x540D;&#x79F0;&#xFF1A; Flutter &#x5347;&#x7EA7;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5185;&#x5BB9;&#xFF1A; flutter upgrade&#xFF0C;&#x7C7B;&#x522B;&#xFF1A;&#x547D;&#x4EE4;&#x884C;  </p>
<p>&#x540D;&#x79F0;&#xFF1A; &#x67E5;&#x770B; Flutter &#x7248;&#x672C;&#xFF0C;&#x5185;&#x5BB9;&#xFF1A; flutter &#x2013;version&#xFF0C;&#x7C7B;&#x522B;&#xFF1A;&#x547D;&#x4EE4;&#x884C;  </p>
<p>&#x540D;&#x79F0;&#xFF1A; flutter &#x4E09;&#x65B9;&#x5E93;&#x7684;&#x5B98;&#x7F51;&#xFF0C;&#x5185;&#x5BB9;&#xFF1A;<code>https://pub.dev/</code> &#xFF0C;&#x7C7B;&#x522B;&#xFF1A;&#x8D44;&#x6E90;  </p>
<p>&#x540D;&#x79F0;&#xFF1A; flutter &#x5F00;&#x6E90;&#x5730;&#x5740;&#xFF0C;&#x5185;&#x5BB9;&#xFF1A;<code>https://github.com/flutter/flutter</code> &#xFF0C;&#x7C7B;&#x522B;&#xFF1A;&#x8D44;&#x6E90;</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x5185;&#x5BB9;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/dbd475bb44839894c63f2cf7bc7bfb1400028d7bff3a8638689682ecc46b49df" alt="image.png"></p>
<p>&#x901A;&#x8FC7;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x662F;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/0ef55e7773ef59be03f6a74dd5690de7d465056cb1f1a7513a673957d96f09e0" alt="image.png"></p>
<hr>
<h5 id="2-&#x5220;&#x9664;&#x5185;&#x5BB9;"><a href="#2-&#x5220;&#x9664;&#x5185;&#x5BB9;" class="headerlink" title="2. &#x5220;&#x9664;&#x5185;&#x5BB9;"></a>2. &#x5220;&#x9664;&#x5185;&#x5BB9;</h5><p>&#x540C;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6765;&#x5220;&#x9664;&#x6216;&#x6E05;&#x7A7A;&#x6570;&#x636E;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x8BE6;&#x60C5;&#x4E2D;&#x770B;&#x51FA;&#xFF0C;&#x6263;&#x5B50;&#x662F;&#x7406;&#x89E3;&#x8BED;&#x4E49;&#x540E;&#x901A;&#x8FC7; sql &#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x6807;&#x9898;</th>
<th></th>
</tr>
</thead>
<tbody><tr>
<td>image.png</td>
<td>image.png</td>
</tr>
</tbody></table>
<p>&#x4F46;&#x662F;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x76EE;&#x524D;&#x7684;&#x652F;&#x6301;&#x7A0B;&#x5EA6;&#x4E0D;&#x592A;&#x5B8C;&#x5584;&#xFF0C;&#x53EA;&#x80FD;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x65F6;&#x5019;&#x8BED;&#x53E5;&#x7684;&#x8BC6;&#x522B;&#x4E0D;&#x592A;&#x7CBE;&#x51C6;&#x3002;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x8BA9;&#x5F00;&#x53D1;&#x8005;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x6807;&#x8BC6;&#x7B26;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x65B9;&#x4FBF;&#x6807;&#x8BC6;&#x3002;&#x6E05;&#x7A7A;&#x6570;&#x636E;&#x5E93;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x4E0D;&#x8FC7;&#x76F8;&#x4FE1;&#x4EE5;&#x540E;&#x4F1A;&#x5B8C;&#x5584;&#x7684;&#x3002;  </p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x662F;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x4E00;&#x4EFD;&#x8FD8;&#x662F;&#x7528;&#x4E00;&#x4E2A;&#xFF0C;&#x5982;&#x679C;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x63A7;&#x5236;&#xFF0C;&#x4E0D;&#x7136;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x4E0D;&#x592A;&#x5408;&#x7406;&#x3002;</p>
<hr>
<h4 id="&#x56DB;&#x3001;&#x53D1;&#x5E03;-Bot"><a href="#&#x56DB;&#x3001;&#x53D1;&#x5E03;-Bot" class="headerlink" title="&#x56DB;&#x3001;&#x53D1;&#x5E03; Bot"></a>&#x56DB;&#x3001;&#x53D1;&#x5E03; Bot</h4><p>&#x517B;&#x80B2;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x6765;&#x8BA9;&#x5176;&#x4ED6;&#x7684;&#x4EBA;&#x4F7F;&#x7528;:</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/7c9628b2561a1fd40ed69006aaeab96c7620e2824bb5226684b728c0d826b094" alt="image.png"></p>
<p>&#x76EE;&#x524D;&#x652F;&#x6301; <code>&#x8C46;&#x5305;</code>&#x3001;<code>&#x98DE;&#x4E66;</code>&#x3001;<code>&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x53F7;/&#x5BA2;&#x670D;</code>&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7B5B;&#x9009;&#x6216;&#x8005;&#x914D;&#x7F6E;&#xFF0C;&#x8BE6;&#x60C5;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6587;&#x6863;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/674e84f4684292c553afa1c71987bb8e6ea7115cc679d6088217cb26846efc1d" alt="image.png"></p>
<p>&#x53D1;&#x5E03;&#x5230;&#x98DE;&#x4E66;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x70B9;&#x51FB; <strong>&#x914D;&#x7F6E;</strong> &#x6309;&#x94AE;&#xFF0C;&#x98DE;&#x4E66;&#x767B;&#x5F55;&#x540E;&#x83B7;&#x53D6;&#x5E94;&#x7528;&#x540E;&#x6388;&#x6743;&#x5373;&#x53EF;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/455d6404bbe9fa786bd2695ba5919c5440fb33ca9cfc55d09649854ad20f7e0d" alt="image.png"></p>
<p>&#x53D1;&#x5E03;&#x4E4B;&#x540E;&#xFF0C;&#x522B;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x98DE;&#x4E66;&#x5E94;&#x7528;&#x4E2D;&#x641C;&#x7D22;&#x5230; <strong>Flutter &#x5927;&#x5E08;</strong> &#x7684;&#x673A;&#x5668;&#x4EBA;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/5c0fa3fb9e521b3d775f7dac0c18217ac7d8c2956502d94d44d273692d4069c4" alt="image.png"></p>
<p>&#x7136;&#x540E;&#x6109;&#x5FEB;&#x5730;&#x73A9;&#x800D;&#x5427; ~</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/8f3cd533180fb63461a9efea9db4f368cdfabeec75d324acc4a8acf8fd540c2b" alt="image.png"></p>
<hr>
<p>&#x5728;&#x6263;&#x5B50;&#x7684; Bots &#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5B66;&#x4E60;&#x52A9;&#x624B;&#x4E2D;&#x641C;&#x7D22;&#x5230; <strong>Flutter &#x5927;&#x5E08;</strong></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/fa9aab9546e6d841703d444f3ced7563020b1675ee90f13ced36a10a19c7bfa9" alt="image.png"></p>
<p>&#x4F7F;&#x7528;&#x4E2D;&#x53D1;&#x73B0;<code>&#x98DE;&#x4E66;&#x5E94;&#x7528;</code>&#x597D;&#x50CF;&#x4E0D;&#x652F;&#x6301;&#x6570;&#x636E;&#x5E93;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5728;<code>&#x6263;&#x5B50;</code> &#x91CC;&#x53EF;&#x4EE5;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/ac9a2cf2da9cc6f9b63f863ea32089a6be167973846217778b801a25084267b2" alt="image.png"></p>
<p>&#x90A3;&#x6263;&#x5B50;&#x7684;&#x521D;&#x4F53;&#x9A8C;&#x5C31;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x603B;&#x5F97;&#x6765;&#x8BF4;&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BB0;&#x5FC6;&#x80FD;&#x529B;&#x8FD8;&#x662F;&#x8BA9;&#x6211;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x3002;&#x76EE;&#x524D; &#x201C;Flutter &#x5927;&#x5E08;&#x201D; &#x8FD8;&#x5728;&#x5C0F;&#x767D;&#x9636;&#x6BB5;&#xFF0C;&#x8BA9;&#x6211;&#x6162;&#x6162;&#x517B;&#x80B2;&#x5427; ~</p>
<hr>
<h4 id="&#x6700;&#x540E;&#x5C0F;&#x7ED3;"><a href="#&#x6700;&#x540E;&#x5C0F;&#x7ED3;" class="headerlink" title="&#x6700;&#x540E;&#x5C0F;&#x7ED3;"></a>&#x6700;&#x540E;&#x5C0F;&#x7ED3;</h4><p>&#x6263;&#x5B50;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4EC0;&#x4E48;?</p>
<blockquote>
<p>&#x8BA9;&#x666E;&#x901A;&#x4EBA;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x77E5;&#x8BC6;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6765; &#x201C;&#x517B;&#x80B2;&#x201D; &#x4E13;&#x4E1A;&#x9886;&#x57DF; AI &#x667A;&#x6167;&#x4F53;&#x7684;&#x673A;&#x4F1A;!</p>
</blockquote>
<hr>
<p>&#x6700;&#x540E;&#x5BF9;&#x6263;&#x5B50;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x548C;&#x5C0F;&#x7545;&#x60F3;&#xFF1A;</p>
<ul>
<li>&#x6307;&#x5B9A;&#x683C;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;<code>&#x6279;&#x91CF;&#x5BFC;&#x5165;</code> url&#xFF0C;&#x6216;&#x8005;&#x6398;&#x91D1;&#x53EF;&#x4EE5;&#x8BA9;&#x4F5C;&#x8005;&#x5C06;&#x6587;&#x7AE0;&#x3001;&#x4E13;&#x680F;&#x5BFC;&#x51FA;&#x5230; Coze &#x77E5;&#x8BC6;&#x5E93;&#x7684;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x5E0C;&#x671B;&#x672A;&#x6765;&#x80FD;&#x591F;&#x52A0;&#x5F3A;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x7279;&#x8272;&#xFF0C;&#x6709;&#x4E86;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x73A9;&#x5F88;&#x591A;&#x82B1;&#x6837;&#x3002;</li>
<li><code>&#x6398;&#x91D1;&#x5C0F;&#x518C;&amp;Coze</code> &#x53EF;&#x4EE5;&#x6253;&#x9020;&#x67D0;&#x672C;&#x5C0F;&#x518C;&#x4E13;&#x6709;&#x7684; Bot &#xFF0C;&#x5582;&#x517B;&#x5C0F;&#x518C;&#x5185;&#x5BB9;&#xFF0C;&#x4EC5;&#x5C0F;&#x518C;&#x8D2D;&#x4E70;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x611F;&#x89C9;&#x4F1A;&#x633A;&#x4E0D;&#x9519;&#x3002;</li>
<li>&#x7F51;&#x9875;&#x6293;&#x53D6;&#x6587;&#x7AE0;&#x65F6;&#xFF0C;&#x56FE;&#x7247;&#x6709;&#x65F6;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x540E;&#x671F;&#x53EF;&#x4EE5;&#x5BF9;<code>&#x56FE;&#x7247;&#x8D44;&#x6E90;&#x8BC6;&#x522B;</code>&#xFF0C;&#x4F5C;&#x4E3A;&#x8D44;&#x6599;&#x3002;&#x6216;&#x4F5C;&#x4E3A;&#x95EE;&#x7B54;&#x4E2D;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x76F8;&#x5173;&#x56FE;&#x7247;&#x3002;</li>
<li>&#x5BF9;&#x77E5;&#x8BC6;&#x5E93;&#x4E2D;&#x7684;&#x5206;&#x6BB5;&#x547D;&#x4E2D;&#x60C5;&#x51B5;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x7EDF;&#x8BA1;&#x56FE;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x65B9;&#x4FBF;&#x53EF;&#x89C6;&#x5316;&#x5730;&#x67E5;&#x770B;&#x547D;&#x4E2D;&#x60C5;&#x51B5;&#x3002;</li>
</ul>
<p>bot ID: 7338763773840375842</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/550f33e4c3a847969a2c0c518badfa2c.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338645701658574885.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338645701658574885.html" itemprop="url">尊嘟假嘟～常见 Redis 大key,热key解决方案 一：</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-23T19:31:23+08:00">
                2024-02-23
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x4E00;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;Redis-&#x5927;Key"><a href="#&#x4E00;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;Redis-&#x5927;Key" class="headerlink" title="&#x4E00;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;Redis &#x5927;Key"></a>&#x4E00;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;Redis &#x5927;Key</h1><p>&#x5728;Redis&#x4E2D;&#xFF0C;&#x201D;big key&#x201D; &#x6307;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5360;&#x7528;&#x8F83;&#x591A;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x952E;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x952E;&#x7684;&#x503C;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x8D85;&#x8FC7;&#x4E86;Redis&#x7684;&#x914D;&#x7F6E;&#x9608;&#x503C;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A; &#x201C;big key&#x201D;&#x3002;&#x5927;&#x7684;&#x952E;&#x53EF;&#x4EE5;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x6765;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x8F93;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/6e45d9362dab1b0719b72fa92e477202a047fa3468c0e7f73f55e40417fc5769" alt="image.png"></p>
<p>&#x201C;big key&#x201D; &#x53EF;&#x80FD;&#x4F1A;&#x5BF9;Redis&#x7684;&#x6027;&#x80FD;&#x4EA7;&#x751F;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x589E;&#x52A0;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x964D;&#x4F4E;&#x7F13;&#x5B58;&#x7684;&#x6548;&#x7387;&#x7B49;&#x3002;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x5BFC;&#x81F4;&#x5927;&#x952E;&#x95EE;&#x9898;&#x7684;&#x573A;&#x666F;&#x5305;&#x62EC;&#xFF1A;</p>
<ol>
<li><strong>&#x5B57;&#x7B26;&#x4E32;&#x8FC7;&#x5927;&#xFF1A;</strong> &#x5F53;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x7684;&#x5927;&#x5C0F;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x4E86;Redis&#x7684;&#x914D;&#x7F6E;&#x9650;&#x5236;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5927;&#x952E;&#x3002;</li>
<li><strong>Hash&#x3001;Set&#x3001;List&#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5143;&#x7D20;&#x8FC7;&#x591A;&#xFF1A;</strong> &#x5F53;&#x4E00;&#x4E2A;Hash&#x3001;Set&#x6216;List&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6570;&#x91CF;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5B83;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5927;&#x952E;&#x3002;</li>
</ol>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D; &#x201C;big key&#x201D; &#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x63AA;&#x65BD;&#xFF1A;</p>
<ol>
<li><strong>&#x5408;&#x7406;&#x8BBE;&#x7F6E;&#x5185;&#x5B58;&#x9650;&#x5236;&#xFF1A;</strong> &#x5728;Redis&#x7684;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x5408;&#x7406;&#x8BBE;&#x7F6E;&#x8BE5;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5927;&#x952E;&#x95EE;&#x9898;&#x5BF9;&#x7CFB;&#x7EDF;&#x9020;&#x6210;&#x8FC7;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</li>
<li><strong>&#x5408;&#x7406;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;</strong> &#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x907F;&#x514D;&#x5728;&#x5355;&#x4E2A;&#x952E;&#x4E2D;&#x5B58;&#x50A8;&#x8FC7;&#x591A;&#x7684;&#x5143;&#x7D20;&#x3002;</li>
<li><strong>&#x5B9A;&#x671F;&#x6E05;&#x7406;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF1A;</strong> &#x5BF9;&#x4E8E;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5927;&#x952E;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x671F;&#x6E05;&#x7406;&#x6216;&#x91C7;&#x53D6;&#x9002;&#x5F53;&#x7684;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5185;&#x5B58;&#x5F97;&#x5230;&#x6709;&#x6548;&#x5229;&#x7528;&#x3002;</li>
<li><strong>&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#xFF1A;</strong> &#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x5927;&#x91CF;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5230;&#x591A;&#x4E2A;Redis&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8D1F;&#x62C5;&#x3002;</li>
</ol>
<p>&#x4E86;&#x89E3;&#x548C;&#x76D1;&#x63A7;&#x5927;&#x952E;&#x95EE;&#x9898;&#x5BF9;&#x4E8E;&#x7EF4;&#x62A4;Redis&#x6027;&#x80FD;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Redis&#x7684;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x5982;Redis&#x7684;INFO&#x547D;&#x4EE4;&#x6216;&#x7B2C;&#x4E09;&#x65B9;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x6765;&#x8DDF;&#x8E2A;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x548C;&#x8BC6;&#x522B;&#x6F5C;&#x5728;&#x7684;&#x5927;&#x952E;&#x3002;</p>
<p>redis&#x4E2D;&#x6709;&#x5E38;&#x89C1;&#x7684;&#x51E0;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6BCF;&#x79CD;&#x7ED3;&#x6784;&#x5BF9;&#x5927;key&#x7684;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<blockquote>
<ul>
<li>value&#x662F;String&#x7C7B;&#x578B;&#x65F6;&#xFF0C;size&#x8D85;&#x8FC7;10KB</li>
<li>value&#x662F;ZSET&#x3001;Hash&#x3001;List&#x3001;Set&#x7B49;&#x96C6;&#x5408;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x6210;&#x5458;&#x6570;&#x91CF;&#x8D85;&#x8FC7;1w&#x4E2A;</li>
</ul>
</blockquote>
<p>&#x4E0A;&#x8FF0;&#x7684;&#x5B9A;&#x4E49;&#x5E76;&#x4E0D;&#x7EDD;&#x5BF9;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6839;&#x636E;value&#x7684;&#x6210;&#x5458;&#x6570;&#x91CF;&#x548C;&#x5B57;&#x8282;&#x6570;&#x6765;&#x786E;&#x5B9A;&#xFF0C;&#x4E1A;&#x52A1;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x573A;&#x666F;&#x4E5F;&#x786E;&#x5B9A;&#x6807;&#x51C6;&#x3002;</p>
<h1 id="&#x4E8C;&#xFF1A;&#x9488;&#x5BF9;&#x4E8E;redis&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5927;key&#x95EE;&#x9898;"><a href="#&#x4E8C;&#xFF1A;&#x9488;&#x5BF9;&#x4E8E;redis&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5927;key&#x95EE;&#x9898;" class="headerlink" title="&#x4E8C;&#xFF1A;&#x9488;&#x5BF9;&#x4E8E;redis&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5927;key&#x95EE;&#x9898;"></a>&#x4E8C;&#xFF1A;&#x9488;&#x5BF9;&#x4E8E;redis&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5927;key&#x95EE;&#x9898;</h1><h2 id="2-1-String"><a href="#2-1-String" class="headerlink" title="2.1: String"></a>2.1: String</h2><p>&#x5904;&#x7406;&#x5927;&#x952E;&#xFF08;big key&#xFF09;&#x95EE;&#x9898;&#x5BF9;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#xFF08;String&#xFF09;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x65B9;&#x6848;&#xFF1A;</p>
<ol>
<li><strong>&#x6570;&#x636E;&#x5206;&#x5272;&#xFF1A;</strong> &#x5982;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x503C;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x5176;&#x5206;&#x5272;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x952E;&#x6765;&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x7247;&#x6BB5;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x5B57;&#x7B26;&#x4E32;</span><br><span class="line">SET user:1:description &quot;Very long description...&quot;</span><br><span class="line"># &#x5206;&#x5272;&#x540E;&#x7684;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x7247;&#x6BB5;</span><br><span class="line">SET user:1:description:part1 &quot;Very long&quot;</span><br><span class="line">SET user:1:description:part2 &quot; description...&quot;</span><br></pre></td></tr></table></figure>

<ol start="2">
<li><strong>&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#xFF1A;</strong> &#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;Redis&#x652F;&#x6301;&#x7684;&#x538B;&#x7F29;&#x529F;&#x80FD;&#xFF0C;&#x5982;<code>zstd</code>&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x51CF;&#x5C0F;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;&#x538B;&#x7F29;&#x7B97;&#x6CD5;</span><br><span class="line">SET user:1:description &quot;Compressed description...&quot; ZSTD</span><br></pre></td></tr></table></figure>

<p>&#x6CE8;&#x610F;&#xFF1A;&#x9700;&#x8981;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x4E2D;&#x8FDB;&#x884C;&#x89E3;&#x538B;&#x7F29;&#xFF0C;&#x56E0;&#x4E3A;Redis&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x89E3;&#x538B;&#x7F29;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x3002;<br>3. <strong>&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;</strong> &#x5982;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x503C;&#x5177;&#x6709;&#x7ED3;&#x6784;&#x5316;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;Hash&#x6216;List&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x5E76;&#x907F;&#x514D;&#x4E00;&#x4E2A;&#x952E;&#x53D8;&#x5F97;&#x8FC7;&#x5927;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;Hash</span><br><span class="line">HSET user:1:info description &quot;Very long description...&quot;</span><br></pre></td></tr></table></figure>

<ol start="4">
<li><strong>&#x6570;&#x636E;&#x6E05;&#x7406;&#xFF1A;</strong> &#x5B9A;&#x671F;&#x6E05;&#x7406;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x53EA;&#x4FDD;&#x7559;&#x5FC5;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x5B9A;&#x671F;&#x6E05;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x636E;</span><br><span class="line">DEL user:1:description:old</span><br></pre></td></tr></table></figure>

<p>&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x9700;&#x6C42;&#x548C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002;&#x9700;&#x8981;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x6765;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x62C6;&#x5206;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5927;&#x952E;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2-2-List"><a href="#2-2-List" class="headerlink" title="2.2: List"></a>2.2: List</h2><p>&#x5904;&#x7406;&#x5927;&#x952E;&#xFF08;big key&#xFF09;&#x7684;&#x95EE;&#x9898;&#x5BF9;&#x4E8E;&#x5217;&#x8868;&#xFF08;List&#xFF09;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#xFF1A;</p>
<ol>
<li><strong>&#x5206;&#x5272;&#x5217;&#x8868;&#xFF1A;</strong> &#x5982;&#x679C;&#x5217;&#x8868;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5143;&#x7D20;&#x8FC7;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x5217;&#x8868;&#x5206;&#x5272;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x5217;&#x8868;&#x3002;&#x6BCF;&#x4E2A;&#x5C0F;&#x5217;&#x8868;&#x53EA;&#x5305;&#x542B;&#x90E8;&#x5206;&#x5143;&#x7D20;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x5355;&#x4E2A;&#x5217;&#x8868;&#x7684;&#x957F;&#x5EA6;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x5217;&#x8868;</span><br><span class="line">LPUSH user:1:activity_log item1</span><br><span class="line">LPUSH user:1:activity_log item2</span><br><span class="line">LPUSH user:1:activity_log item3</span><br><span class="line"># &#x5206;&#x5272;&#x540E;&#x7684;&#x5C0F;&#x5217;&#x8868;</span><br><span class="line">LPUSH user:1:activity_log:part1 item1</span><br><span class="line">LPUSH user:1:activity_log:part1 item2</span><br><span class="line">LPUSH user:1:activity_log:part2 item3</span><br></pre></td></tr></table></figure>

<ol start="2">
<li><strong>&#x5B9A;&#x671F;&#x4FEE;&#x526A;&#xFF1A;</strong> &#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x5217;&#x8868;&#xFF0C;&#x5220;&#x9664;&#x6389;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x5217;&#x8868;&#x7684;&#x5408;&#x7406;&#x5927;&#x5C0F;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>LTRIM</code>&#x547D;&#x4EE4;&#x6765;&#x622A;&#x53D6;&#x5217;&#x8868;&#xFF0C;&#x4FDD;&#x7559;&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5143;&#x7D20;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x5B9A;&#x671F;&#x4FEE;&#x526A;&#x5217;&#x8868;</span><br><span class="line">LTRIM user:1:activity_log 0 99</span><br></pre></td></tr></table></figure>

<p>&#x4E0A;&#x8FF0;&#x547D;&#x4EE4;&#x4FDD;&#x7559;&#x4E86;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x524D;100&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5220;&#x9664;&#x4E86;&#x5176;&#x4F59;&#x7684;&#x5143;&#x7D20;&#x3002;<br>3. <strong>&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;</strong> &#x5982;&#x679C;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5173;&#x8054;&#x6027;&#x6216;&#x7ED3;&#x6784;&#x5316;&#x4FE1;&#x606F;&#xFF0C;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF08;Sorted Set&#xFF09;&#x6216;&#x54C8;&#x5E0C;&#xFF08;Hash&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x7075;&#x6D3B;&#x5730;&#x7BA1;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x907F;&#x514D;&#x4E00;&#x4E2A;&#x5927;&#x5217;&#x8868;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;&#x6709;&#x5E8F;&#x96C6;&#x5408;</span><br><span class="line">ZADD user:1:activity_log timestamp1 item1</span><br><span class="line">ZADD user:1:activity_log timestamp2 item2</span><br></pre></td></tr></table></figure>

<ol start="4">
<li><strong>&#x4F7F;&#x7528;Stream&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;</strong> &#x5982;&#x679C;&#x6570;&#x636E;&#x662F;&#x4E8B;&#x4EF6;&#x6D41;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;Redis Streams&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x652F;&#x6301;&#x6301;&#x4E45;&#x5316;&#x3001;&#x591A;&#x6D88;&#x8D39;&#x8005;&#x3001;&#x591A;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x6D41;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">bash&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;Stream</span><br><span class="line">XADD user:1:activity_log * type item1</span><br><span class="line">XADD user:1:activity_log * type item2</span><br></pre></td></tr></table></figure>

<p>&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x9700;&#x6C42;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x548C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x62C6;&#x5206;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5927;&#x952E;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2-3-Set"><a href="#2-3-Set" class="headerlink" title="2.3: Set"></a>2.3: Set</h2><p>&#x5BF9;&#x4E8E;&#x96C6;&#x5408;&#xFF08;Set&#xFF09;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5904;&#x7406;&#x5927;&#x952E;&#xFF08;big key&#xFF09;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x65B9;&#x6848;&#xFF1A;</p>
<ol>
<li><strong>&#x5206;&#x5272;&#x96C6;&#x5408;&#xFF1A;</strong> &#x5982;&#x679C;&#x96C6;&#x5408;&#x4E2D;&#x5143;&#x7D20;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x5176;&#x5206;&#x5272;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6BCF;&#x4E2A;&#x5C0F;&#x96C6;&#x5408;&#x53EA;&#x5305;&#x542B;&#x90E8;&#x5206;&#x5143;&#x7D20;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x5355;&#x4E2A;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x96C6;&#x5408;</span><br><span class="line">SADD user:1:interests interest1</span><br><span class="line">SADD user:1:interests interest2</span><br><span class="line">SADD user:1:interests interest3</span><br><span class="line"># &#x5206;&#x5272;&#x540E;&#x7684;&#x5C0F;&#x96C6;&#x5408;</span><br><span class="line">SADD user:1:interests:part1 interest1</span><br><span class="line">SADD user:1:interests:part2 interest2</span><br><span class="line">SADD user:1:interests:part2 interest3</span><br></pre></td></tr></table></figure>

<ol start="2">
<li><strong>&#x4F7F;&#x7528;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF08;Sorted Set&#xFF09;&#xFF1A;</strong> &#x5982;&#x679C;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x65B9;&#x4FBF;&#x5730;&#x5904;&#x7406;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x4E2D;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;&#x6709;&#x5E8F;&#x96C6;&#x5408;</span><br><span class="line">ZADD user:1:interests 1 interest1</span><br><span class="line">ZADD user:1:interests 2 interest2</span><br><span class="line">ZADD user:1:interests 3 interest3</span><br></pre></td></tr></table></figure>

<ol start="3">
<li><strong>&#x4F7F;&#x7528;HyperLogLog&#xFF1A;</strong> &#x5982;&#x679C;&#x96C6;&#x5408;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x57FA;&#x6570;&#xFF08;&#x5143;&#x7D20;&#x7684;&#x4E0D;&#x91CD;&#x590D;&#x6570;&#x91CF;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;HyperLogLog&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x6781;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E0A;&#x4F30;&#x8BA1;&#x57FA;&#x6570;&#xFF0C;&#x800C;&#x4E14;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;HyperLogLog</span><br><span class="line">PFADD user:1:interests interest1 interest2 interest3</span><br></pre></td></tr></table></figure>

<ol start="4">
<li><strong>&#x5B9A;&#x671F;&#x6E05;&#x7406;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF1A;</strong> &#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x96C6;&#x5408;&#xFF0C;&#x5220;&#x9664;&#x6389;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x96C6;&#x5408;&#x7684;&#x5408;&#x7406;&#x5927;&#x5C0F;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>SREM</code>&#x547D;&#x4EE4;&#x6765;&#x79FB;&#x9664;&#x6307;&#x5B9A;&#x7684;&#x5143;&#x7D20;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x5B9A;&#x671F;&#x6E05;&#x7406;&#x96C6;&#x5408;&#x5143;&#x7D20;</span><br><span class="line">SREM user:1:interests unwanted_interest</span><br></pre></td></tr></table></figure>

<p>&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6848;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x9700;&#x6C42;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x548C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x62C6;&#x5206;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5927;&#x952E;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2-4-Hash"><a href="#2-4-Hash" class="headerlink" title="2.4: Hash"></a>2.4: Hash</h2><p>&#x9488;&#x5BF9;Hash&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5927;&#x952E;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x65B9;&#x6848;&#xFF1A;</p>
<ol>
<li><strong>&#x5B57;&#x6BB5;&#x5206;&#x7EC4;&#xFF1A;</strong> &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x6570;&#x91CF;&#x5E9E;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x54C8;&#x5E0C;&#x952E;&#x6765;&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x5206;&#x7EC4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5B57;&#x6BB5;&#x6309;&#x7167;&#x67D0;&#x79CD;&#x89C4;&#x5219;&#x5212;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E2A;&#x5C0F;&#x7EC4;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x54C8;&#x5E0C;&#x952E;&#x5B58;&#x50A8;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">sql&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x54C8;&#x5E0C;</span><br><span class="line">HSET user:1 name John</span><br><span class="line">HSET user:1 email john@example.com</span><br><span class="line">HSET user:1 age 30</span><br><span class="line"># &#x5206;&#x7EC4;&#x540E;&#x7684;&#x54C8;&#x5E0C;</span><br><span class="line">HSET user:1:info name John</span><br><span class="line">HSET user:1:info email john@example.com</span><br><span class="line">HSET user:1:info age 30</span><br></pre></td></tr></table></figure>

<ol start="2">
<li><strong>&#x5206;&#x6563;&#x6570;&#x636E;&#xFF1A;</strong> &#x5C06;&#x5927;&#x54C8;&#x5E0C;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C0F;&#x54C8;&#x5E0C;&#x5B58;&#x50A8;&#x4E00;&#x90E8;&#x5206;&#x5B57;&#x6BB5;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x636E;&#x5206;&#x6563;&#x5230;&#x591A;&#x4E2A;&#x54C8;&#x5E0C;&#x952E;&#x4E2D;&#xFF0C;&#x964D;&#x4F4E;&#x5355;&#x4E2A;&#x54C8;&#x5E0C;&#x952E;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">sql&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x54C8;&#x5E0C;</span><br><span class="line">HSET user:1 name John</span><br><span class="line">HSET user:1 email john@example.com</span><br><span class="line">HSET user:1 age 30</span><br><span class="line"># &#x5206;&#x6563;&#x540E;&#x7684;&#x54C8;&#x5E0C;</span><br><span class="line">HSET user:1:info name John</span><br><span class="line">HSET user:1:contact email john@example.com</span><br><span class="line">HSET user:1:profile age 30</span><br></pre></td></tr></table></figure>

<ol start="3">
<li><strong>&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x54C8;&#x5E0C;&#x952E;&#xFF1A;</strong> &#x5C06;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x5728;&#x591A;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x54C8;&#x5E0C;&#x952E;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x54C8;&#x5E0C;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E00;&#x4E2A;&#x952E;&#x53D8;&#x5F97;&#x8FC7;&#x5927;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x54C8;&#x5E0C;&#x952E;</span><br><span class="line">HSET user:1:info name John</span><br><span class="line">HSET user:1:contact email john@example.com</span><br><span class="line">HSET user:1:profile age 30</span><br></pre></td></tr></table></figure>

<ol start="4">
<li><strong>&#x5B9A;&#x671F;&#x6E05;&#x7406;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5B57;&#x6BB5;&#xFF1A;</strong> &#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x54C8;&#x5E0C;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6E05;&#x7406;&#x6389;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>HDEL</code>&#x547D;&#x4EE4;&#x6765;&#x5B9E;&#x73B0;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x5B9A;&#x671F;&#x6E05;&#x7406;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5B57;&#x6BB5;</span><br><span class="line">HDEL user:1:info unwanted_field</span><br></pre></td></tr></table></figure>

<p>&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6848;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x548C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x8C03;&#x6574;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x4EE5;&#x89E3;&#x51B3;&#x5927;Hash&#x952E;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2-4-Sorted-Set"><a href="#2-4-Sorted-Set" class="headerlink" title="2.4: Sorted Set"></a>2.4: Sorted Set</h2><p>&#x5BF9;&#x4E8E;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF08;Sorted Set&#xFF09;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5904;&#x7406;&#x5927;&#x952E;&#xFF08;big key&#xFF09;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x65B9;&#x6848;&#xFF1A;</p>
<ol>
<li><strong>&#x5206;&#x5272;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF1A;</strong> &#x5C06;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x5206;&#x5272;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C0F;&#x96C6;&#x5408;&#x53EA;&#x5305;&#x542B;&#x90E8;&#x5206;&#x5143;&#x7D20;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x5355;&#x4E2A;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x539F;&#x59CB;&#x5927;&#x6709;&#x5E8F;&#x96C6;&#x5408;</span><br><span class="line">ZADD user:1:scores 100 &quot;Alice&quot;</span><br><span class="line">ZADD user:1:scores 200 &quot;Bob&quot;</span><br><span class="line">ZADD user:1:scores 300 &quot;Charlie&quot;</span><br><span class="line"># &#x5206;&#x5272;&#x540E;&#x7684;&#x5C0F;&#x6709;&#x5E8F;&#x96C6;&#x5408;</span><br><span class="line">ZADD user:1:scores:part1 100 &quot;Alice&quot;</span><br><span class="line">ZADD user:1:scores:part2 200 &quot;Bob&quot;</span><br><span class="line">ZADD user:1:scores:part3 300 &quot;Charlie&quot;</span><br></pre></td></tr></table></figure>

<ol start="2">
<li><strong>&#x6309;&#x5206;&#x6570;&#x8303;&#x56F4;&#x5B58;&#x50A8;&#xFF1A;</strong> &#x5982;&#x679C;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x7684;&#x5143;&#x7D20;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5143;&#x7D20;&#x6309;&#x7167;&#x5206;&#x6570;&#x8303;&#x56F4;&#x5B58;&#x50A8;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x4E2D;&#xFF0C;&#x4EE5;&#x51CF;&#x5C0F;&#x6BCF;&#x4E2A;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x6309;&#x5206;&#x6570;&#x8303;&#x56F4;&#x5B58;&#x50A8;</span><br><span class="line">ZADD user:1:scores:0to100 100 &quot;Alice&quot;</span><br><span class="line">ZADD user:1:scores:101to200 200 &quot;Bob&quot;</span><br><span class="line">ZADD user:1:scores:201to300 300 &quot;Charlie&quot;</span><br></pre></td></tr></table></figure>

<ol start="3">
<li><strong>&#x5B9A;&#x671F;&#x4FEE;&#x526A;&#xFF1A;</strong> &#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x5220;&#x9664;&#x6389;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x7684;&#x5408;&#x7406;&#x5927;&#x5C0F;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>ZREMRANGEBYRANK</code>&#x6216;<code>ZREMRANGEBYSCORE</code>&#x547D;&#x4EE4;&#x6765;&#x79FB;&#x9664;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5143;&#x7D20;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x5B9A;&#x671F;&#x4FEE;&#x526A;&#x6709;&#x5E8F;&#x96C6;&#x5408;</span><br><span class="line">ZREMRANGEBYRANK user:1:scores 0 99</span><br></pre></td></tr></table></figure>

<ol start="4">
<li><strong>&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;</strong> &#x5982;&#x679C;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#x4E0D;&#x518D;&#x9002;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x54C8;&#x5E0C;&#xFF08;Hash&#xFF09;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#xFF08;String&#xFF09;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x548C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">ruby&#x590D;&#x5236;&#x4EE3;&#x7801;# &#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x6216;&#x5B57;&#x7B26;&#x4E32;</span><br><span class="line">HSET user:1:info score 100</span><br></pre></td></tr></table></figure>

<p>&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6848;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x9700;&#x6C42;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x548C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x62C6;&#x5206;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5927;&#x952E;&#x95EE;&#x9898;&#x3002;</p>
<h1 id="&#x4E09;&#xFF1A;&#x70ED;key&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x4E09;&#xFF1A;&#x70ED;key&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x4E09;&#xFF1A;&#x70ED;key&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x4E09;&#xFF1A;&#x70ED;key&#x89E3;&#x51B3;&#x65B9;&#x6848;</h1><h2 id="&#x70ED;-Key-&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x70ED;-Key-&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x70ED; Key &#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x70ED; Key &#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h2><h3 id="&#x589E;&#x52A0;-Redis-&#x5B9E;&#x4F8B;&#x590D;&#x672C;&#x6570;&#x91CF;"><a href="#&#x589E;&#x52A0;-Redis-&#x5B9E;&#x4F8B;&#x590D;&#x672C;&#x6570;&#x91CF;" class="headerlink" title="&#x589E;&#x52A0; Redis &#x5B9E;&#x4F8B;&#x590D;&#x672C;&#x6570;&#x91CF;"></a>&#x589E;&#x52A0; Redis &#x5B9E;&#x4F8B;&#x590D;&#x672C;&#x6570;&#x91CF;</h3><p>&#x5BF9;&#x4E8E;&#x51FA;&#x73B0;&#x70ED; <code>Key</code> &#x7684; <code>Redis</code> &#x5B9E;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6C34;&#x5E73;&#x6269;&#x5BB9;&#x589E;&#x52A0;&#x526F;&#x672C;&#x6570;&#x91CF;&#xFF0C;&#x5C06;&#x8BFB;&#x8BF7;&#x6C42;&#x7684;&#x538B;&#x529B;&#x5206;&#x62C5;&#x5230;&#x4E0D;&#x540C;&#x526F;&#x672C;&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<h3 id="&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF09;"><a href="#&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF09;" class="headerlink" title="&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF09;"></a>&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF09;</h3><p>&#x5F53;&#x51FA;&#x73B0;&#x70ED; <code>Key</code> &#x4EE5;&#x540E;&#xFF0C;&#x628A;&#x70ED; <code>Key</code> &#x52A0;&#x8F7D;&#x5230;&#x7CFB;&#x7EDF;&#x7684; <code>JVM</code> &#x4E2D;&#x3002;&#x540E;&#x7EED;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x70ED; <code>Key</code> &#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x4ECE; <code>JVM</code> &#x4E2D;&#x83B7;&#x53D6;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x8D70;&#x5230; <code>Redis</code> &#x5C42;&#x3002;&#x8FD9;&#x4E9B;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x7684;&#x5DE5;&#x5177;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982; <code>Ehcache</code>&#xFF0C;&#x6216;&#x8005; <code>Google Guava</code> &#x4E2D; <code>Cache</code> &#x5DE5;&#x5177;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x4F7F;&#x7528; <code>HashMap</code> &#x4F5C;&#x4E3A;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x5DE5;&#x5177;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p><strong>&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</strong></p>
<ul>
<li>&#x5982;&#x679C;&#x5BF9;&#x70ED; <code>Key</code> &#x8FDB;&#x884C;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF0C;&#x9700;&#x8981;&#x9632;&#x6B62;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x8FC7;&#x5927;&#xFF0C;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#xFF1B;</li>
<li>&#x9700;&#x8981;&#x5904;&#x7406;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x548C; <code>Redis</code> &#x96C6;&#x7FA4;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h3 id="&#x70ED;-Key-&#x5907;&#x4EFD;"><a href="#&#x70ED;-Key-&#x5907;&#x4EFD;" class="headerlink" title="&#x70ED; Key &#x5907;&#x4EFD;"></a>&#x70ED; Key &#x5907;&#x4EFD;</h3><p>&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x51FA;&#x73B0;&#x70ED; <code>Key</code>&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x540C;&#x4E00;&#x4E2A; <code>Key</code> &#x7684;&#x8BF7;&#x6C42;&#x843D;&#x5230;&#x540C;&#x4E00;&#x4E2A; <code>Redis</code> &#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x529E;&#x6CD5;&#x5C06;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x6253;&#x6563;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x9632;&#x6B62;&#x51FA;&#x73B0;&#x6D41;&#x91CF;&#x503E;&#x659C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x4E48;&#x70ED; <code>Key</code> &#x95EE;&#x9898;&#x4E5F;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5C06;&#x5BF9;&#x67D0;&#x4E2A;&#x70ED; <code>Key</code> &#x7684;&#x8BF7;&#x6C42;&#x6253;&#x6563;&#x5230;&#x4E0D;&#x540C;&#x5B9E;&#x4F8B;&#x4E0A;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x70ED; <code>Key</code> &#x5907;&#x4EFD;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x70ED; <code>Key</code> &#x52A0;&#x4E0A;&#x524D;&#x7F00;&#x6216;&#x8005;&#x540E;&#x7F00;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x70ED; <code>Key</code> &#x7684;&#x6570;&#x91CF;&#x53D8;&#x6210; <code>Redis</code> &#x5B9E;&#x4F8B;&#x4E2A;&#x6570; <code>N</code> &#x7684;&#x500D;&#x6570; <code>M</code>&#xFF0C;&#x4ECE;&#x800C;&#x7531;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A; <code>Redis</code> <code>Key</code> &#x53D8;&#x6210;&#x8BBF;&#x95EE; <code>N * M</code> &#x4E2A; <code>Redis</code> <code>Key</code>&#x3002; <code>N * M</code> &#x4E2A; <code>Redis</code> <code>Key</code> &#x7ECF;&#x8FC7;&#x5206;&#x7247;&#x5206;&#x5E03;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x5C06;&#x8BBF;&#x95EE;&#x91CF;&#x5747;&#x644A;&#x5230;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line">ini&#x590D;&#x5236;&#x4EE3;&#x7801;// N &#x4E3A; Redis &#x5B9E;&#x4F8B;&#x4E2A;&#x6570;&#xFF0C;M &#x4E3A; N &#x7684; 2&#x500D;</span><br><span class="line">const M = N * 2</span><br><span class="line">//&#x751F;&#x6210;&#x968F;&#x673A;&#x6570;</span><br><span class="line">random = GenRandom(0, M)</span><br><span class="line">//&#x6784;&#x9020;&#x5907;&#x4EFD;&#x65B0; Key</span><br><span class="line">bakHotKey = hotKey + &quot;_&quot; + random</span><br><span class="line">data = redis.GET(bakHotKey)</span><br><span class="line">if data == NULL {</span><br><span class="line">    data = redis.GET(hotKey)</span><br><span class="line">    if data == NULL {</span><br><span class="line">        data = GetFromDB()</span><br><span class="line">        // &#x53EF;&#x4EE5;&#x5229;&#x7528;&#x539F;&#x5B50;&#x9501;&#x6765;&#x5199;&#x5165;&#x6570;&#x636E;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;</span><br><span class="line">        redis.SET(hotKey, data, expireTime)</span><br><span class="line">        redis.SET(bakHotKey, data, expireTime + GenRandom(0, 5))</span><br><span class="line">    } else {</span><br><span class="line">        redis.SET(bakHotKey, data, expireTime + GenRandom(0, 5))</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x5728;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;&#x7B49;&#x4E8E; <code>1</code> &#x5C0F;&#x4E8E; <code>M</code> &#x7684;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A; <code>bakHotKey</code>&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x4F18;&#x5148;&#x8BBF;&#x95EE; <code>bakHotKey</code>&#xFF0C;&#x5728;&#x5F97;&#x4E0D;&#x5230;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x518D;&#x8BBF;&#x95EE;&#x539F;&#x6765;&#x7684; <code>hotkey</code>&#xFF0C;&#x5E76;&#x5C06; <code>hotkey</code> &#x7684;&#x5185;&#x5BB9;&#x5199;&#x56DE; <code>bakHotKey</code>&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;<code>bakHotKey</code> &#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x662F; <code>hotkey</code> &#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x968F;&#x673A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x5761;&#x5EA6;&#x8FC7;&#x671F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4FDD;&#x8BC1;&#x5728; <code>hotkey</code> &#x8FC7;&#x671F;&#x65F6;&#xFF0C;&#x6240;&#x6709; <code>bakHotKey</code> &#x4E0D;&#x4F1A;&#x540C;&#x65F6;&#x8FC7;&#x671F;&#x800C;&#x9020;&#x6210;&#x7F13;&#x5B58;&#x96EA;&#x5D29;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/9d9068447e20df9f1ad36f68cf39c1e9.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338636024212848677.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338636024212848677.html" itemprop="url">这才开工没几天收到Offer了，简历改的好，找工作没烦恼。</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-23T16:20:49+08:00">
                2024-02-23
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h2 id="&#x559C;&#x62A5;&#x559C;&#x62A5;"><a href="#&#x559C;&#x62A5;&#x559C;&#x62A5;" class="headerlink" title="&#x559C;&#x62A5;&#x559C;&#x62A5;"></a>&#x559C;&#x62A5;&#x559C;&#x62A5;</h2><p><strong>&#x8FD9;&#x624D;&#x5F00;&#x5DE5;&#x6CA1;&#x51E0;&#x5929;&#xFF0C;&#x5C31;&#x6536;&#x5230;&#x4E86;&#x559C;&#x62A5;&#xFF01;</strong></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/af915bc88208337af6de972848b59b56b4b5285a2f6ae762d7b0b17c32d5cf04" alt></p>
<p>&#x5C31;&#x50CF;&#x4E0A;&#x9762;&#x622A;&#x56FE;&#x4E2D;&#x6240;&#x8BF4;&#x7684;&#x4E00;&#x6837;&#xFF1A;<strong>&#x7B80;&#x5386;&#x6539;&#x4E86;&#x771F;&#x7684;&#x6709;&#x7528;&#x3002;</strong></p>
<p><strong>&#x6211;&#x4E5F;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x4F18;&#x5316;&#x7B80;&#x5386;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x5927;&#x5BB6;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x628A;&#x63E1;&#x4F4F;&#x91D1;&#x4E09;&#x94F6;&#x56DB;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x90FD;&#x80FD;&#x987A;&#x5229;&#x4E0A;&#x5CB8;&#xFF0C;&#x5347;&#x804C;&#x52A0;&#x85AA;&#xFF01;</strong></p>
<h2 id="&#x601D;&#x8DEF;&#x5F88;&#x91CD;&#x8981;"><a href="#&#x601D;&#x8DEF;&#x5F88;&#x91CD;&#x8981;" class="headerlink" title="&#x601D;&#x8DEF;&#x5F88;&#x91CD;&#x8981;"></a>&#x601D;&#x8DEF;&#x5F88;&#x91CD;&#x8981;</h2><p>&#x6211;&#x4EEC;&#x4EE5;<strong>Go&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;</strong>&#x7684;&#x7B80;&#x5386;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x5176;&#x4ED6;&#x5C97;&#x4F4D;&#x4E5F;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x7684;&#x601D;&#x8DEF;&#x3002;</p>
<p>&#x601D;&#x8DEF;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF1A;<strong>&#x5176;&#x4ED6;&#x5C97;&#x4F4D;&#x7684;&#x6280;&#x672F;&#x6808;&#xFF0C;&#x77E5;&#x8BC6;&#x70B9;&#x6839;&#x636E;&#x4F60;&#x7684;&#x60C5;&#x51B5;&#x66FF;&#x6362;&#x6389;&#x5C31;&#x597D;&#x4E86;&#x3002;</strong></p>
<p>&#x6211;&#x6309;&#x987A;&#x5E8F;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#xFF0C;&#x7B80;&#x5386;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x51E0;&#x4E2A;&#x6A21;&#x5757;&#x600E;&#x4E48;&#x5199;&#xFF1A;</p>
<h2 id="&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#xFF08;&#x4E2A;&#x4EBA;&#x4F18;&#x52BF;&#xFF09;&#xFF1A;"><a href="#&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#xFF08;&#x4E2A;&#x4EBA;&#x4F18;&#x52BF;&#xFF09;&#xFF1A;" class="headerlink" title="&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#xFF08;&#x4E2A;&#x4EBA;&#x4F18;&#x52BF;&#xFF09;&#xFF1A;"></a>&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#xFF08;&#x4E2A;&#x4EBA;&#x4F18;&#x52BF;&#xFF09;&#xFF1A;</h2><ol>
<li>&#x719F;&#x7EC3;&#x4F7F;&#x7528;Go&#x8FDB;&#x884C;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#xFF0C;&#x5BF9;Slice&#x3001;Map&#x3001;Goroutine&#x3001;Channel&#x6709;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#xFF0C;&#x64C5;&#x957F;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#xFF1B;</li>
<li>&#x719F;&#x7EC3;&#x4F7F;&#x7528;Gin&#x3001;GoFrame&#x3001;Go-zero&#x3001;Go-micro&#x3001;kratos&#x7B49;web&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x6846;&#x67B6;&#xFF0C;&#x719F;&#x6089;&#x7194;&#x65AD;&#xFF0C;&#x9650;&#x6D41;&#xFF0C;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x7B49;&#xFF1B;</li>
<li>&#x6DF1;&#x5165;&#x7406;&#x89E3;CSP&#x6A21;&#x578B;&#xFF0C;&#x6DF1;&#x5165;&#x7406;&#x89E3;GC&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x548C;&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x6CD5;&#xFF0C;&#x6709;&#x8FC7;&#x5B9E;&#x9645;&#x8C03;&#x4F18;&#x7ECF;&#x9A8C;;</li>
<li>&#x719F;&#x6089;MySQL&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x3001;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3001;&#x9501;&#x3001;&#x7D22;&#x5F15;&#xFF0C;&#x6709;MySQL&#x7684;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7ECF;&#x9A8C;;</li>
<li>&#x719F;&#x6089; Redis &#x6301;&#x4E45;&#x5316;&#x673A;&#x5236;&#x3001;&#x8FC7;&#x671F;&#x7B56;&#x7565;&#x4EE5;&#x53CA;&#x96C6;&#x7FA4;&#x90E8;&#x7F72;;</li>
<li>&#x719F;&#x6089;RabbitMQ&#x6D88;&#x606F;&#x961F;&#x5217;&#x4E8B;&#x52A1;&#x6D88;&#x606F;&#x5E95;&#x5C42;&#x539F;&#x7406;&#xFF0C;&#x638C;&#x63E1;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x3001;&#x6D88;&#x606F;&#x91CD;&#x590D;&#x7B49;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;;</li>
<li>&#x719F;&#x7EC3;&#x4F7F;&#x7528;Docker&#x548C;K8S&#xFF0C;&#x6709;CICD&#x7ECF;&#x9A8C;&#xFF1B;&#x64C5;&#x957F;&#x654F;&#x6377;&#x5F00;&#x53D1;&#xFF1B;&#x719F;&#x7EC3;&#x4F7F;&#x7528;&#x5E38;&#x89C1;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x7CBE;&#x901A;&#x57FA;&#x4E8E; LNMP &#x73AF;&#x5883;&#x7684;&#x7F16;&#x7A0B;&#xFF0C;&#x5177;&#x5907;&#x624E;&#x5B9E;&#x7684;PHP&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x7406;&#x89E3;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x3002;</li>
<li>&#x719F;&#x7EC3;&#x4F7F;&#x7528; Yii&#x3001;ThinkPHP&#x548C;Laravel&#x7B49;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#xFF0C;&#x4E86;&#x89E3;&#x57FA;&#x672C;&#x7684;&#x6838;&#x5FC3;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x719F;&#x6089;swoole &#x6269;&#x5C55;&#x3002;</li>
</ol>
<p>&#xFF08;<strong>&#x6CE8;&#x610F;&#xFF1A;8&#x548C;9&#x7684;&#x601D;&#x8DEF;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#xFF0C;&#x50CF;&#x4E0A;&#x9762;&#x7684;PHP&#x7ECF;&#x9A8C;&#x4E00;&#x6837;&#x5199;&#x5728;&#x6700;&#x540E;</strong>&#xFF09;</p>
<h3 id="&#x6CE8;&#x610F;&#xFF1A;"><a href="#&#x6CE8;&#x610F;&#xFF1A;" class="headerlink" title="&#x6CE8;&#x610F;&#xFF1A;"></a>&#x6CE8;&#x610F;&#xFF1A;</h3><ul>
<li>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;Gin GoFrame GoZero&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x60C5;&#x51B5;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x5220;&#x51CF;&#xFF0C;&#x4FDD;&#x7559;&#x81EA;&#x5DF1;&#x64C5;&#x957F;&#x7684;&#x6846;&#x67B6;</li>
<li>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;NSQ&#x3001;Kafka&#x3001;RabbitMQ&#xFF0C;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x51B5;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x5220;&#x51CF;&#xFF0C;&#x4FDD;&#x7559;&#x81EA;&#x5DF1;&#x64C5;&#x957F;&#x7684;&#x6280;&#x672F;&#x6808;</li>
</ul>
<h2 id="&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF1A;"><a href="#&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF1A;" class="headerlink" title="&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF1A;"></a>&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF1A;</h2><ol>
<li><strong>&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x662F;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x89C9;&#x5F97;&#x4F60;&#x4E4B;&#x524D;&#x4EFB;&#x804C;&#x7684;&#x516C;&#x53F8;&#x633A;&#x725B;&#x903C;&#xFF0C;&#x4F60;&#x8D1F;&#x8D23;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x633A;&#x725B;&#x903C;</strong></li>
<li>&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5199;&#xFF1A;2&#x884C;&#x4E4B;&#x5185;&#x5199;&#x6E05;&#x695A;&#x4E4B;&#x524D;&#x6240;&#x5728;&#x7684;&#x516C;&#x53F8;&#x6240;&#x5C5E;&#x884C;&#x4E1A;&#xFF08;&#x6559;&#x80B2;&#x3001;&#x7535;&#x5546;&#xFF09;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x516C;&#x53F8;&#xFF08;&#x5927;&#x5382;&#x3001;&#x96C6;&#x56E2;&#x516C;&#x53F8;&#x3001;&#x56FD;&#x4F01;&#xFF09;&#xFF0C;&#x81EA;&#x5DF1;&#x5728;&#x516C;&#x53F8;&#x8D1F;&#x8D23;&#x4EC0;&#x4E48;&#xFF08;&#x6280;&#x672F;&#x7814;&#x53D1;&#x3001;&#x56E2;&#x961F;&#x7BA1;&#x7406;&#x3001;&#x548C;&#x5BA2;&#x6237;&#x5BF9;&#x63A5;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x8FBE;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x6216;&#x8005;&#x516C;&#x53F8;&#x53D6;&#x5F97;&#x4E86;&#x4EC0;&#x4E48;&#x4E1A;&#x7EE9;&#x3002;</li>
<li>&#x6BD4;&#x5982;&#xFF1A;2018&#x5E74;&#x52A0;&#x5165;xxxx&#xFF08;&#x4E2D;&#x56FD;xxx&#x89C6;&#x9891;&#x7B2C;&#x4E00;&#x95E8;&#x6237;&#xFF09;&#xFF0C;&#x505A;&#x6280;&#x672F;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x8D1F;&#x8D23;&#x516C;&#x53F8;&#x81EA;&#x6709;&#x5168;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x548C;&#x5F00;&#x53D1;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x7F51;&#x7AD9;+APP+&#x5C0F;&#x7A0B;&#x5E8F;+CMS+&#x516C;&#x4F17;&#x53F7;+&#x8FD0;&#x8425;&#x7CFB;&#x7EDF;&#x3002;&#x662F;&#x4E00;&#x4F4D;&#x61C2;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x7684;&#x6280;&#x672F;&#x8D1F;&#x8D23;&#x4EBA;&#x3002;</li>
</ol>
<h2 id="&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#xFF1A;"><a href="#&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#xFF1A;" class="headerlink" title="&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#xFF1A;"></a>&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#xFF1A;</h2><ol>
<li><strong>&#x4E00;&#x5B9A;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5199;&#x6E05;&#x695A;&#x6280;&#x672F;&#x6808;</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;go+gozero+etcd+mysql+redis+kafka+elasticsearch+docker+k8s</li>
<li>&#x7528;&#x6700;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#x7684;&#x8BDD;&#x4ECB;&#x7ECD;&#x6E05;&#x695A;&#x9879;&#x76EE;&#xFF0C;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;2&#x884C;&#x3002;<strong>&#x4F60;&#x5C31;&#x60F3;&#x7ED9;&#x81EA;&#x5DF1;&#x7236;&#x6BCD;&#x600E;&#x4E48;&#x4ECB;&#x7ECD;&#x4F60;&#x505A;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4ED6;&#x4EEC;&#x80FD;&#x542C;&#x61C2;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#xFF08;HR&#xFF09;&#x5C31;&#x80AF;&#x5B9A;&#x80FD;&#x542C;&#x61C2;&#x4E86;&#x3002;</strong></li>
<li>&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#xFF1A;</li>
</ol>
<pre><code>* &#x7528;xxx&#x6280;&#x672F;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;xxx&#x95EE;&#x9898;</code></pre><ol start="4">
<li>&#x5DE5;&#x4F5C;&#x4E1A;&#x7EE9;&#xFF1A;</li>
</ol>
<pre><code>* &#x7AD9;&#x5728;&#x516C;&#x53F8;&#x7684;&#x89D2;&#x5EA6;&#xFF1A;&#x4F60;&#x505A;&#x7684;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x4E3A;&#x516C;&#x53F8;&#x964D;&#x672C;&#x589E;&#x6548;&#x4E86;
* &#x7AD9;&#x5728;&#x56E2;&#x961F;&#x7684;&#x89D2;&#x5EA6;&#xFF1A;&#x4F60;&#x505A;&#x7684;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x63D0;&#x9AD8;&#x56E2;&#x961F;&#x7684;&#x6548;&#x7387;&#x4E86;
* &#x7AD9;&#x5728;&#x9879;&#x76EE;&#x7684;&#x89D2;&#x5EA6;&#xFF1A;&#x4F60;&#x505A;&#x7684;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x63D0;&#x9AD8;&#x9879;&#x76EE;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x4E86;&#xFF0C;&#x63D0;&#x9AD8;&#x63A5;&#x53E3;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x4E86;
* &#x7AD9;&#x5728;&#x6280;&#x672F;&#x7684;&#x89D2;&#x5EA6;&#xFF1A;&#x4F60;&#x653B;&#x514B;&#x4E86;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x96BE;&#x9898;&#xFF0C;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x6709;&#x4EAE;&#x70B9;&#x3001;&#x6709;&#x96BE;&#x70B9;&#x7684;&#x4E8B;&#x60C5;</code></pre><h3 id="&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x68B3;&#x7406;&#x6CD5;&#xFF1A;"><a href="#&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x68B3;&#x7406;&#x6CD5;&#xFF1A;" class="headerlink" title="&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x68B3;&#x7406;&#x6CD5;&#xFF1A;"></a>&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x68B3;&#x7406;&#x6CD5;&#xFF1A;</h3><ol>
<li>&#x5982;&#x679C;&#x5B9E;&#x5728;&#x60F3;&#x4E0D;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x7684;&#x96BE;&#x70B9;&#x548C;&#x4EAE;&#x70B9;&#xFF0C;&#x5EFA;&#x8BAE;&#x7528;&#x4E0B;&#x9762;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x8865;&#x5145;&#x60C5;&#x51B5;&#x529F;&#x80FD;&#x70B9;&#x3001;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x529F;&#x80FD;&#x70B9;&#x4E0B;&#x5BF9;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x548C;&#x6280;&#x672F;&#x65B9;&#x6848;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x601D;&#x7EF4;&#x5148;&#x505A;&#x52A0;&#x6CD5;&#xFF0C;&#x518D;&#x505A;&#x51CF;&#x6CD5;&#x3002;&#x5148;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5217;&#x51FA;&#xFF0C;&#x6574;&#x7406;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5408;&#x5E76;&#x603B;&#x7ED3;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x53D1;&#x6101;&#x7B80;&#x5386;&#x4E2D;&#x6CA1;&#x6709;&#x53EF;&#x5199;&#x7684;&#x4E86;&#x3002;</li>
</ol>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/7779257f7ab23aee3f69388e3cc61bf92871de7fb75f7dfd2415aee2b59fb6c5" alt></p>
<p><strong>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x79C1;&#x4FE1;&#x6211;&#xFF0C;&#x6211;&#x7ED9;&#x4F60;&#x652F;&#x652F;&#x62DB;&#x3002;</strong></p>
<h2 id="&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;&#xFF1A;"><a href="#&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;&#xFF1A;" class="headerlink" title="&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;&#xFF1A;"></a>&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;&#xFF1A;</h2><ol>
<li>&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x5730;&#x5740;</li>
<li>&#x81EA;&#x5DF1;&#x53C2;&#x52A0;&#x8FC7;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;</li>
<li><strong>&#x4EE5;&#x4E0A;&#x8FD9;&#x4E24;&#x4E2A;&#x662F;&#x6700;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x52A0;&#x5206;&#x9879;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E5F;&#x8981;&#x901A;&#x8FC7;&#x4F8B;&#x5B50;&#x6765;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x201C;&#x70ED;&#x7231;&#x6280;&#x672F;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5E72;&#x5DF4;&#x5DF4;&#x4E00;&#x53E5;&#x201C;&#x70ED;&#x7231;&#x6280;&#x672F;&#x201D;&#x3002;</strong></li>
</ol>
<p>&#x597D;&#x4E86;&#xFF0C;&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x6211;&#x7ED9;&#x5927;&#x5BB6;&#x4F18;&#x5316;&#x7B80;&#x5386;&#x7684;&#x5EFA;&#x8BAE;&#x3002;</p>
<p>&#x6211;&#x4EEC; <a href="/external_links/bc36ea972d422519ce3b258ae7840d21.html" target="blank" rel="noopener">&#x5C31;&#x4E1A;&#x8BAD;&#x7EC3;&#x8425;</a> &#x548C; <a href="/external_links/559910052f950a1916c2e7b2e17f4c51.html" target="blank" rel="noopener">&#x5347;&#x804C;&#x52A0;&#x85AA;&#x661F;&#x7403;</a> &#x7684;&#x670B;&#x53CB;&#x4EEC;&#x6309;&#x7167;&#x6211;&#x7684;&#x601D;&#x8DEF;&#x4F18;&#x5316;&#x7B80;&#x5386;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x8D77;&#x5230;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5185;&#x5BB9;&#x5982;&#x679C;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x70B9;&#x8D5E;&#x3001;&#x7559;&#x8A00;&#x3001;&#x5173;&#x6CE8;&#x3002;</p>
<p><strong>&#x66F4;&#x6B22;&#x8FCE;&#x4F60;&#x8F6C;&#x8F7D;&#x5206;&#x4EAB;&#x51FA;&#x53BB;&#xFF1A;&#x9001;&#x4EBA;&#x73AB;&#x7470;&#xFF0C;&#x624B;&#x7559;&#x4F59;&#x9999;&#x561B;&#x3002;</strong></p>
<h2 id="&#x53C8;&#x51FA;&#x6210;&#x7EE9;&#x5566;"><a href="#&#x53C8;&#x51FA;&#x6210;&#x7EE9;&#x5566;" class="headerlink" title="&#x53C8;&#x51FA;&#x6210;&#x7EE9;&#x5566;"></a>&#x53C8;&#x51FA;&#x6210;&#x7EE9;&#x5566;</h2><p>&#x4E5F;&#x6B22;&#x8FCE;&#x4F60;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x5C31;&#x4E1A;&#x8BAD;&#x7EC3;&#x8425;&#xFF0C;<strong>&#x8F85;&#x5BFC;&#x5230;&#x4F60;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x4E3A;&#x6B62;&#x7684;&#x90A3;&#x79CD;</strong>&#xFF1A;</p>
<p><a href="/external_links/bc36ea972d422519ce3b258ae7840d21.html" target="blank" rel="noopener">&#x6211;&#x4EEC;&#x53C8;&#x51FA;&#x6210;&#x7EE9;&#x5566;&#xFF01;&#x5927;&#x5382;Offer&#x96C6;&#x9526;&#xFF01;&#x9065;&#x9065;&#x9886;&#x5148;&#xFF01;</a></p>
<p><a href="/external_links/2c5d4c568a5405de87f454db06afb552.html" target="blank" rel="noopener">&#x8FD9;&#x4E9B;&#x670B;&#x53CB;&#x8D62;&#x9EBB;&#x4E86;&#xFF01;</a></p>
<p><a href="/external_links/559910052f950a1916c2e7b2e17f4c51.html" target="blank" rel="noopener">&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x6CE8;&#x7A0B;&#x5E8F;&#x5458;&#x5347;&#x804C;&#x52A0;&#x85AA;&#x306E;&#x77E5;&#x8BC6;&#x661F;&#x7403;</a></p>
<h2 id="&#x7B54;&#x7591;&#x89E3;&#x60D1;"><a href="#&#x7B54;&#x7591;&#x89E3;&#x60D1;" class="headerlink" title="&#x7B54;&#x7591;&#x89E3;&#x60D1;"></a>&#x7B54;&#x7591;&#x89E3;&#x60D1;</h2><p>&#x9700;&#x8981;&#x300C;&#x7B80;&#x5386;&#x4F18;&#x5316;&#x300D;&#x3001;&#x300C;&#x5C31;&#x4E1A;&#x8F85;&#x5BFC;&#x300D;&#x3001;&#x300C;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x300D;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x5728;&#x6398;&#x91D1;&#x79C1;&#x4FE1;&#x6211;&#x3002;</p>
<p><strong>&#x4E00;&#x5BF9;&#x4E00;&#x8F85;&#x5BFC;&#x7684;&#x90A3;&#x79CD;&#x5466;&#xFF01;</strong></p>
<h2 id="&#x9762;&#x8BD5;&#x771F;&#x9898;&#x5171;&#x4EAB;&#x7FA4;"><a href="#&#x9762;&#x8BD5;&#x771F;&#x9898;&#x5171;&#x4EAB;&#x7FA4;" class="headerlink" title="&#x9762;&#x8BD5;&#x771F;&#x9898;&#x5171;&#x4EAB;&#x7FA4;"></a>&#x9762;&#x8BD5;&#x771F;&#x9898;&#x5171;&#x4EAB;&#x7FA4;</h2><p>&#x5BF9;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x51C6;&#x5907;&#x641E;&#x4E00;&#x4E2A;<strong>&#x91D1;&#x4E09;&#x94F6;&#x56DB;&#x9762;&#x8BD5;&#x771F;&#x9898;&#x5171;&#x4EAB;&#x7FA4;</strong>&#xFF0C;&#x4E92;&#x901A;&#x6709;&#x65E0;&#xFF0C;&#x4E00;&#x8D77;&#x5237;&#x9898;&#x8FDB;&#x6B65;&#xFF0C;<strong>&#x6CA1;&#x51C6;&#x80FD;&#x8BA9;&#x4F60;&#x80FD;&#x5237;&#x5230;&#x81EA;&#x5DF1;&#x610F;&#x5411;&#x516C;&#x53F8;&#x7684;&#x6700;&#x65B0;&#x9762;&#x8BD5;&#x9898;&#x5462;&#x3002;</strong></p>
<p>&#x611F;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6398;&#x91D1;&#x79C1;&#x4FE1;&#x6211;&#x3002;</p>
<p>&#x6216;&#x8005;&#x76F4;&#x63A5;&#x52A0;&#x6211;&#x5FAE;&#x4FE1;&#xFF1A;<strong>wangzhongyang1993</strong></p>
<p>&#x5173;&#x6CE8;&#x6211;&#x7684;&#x540C;&#x540D;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<a href="/external_links/559910052f950a1916c2e7b2e17f4c51.html" target="blank" rel="noopener">&#x738B;&#x4E2D;&#x9633;Go</a></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/ccc0f35570b397ddbde00e73ed9fa9d3.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338388292969283584.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338388292969283584.html" itemprop="url">工作三年，为什么你还不会排查堆外内存泄漏？（上）（文末附赠一</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-23T10:25:09+08:00">
                2024-02-23
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/4d7842dee2edca5893713051585a92c1583048aad1e861ddeac0c07f43c30254" alt="image.png"></p>
<h1 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h1><p>&#x672C;&#x6587;&#x7AE0;&#x662F;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x300C;Java&#x7ECF;&#x5178;&#x6545;&#x969C;&#x6848;&#x4F8B;&#x5206;&#x4EAB;&#x300D;&#x7684;&#x7B2C;&#x4E8C;&#x7BC7;(&#x7B2C;&#x4E00;&#x7BC7;&#xFF1A;<a href="https://dev.newban.cn/7329699704095342603">&lt;&lt;# Java&#x6545;&#x969C;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x7B2C;&#x4E00;&#x671F;&#xFF1A;&#x7236;&#x5B50;&#x4EFB;&#x52A1;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x7EBF;&#x7A0B;&#x6C60;&#x6B7B;&#x9501;&gt;&gt;</a>)&#xFF0C;&#x672C;&#x6B21;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6392;&#x67E5;&#x5806;&#x5916;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x5C06;&#x5728;&#x672C;&#x6587;&#x7AE0;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#xFF1A;</p>
<ul>
<li><strong>Native Memory Track</strong>&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x53D1;&#x73B0;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x95EE;&#x9898;</li>
<li>&#x5982;&#x4F55;&#x4F7F;&#x7528;<strong>pmap</strong>&#x547D;&#x4EE4;&#x67E5;&#x770B;Java&#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x72B6;&#x6001;</li>
<li>&#x5982;&#x4F55;&#x7ED3;&#x5408;<strong>NMT</strong>&#x548C;<strong>pmap</strong>&#x6392;&#x67E5;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;</li>
</ul>
<p>&#x672C;&#x6587;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#xFF1A;</p>
<ol>
<li>&#x6545;&#x969C;&#x63CF;&#x8FF0;</li>
<li>&#x6545;&#x969C;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;</li>
<li>&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#x4EE3;&#x7801;&#x5E2E;&#x52A9;&#x5FEB;&#x901F;&#x5206;&#x6790;</li>
</ol>
<p>&#x672C;&#x6587;&#x5206;&#x4E3A;<strong>&#x4E0A;&#x4E0B;&#x4E24;&#x7BC7;</strong>&#xFF0C;&#x4E0A;&#x7BC7;&#x4E3B;&#x8981;&#x8BB2;&#x8FF0;&#x4E00;&#x822C;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0B;&#x7BC7;&#x8BB2;&#x8FF0;Netty&#x5806;&#x5916;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x6392;&#x67E5;&#xFF1A;<a href="https://dev.newban.cn/7340127788053856293%E3%80%82">juejin.cn/post/734012&#x2026;</a></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#xFF01;</p>
<h1 id="&#x6545;&#x969C;&#x63CF;&#x8FF0;"><a href="#&#x6545;&#x969C;&#x63CF;&#x8FF0;" class="headerlink" title="&#x6545;&#x969C;&#x63CF;&#x8FF0;"></a>&#x6545;&#x969C;&#x63CF;&#x8FF0;</h1><p>&#x7EBF;&#x4E0A;&#x670D;&#x52A1;&#x673A;&#x5668;&#x5185;&#x5B58;&#x9010;&#x6E10;&#x964D;&#x4F4E;&#xFF0C;&#x6700;&#x7EC8;&#x89E6;&#x53D1;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x544A;&#x8B66;&#xFF0C;&#x7ECF;&#x8FC7;&#x521D;&#x6B65;&#x6392;&#x67E5;&#xFF0C;&#x8FDB;&#x7A0B;&#x6240;&#x5360;&#x7528;&#x5185;&#x5B58;&#xFF08;&#x901A;&#x8FC7;ps&#x7684;RSS&#x67E5;&#x770B;&#xFF09;&#x548C;JVM&#x901A;&#x8FC7;Native Memory Track&#x663E;&#x793A;&#x7684;&#x5185;&#x5B58;&#x76F8;&#x5DEE;&#x8F83;&#x5927;&#xFF0C;&#x8FBE;&#x5230;2G&#x4EE5;&#x4E0A;&#x3002;</p>
<h1 id="&#x6545;&#x969C;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;"><a href="#&#x6545;&#x969C;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x6545;&#x969C;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;"></a>&#x6545;&#x969C;&#x6392;&#x67E5;&#x8FC7;&#x7A0B;</h1><p>PS&#x67E5;&#x770B;&#x7ED3;&#x679C;&#xFF1A;<br><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/56461d11c616e0d2822768785290d7772c22d4ff3abfcbfd923a233d38a7ff0b" alt="image.png"><br>NMT&#x67E5;&#x770B;&#x7ED3;&#x679C;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/15b5f9a741b8366414c991c7bcd5a2db7611d63278e29830f373c4e71cb2152c" alt="image.png"></p>
<p>ps&#x7ED3;&#x679C; - nmt&#x7ED3;&#x679C; = 2098913 Kbytes&#xFF08;&#x8FDB;&#x7A0B;&#x603B;&#x5360;&#x7528; - JVM&#x5360;&#x7528;&#xFF09; &#x7EA6;&#x7B49;&#x4E8E; 2G&#xFF0C;&#x8FD9;2G&#x5185;&#x5B58;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x5360;&#x7528;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E0B;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#xFF1A;<em>&#x8BE5;&#x5E94;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x540E;&#x7AEF;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;&#x7F8E;&#x56E2;&#x5F00;&#x6E90;&#x7684;CAT&#x9B54;&#x6539;&#x7684;&#xFF0C;&#x5B83;&#x76F4;&#x63A5;&#x4F7F;&#x7528;Netty&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x8BFB;&#x53D6;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x4E0A;&#x4F20;&#x7684;&#x57CB;&#x70B9;&#x6570;&#x636E;&#xFF0C;&#x7ECF;&#x8FC7;&#x805A;&#x5408;&#x8BA1;&#x7B97;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x5B58;&#x50A8;&#x5230;&#x78C1;&#x76D8;&#x548C;&#x6570;&#x636E;&#x5E93;&#x91CC;</em>&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x6000;&#x7591;&#x662F;&#x4E0D;&#x662F;Netty&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;CAT&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7684;Netty&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x5C01;&#x88C5;&#x3002;</p>
<h2 id="&#x662F;&#x4E0D;&#x662F;Netty&#xFF1F;"><a href="#&#x662F;&#x4E0D;&#x662F;Netty&#xFF1F;" class="headerlink" title="&#x662F;&#x4E0D;&#x662F;Netty&#xFF1F;"></a>&#x662F;&#x4E0D;&#x662F;Netty&#xFF1F;</h2><p>&#x4E3A;&#x4E86;&#x6392;&#x67E5;&#x662F;&#x4E0D;&#x662F;Netty&#x9020;&#x6210;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;Netty&#x66B4;&#x9732;&#x7684;<code>PooledByteBufAllocatorMetric</code>&#x4E2D;&#x6293;&#x53D6;&#x4F7F;&#x7528;&#x7684;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x5E76;&#x914D;&#x7F6E;&#x76D1;&#x63A7;&#xFF0C;&#x53D1;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x76F4;&#x589E;&#x957F;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/997fb42c4185ec3137fdf313456cb930d90914131589e0f66dee8ccbe2833fa6" alt="image.png"></p>
<p>&#x800C;&#x4E14;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x65E5;&#x5FD7;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;Netty&#x7684;&#x6CC4;&#x6F0F;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8C03;&#x7814;&#xFF0C;Netty&#x7684;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x662F;&#x5728;NMT track&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;Internal&#x9879;&#x91CC;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">ini&#x590D;&#x5236;&#x4EE3;&#x7801;...</span><br><span class="line">-                  Internal (reserved=1100166KB, committed=1100166KB)</span><br><span class="line">                            (malloc=1100134KB #68063) </span><br><span class="line">                            (mmap: reserved=32KB, committed=32KB) </span><br><span class="line">...</span><br></pre></td></tr></table></figure>

<p>&#x65E2;&#x7136;&#x4E0D;&#x662F;Netty&#x9020;&#x6210;&#x7684;&#xFF0C;&#x90A3;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x5417;&#xFF1F;</p>
<p>&#x6709;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4F7F;&#x7528;Native&#x65B9;&#x6CD5;&#x5206;&#x914D;&#x5185;&#x5B58;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x91CA;&#x653E;(&#x5373;&#x6CA1;&#x6709;&#x4F7F;&#x7528;DirectByteBuffer&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;JNI&#x7B49;&#x65B9;&#x5F0F;&#x5206;&#x914D;&#x4E86;&#x4E0D;&#x53D7;JVM&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;) &#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x6781;&#x6709;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x90A3;&#x8BE5;&#x5982;&#x4F55;&#x6392;&#x67E5;&#x5462;&#xFF1F;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x76F4;&#x63A5;&#x70B9;&#xFF0C;&#x627E;&#x8C01;&#x5728;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x5373;&#x627E;&#x8C03;&#x7528;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x51FD;&#x6570;&#x7684;<strong>&#x5806;&#x6808;</strong></li>
<li>&#x4ECE;<strong>&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;</strong>&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x987A;&#x85E4;&#x6478;&#x74DC;&#x627E;&#x5230;&#x539F;&#x56E0;</li>
</ul>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7528;perf&#x5DE5;&#x5177;&#x627E;&#xFF08;&#x5982;&#x679C;&#x662F;&#x8F83;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5185;&#x6838;&#x53EF;&#x4EE5;&#x7528;eBPF&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x5177;&#x5982;bcc&#x3001;bpftrace&#x6392;&#x67E5;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x7EBF;&#x4E0A;&#x5185;&#x6838;&#x7248;&#x672C;&#x662F;3.10&#xFF09;&#x3002;&#x4F46;&#x5185;&#x5B58;&#x5206;&#x914D;&#x662F;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F88;&#x96BE;&#x4ECE;&#x5927;&#x91CF;&#x8C03;&#x7528;&#x4E2D;&#x627E;&#x5230;&#x90A3;&#x4E2A;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x6392;&#x67E5;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x5229;&#x7528;NMT + pmap&#x5206;&#x6790;&#x6CC4;&#x6F0F;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x6B65;&#x8981;<strong>&#x627E;&#x5230;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;</strong>&#xFF0C;&#x7B2C;&#x4E8C;&#x6B65;&#x6839;&#x636E;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x627E;&#x5230;&#x539F;&#x56E0;</p>
<hr>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/153c445c4c043983767ce737c3255ba7d5b6073d073aeb5ec36dc83238d7e118" alt="image.png"></p>
<h2 id="&#x4F7F;&#x7528;NMT-amp-pmap&#x627E;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;"><a href="#&#x4F7F;&#x7528;NMT-amp-pmap&#x627E;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;" class="headerlink" title="&#x4F7F;&#x7528;NMT &amp; pmap&#x627E;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;"></a>&#x4F7F;&#x7528;NMT &amp; pmap&#x627E;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;</h2><h3 id="&#x4EC0;&#x4E48;&#x662F;Native-Memory-Track&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;Native-Memory-Track&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;Native Memory Track&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;Native Memory Track&#xFF1F;</h3><p>&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E0B;NMT&#xFF0C;&#x5168;&#x79F0;&#x662F;Native Memory Tracking (NMT) &#xFF0C;&#x5B83;&#x662F;Hotspot VM&#x7528;&#x6765;&#x5206;&#x6790;VM&#x5185;&#x90E8;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x7684;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;<code>jcmd</code>&#xFF08;jdk&#x81EA;&#x5E26;&#xFF09;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x8BBF;&#x95EE;NMT&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5F00;&#x542F;&#x65B9;&#x6CD5;&#xFF1A;&#x5728;&#x542F;&#x52A8;&#x53C2;&#x6570;&#x4E2D;&#x52A0;&#x4E0A;&#xFF1A;</p>
<p><code>-XX:NativeMemoryTracking=summary</code>&#x6216;&#x8005;<code>-XX:NativeMemoryTracking=detail</code>&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6392;&#x67E5;&#x4E2D;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>detail</code>&#xFF0C;&#x4F46;&#x662F;<code>detail</code>&#x6709;&#x4E00;&#x5B9A;&#x6027;&#x80FD;&#x635F;&#x5931;&#xFF0C;&#x5207;&#x8BB0;&#x4E0D;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x5F00;&#x542F;&#x3002;<code>detail</code>&#x76F8;&#x6BD4;<code>summary</code>&#x5305;&#x542B;&#x4E86;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x9020;&#x6210;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x7684;&#x8C03;&#x7528;&#x6808;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x67E5;&#x770B;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p><code>jcmd $(pid) VM.native_memory summary &#x6216; jcmd $(pid) VM.native_memory detail</code></p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;NMT&#x67E5;&#x770B;&#x5404;&#x4E2A;JVM&#x5185;&#x5B58;&#x533A;&#x57DF;&#x5360;&#x7528;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x9884;&#x8BBE;&#x60C5;&#x51B5;&#xFF0C;&#x5927;&#x81F4;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br></pre></td><td class="code"><pre><span class="line">ini&#x590D;&#x5236;&#x4EE3;&#x7801;31748:</span><br><span class="line"></span><br><span class="line">Native Memory Tracking:</span><br><span class="line"></span><br><span class="line">Total: reserved=29167352KB, committed=18409052KB</span><br><span class="line">-                 Java Heap (reserved=25165824KB, committed=15990784KB)</span><br><span class="line">                            (mmap: reserved=25165824KB, committed=15990784KB) </span><br><span class="line"> </span><br><span class="line">-                     Class (reserved=1138901KB, committed=101205KB)</span><br><span class="line">                            (classes #14554)</span><br><span class="line">                            (malloc=2261KB #32680) </span><br><span class="line">                            (mmap: reserved=1136640KB, committed=98944KB) </span><br><span class="line"> </span><br><span class="line">-                    Thread (reserved=249421KB, committed=249421KB)</span><br><span class="line">                            (thread #434)</span><br><span class="line">                            (stack: reserved=247492KB, committed=247492KB)</span><br><span class="line">                            (malloc=1421KB #2185) </span><br><span class="line">                            (arena=507KB #854)</span><br><span class="line"> </span><br><span class="line">-                      Code (reserved=260320KB, committed=104388KB)</span><br><span class="line">                            (malloc=10720KB #13161) </span><br><span class="line">                            (mmap: reserved=249600KB, committed=93668KB) </span><br><span class="line"> </span><br><span class="line">-                        GC (reserved=1161029KB, committed=820549KB)</span><br><span class="line">                            (malloc=194373KB #712117) </span><br><span class="line">                            (mmap: reserved=966656KB, committed=626176KB) </span><br><span class="line"> </span><br><span class="line">-                  Compiler (reserved=1045KB, committed=1045KB)</span><br><span class="line">                            (malloc=915KB #1843) </span><br><span class="line">                            (arena=131KB #15)</span><br><span class="line"> </span><br><span class="line">-                  Internal (reserved=1100166KB, committed=1100166KB)</span><br><span class="line">                            (malloc=1100134KB #68063) </span><br><span class="line">                            (mmap: reserved=32KB, committed=32KB) </span><br><span class="line"> </span><br><span class="line">-                    Symbol (reserved=19431KB, committed=19431KB)</span><br><span class="line">                            (malloc=16770KB #169790) </span><br><span class="line">                            (arena=2661KB #1)</span><br><span class="line"> </span><br><span class="line">-    Native Memory Tracking (reserved=16399KB, committed=16399KB)</span><br><span class="line">                            (malloc=622KB #8758) </span><br><span class="line">                            (tracking overhead=15777KB)</span><br><span class="line"> </span><br><span class="line">-               Arena Chunk (reserved=5664KB, committed=5664KB)</span><br><span class="line">                            (malloc=5664KB) </span><br><span class="line"> </span><br><span class="line">-                   Unknown (reserved=49152KB, committed=0KB)</span><br><span class="line">                            (mmap: reserved=49152KB, committed=0KB)</span><br><span class="line">Virtual memory map:</span><br><span class="line"> </span><br><span class="line">[0x00000001f0000000 - 0x00000007f0000000] reserved 25165824KB for Java Heap from</span><br><span class="line">    [0x00007fce85c50c84] ReservedHeapSpace::ReservedHeapSpace(unsigned long, unsigned long, bool, char*)+0xb4</span><br><span class="line">    [0x00007fce85c1896f] Universe::reserve_heap(unsigned long, unsigned long)+0x3bf</span><br><span class="line">    [0x00007fce8571773d] G1CollectedHeap::initialize()+0x15d</span><br><span class="line">    [0x00007fce85c18fca] Universe::initialize_heap()+0x16a</span><br><span class="line"></span><br><span class="line">	[0x00000001f0000000 - 0x00000005c0000000] committed 15990784KB from</span><br><span class="line">            [0x00007fce857317c4] G1PageBasedVirtualSpace::commit_internal(unsigned long, unsigned long)+0x224</span><br><span class="line">            [0x00007fce8573184e] G1PageBasedVirtualSpace::commit(unsigned long, unsigned long)+0x7e</span><br><span class="line">            [0x00007fce85734345] G1RegionsLargerThanCommitSizeMapper::commit_regions(unsigned int, unsigned long)+0x35</span><br><span class="line">            [0x00007fce8579f636] HeapRegionManager::commit_regions(unsigned int, unsigned long)+0x76</span><br><span class="line"> </span><br><span class="line">[0x00000007f0000000 - 0x0000000830000000] reserved 1048576KB for Class from</span><br><span class="line">    [0x00007fce85c50021] ReservedSpace::ReservedSpace(unsigned long, unsigned long, bool, char*, unsigned long)+0x91</span><br><span class="line">    [0x00007fce85a0e1bf] Metaspace::allocate_metaspace_compressed_klass_ptrs(char*, unsigned char*)+0x4f</span><br><span class="line">    [0x00007fce85a0ec74] Metaspace::global_initialize()+0x574</span><br><span class="line">    [0x00007fce85c192e1] universe_init()+0x61</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x4E86;JVM&#x5185;&#x90E8;&#x5404;&#x4E2A;&#x533A;&#x57DF;&#x5982;&#x5806;&#x3001;Class&#x3001;&#x7EBF;&#x7A0B;&#x7B49;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x800C;&#x5728; <code>Virtual memory map:</code> &#x4E0B;&#x65B9;&#x7684;&#x5C31;&#x662F;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#x533A;&#x57DF;&#x662F;&#x7528;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x6BD4;&#x5982;0x00000001f0000000 - 0x00000007f0000000&#x8FD9;24GB&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x7528;&#x6765;&#x6620;&#x5C04;&#x5806;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7684;&#x6700;&#x5927;&#x5806;&#x5185;&#x5B58;&#x5C31;&#x662F;24GB&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x5747;&#x662F;<strong>JVM&#x7BA1;&#x7406;&#x4E0B;&#x7684;&#x5185;&#x5B58;</strong>&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x4ECE;&#x8FD9;&#x91CC;&#x627E;&#x51FA;&#x4E3A;&#x4EC0;&#x4E48;RSS&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x6BD4;NMT&#x4E2D;&#x7684;&#x591A;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x77E5;&#x9053;Java&#x8FDB;&#x7A0B;&#x6240;&#x6709;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x7136;&#x540E;&#x548C;&#x8FD9;&#x91CC;&#x7684;&#x6BD4;&#x8F83;&#xFF0C;&#x627E;&#x51FA;&#x5728;NMT&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x5C31;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x5728;&#x5360;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6240;&#x6709;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x5462;&#xFF1F;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4ECB;&#x7ECD;pmap&#x547D;&#x4EE4;&#x3002;</p>
<h3 id="pmap&#x547D;&#x4EE4;"><a href="#pmap&#x547D;&#x4EE4;" class="headerlink" title="pmap&#x547D;&#x4EE4;"></a>pmap&#x547D;&#x4EE4;</h3><p>PMAP&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#xFF0C;&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><em><code>pmap [options</code></em><code>] pid</code> <em><code>[</code></em><code>...]</code></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br></pre></td><td class="code"><pre><span class="line">lua&#x590D;&#x5236;&#x4EE3;&#x7801;pmap 25693</span><br><span class="line"></span><br><span class="line">000055bde4835000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 8K r-x-- gedit</span><br><span class="line"></span><br><span class="line">000055bde4a36000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K r---- gedit</span><br><span class="line"></span><br><span class="line">000055bde4a37000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K rw--- gedit</span><br><span class="line"></span><br><span class="line">000055bde5d32000&#xA0; 13944K rw---&#xA0;&#xA0; \[ anon ]</span><br><span class="line"></span><br><span class="line">00007fc910000000&#xA0;&#xA0;&#xA0; 132K rw---&#xA0;&#xA0; \[ anon ]</span><br><span class="line"></span><br><span class="line">00007fc910021000&#xA0; 65404K -----&#xA0;&#xA0; \[ anon ]</span><br><span class="line"></span><br><span class="line">00007fc918000000&#xA0;&#xA0;&#xA0; 896K rw---&#xA0;&#xA0; \[ anon ]</span><br><span class="line"></span><br><span class="line">00007fc9180e0000&#xA0; 64640K -----&#xA0;&#xA0; \[ anon ]</span><br><span class="line"></span><br><span class="line">00007fc91c750000&#xA0;&#xA0;&#xA0; 204K r---- UbuntuMono-R.ttf</span><br><span class="line"></span><br><span class="line">00007fc91c783000&#xA0;&#xA0;&#xA0; 644K r-x-- libaspell.so.15.2.0</span><br><span class="line"></span><br><span class="line">00007fc91c824000&#xA0;&#xA0; 2048K ----- libaspell.so.15.2.0</span><br><span class="line"></span><br><span class="line">00007fc91ca24000&#xA0;&#xA0;&#xA0;&#xA0; 20K r---- libaspell.so.15.2.0</span><br><span class="line"></span><br><span class="line">00007fc91ca29000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K rw--- libaspell.so.15.2.0</span><br><span class="line"></span><br><span class="line">00007fc91ca2a000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 8K r-x-- libenchant\_aspell.so</span><br><span class="line"></span><br><span class="line">00007fc91ca2c000&#xA0;&#xA0; 2044K ----- libenchant\_aspell.so</span><br><span class="line"></span><br><span class="line">00007fc91cc2b000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K r---- libenchant\_aspell.so</span><br><span class="line"></span><br><span class="line">00007fc91cc2c000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K rw--- libenchant\_aspell.so</span><br><span class="line"></span><br><span class="line">00007fc91cc2d000&#xA0;&#xA0;&#xA0;&#xA0; 44K r-x-- libenchant\_hspell.so</span><br><span class="line"></span><br><span class="line">00007fc91cc38000&#xA0;&#xA0; 2044K ----- libenchant\_hspell.so</span><br><span class="line"></span><br><span class="line">00007fc91ce37000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K r---- libenchant\_hspell.so</span><br><span class="line"></span><br><span class="line">00007fc91ce38000&#xA0;&#xA0;&#xA0;&#xA0; 12K rw--- libenchant\_hspell.so</span><br><span class="line"></span><br><span class="line">00007fc91ce3b000&#xA0;&#xA0;&#xA0; 428K r-x-- libhunspell-1.6.so.0.0.1</span><br><span class="line"></span><br><span class="line">00007fc91cea6000&#xA0;&#xA0; 2044K ----- libhunspell-1.6.so.0.0.1</span><br><span class="line"></span><br><span class="line">00007fc91d0a5000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K r---- libhunspell-1.6.so.0.0.1</span><br><span class="line"></span><br><span class="line">00007fc91d0a6000&#xA0;&#xA0;&#xA0;&#xA0; 16K rw--- libhunspell-1.6.so.0.0.1</span><br><span class="line"></span><br><span class="line">00007fc91d0aa000&#xA0;&#xA0;&#xA0;&#xA0; 16K r-x-- libenchant\_myspell.so</span><br><span class="line"></span><br><span class="line">00007fc91d0ae000&#xA0;&#xA0; 2048K ----- libenchant\_myspell.so</span><br><span class="line"></span><br><span class="line">00007fc91d2ae000&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; 4K r---- libenchant\_myspell.so</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">...</span><br></pre></td></tr></table></figure>

<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6BCF;&#x4E2A;&#x6620;&#x5C04;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x548C;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x548C;NMT&#x4E0B;&#x9762;&#x7684;&#x8F93;&#x51FA;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x80FD;&#x591F;&#x5206;&#x6790;&#x51FA;&#x54EA;&#x4E9B;&#x6620;&#x5C04;&#x662F;&#x5728;NMT&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#xFF1F;</p>
<h3 id="&#x7ED3;&#x5408;pmap&#x548C;NMT"><a href="#&#x7ED3;&#x5408;pmap&#x548C;NMT" class="headerlink" title="&#x7ED3;&#x5408;pmap&#x548C;NMT"></a>&#x7ED3;&#x5408;pmap&#x548C;NMT</h3><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x624B;&#x52A8;&#x5728;pmap&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x627E;&#x54EA;&#x4E9B;&#x6CA1;&#x6709;&#x5728;nmt&#x8F93;&#x51FA;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x5199;&#x4E00;&#x4E2A;shell&#x811A;&#x672C;&#x6765;&#x5339;&#x914D;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x6211;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x5728;github&#x4E0A;&#xFF1A;<a href="/external_links/c21dbef0bfa4336ad29f3f4e3b502e74.html" target="blank" rel="noopener">github.com/hengyoush/J&#x2026;</a>&#xFF0C;&#x6216;&#x8005;<a href="/external_links/aa7c1ba23b39ee68c2376345a94c344b.html" target="blank" rel="noopener">&#x76F4;&#x63A5;&#x4E0B;&#x8F7D;</a>&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;<code>./memleak.sh show pid</code>&#x3002;</p>
</blockquote>
<p>&#x53D1;&#x73B0;&#x51E0;&#x4E2A;64MB&#x7684;&#x5757;&#x5F88;&#x53EF;&#x7591;&#xFF0C;&#x5982;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/c8703a925dad88861069be53fefc95e09cce71fed597b98dd023aeb11cdc579e" alt="image.png"></p>
<p>&#x4F46;&#x662F;&#x8BE5;&#x600E;&#x4E48;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x5757;&#x7684;&#x5185;&#x5BB9;&#x5462;&#xFF1F;</p>
<h2 id="&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x5206;&#x6790;"><a href="#&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x5206;&#x6790;" class="headerlink" title="&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x5206;&#x6790;"></a>&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x5206;&#x6790;</h2><p>&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x5757;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x811A;&#x672C;&#x67E5;&#x770B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">bash&#x590D;&#x5236;&#x4EE3;&#x7801; cat /proc/$1/maps | grep -Fv &quot;.so&quot; | grep &quot; 0 &quot; | awk &apos;{print $1}&apos; | grep $2 | ( IFS=&quot;-&quot;</span><br><span class="line">  while read a b; do</span><br><span class="line">    dd if=/proc/$1/mem bs=$( getconf PAGESIZE ) iflag=skip_bytes,count_bytes \</span><br><span class="line">    skip=$(( 0x$a )) count=$(( 0x$b - 0x$a )) of=&quot;$1_mem_$a.bin&quot;</span><br><span class="line">    color_text &quot;$GREEN$BOLD&quot; &quot;Dump&#x6587;&#x4EF6;&#x5DF2;&#x8F93;&#x51FA;&#x81F3;: ./$1_mem_$a.bin&quot;  </span><br><span class="line">  done )</span><br></pre></td></tr></table></figure>

<p>&#x5C06;&#x4E0A;&#x8FF0;&#x811A;&#x672C;&#x4FDD;&#x5B58;&#x4E3A;<code>dump.sh</code>, &#x7136;&#x540E;&#x6267;&#x884C;&#xFF1A;<code>./dump.sh ${pid} ${address}</code></p>
<p>&#x6BD4;&#x5982;&#xFF1A;<code>./dump.sh 31748 7fcbfb622000</code></p>
<p>&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#xFF1A;31748_mem_7fcbfb622000.bin</p>
<p>&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5C31;&#x662F;&#x8BE5;&#x5730;&#x5740;&#x5757;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x8F6C;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x4FBF;&#x67E5;&#x770B;&#xFF1A;<code>strings 31748_mem_7fcbfb622000.bin &gt; 31748_mem_7fcbfb622000.bin.txt</code></p>
<p>&#x67E5;&#x770B;&#x8F6C;&#x6362;&#x540E;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a6bac7ed789491ef81b9946ce06f282b3d49e527f6b5b519e1d93fb0b099f038" alt="image.png"></p>
<p>&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x8FD4;&#x56DE;&#x7684;&#x76D1;&#x63A7;&#x62A5;&#x8868;&#x6570;&#x636E;&#xFF08;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#x670D;&#x52A1;&#xFF0C;&#x4F1A;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x62C9;&#x53D6;&#x76D1;&#x63A7;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x67E5;&#x627E;&#x4E86;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x540E;&#x7EC8;&#x4E8E;&#x6C34;&#x843D;&#x77F3;&#x51FA;&#x4E86;&#xFF01;&#xFF01;&#x539F;&#x6765;&#x5728;&#x4F7F;&#x7528;servlet&#x8F93;&#x51FA;&#x6D41;&#x5199;&#x54CD;&#x5E94;&#x65F6;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x4F7F;&#x7528;try-with-resource&#xFF0C;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x4E3B;&#x52A8;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x65F6;&#xFF08;&#x53D1;&#x5E03;&#x6216;&#x8005;&#x91CD;&#x542F;&#xFF09;&#xFF0C;&#x5199;&#x5165;&#x5931;&#x8D25;&#xFF0C;&#x4F46;&#x662F;&#x6D41;&#x6CA1;&#x6709;&#x5173;&#x95ED;&#xFF0C;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/e47eb29bedad6cc4a64be8180ab7a2cd0dcb3a3b4054ca6352b580f10dba4956" alt="image.png"><br>&#x4FEE;&#x590D;&#x4E0A;&#x7EBF;&#x4E4B;&#x540E;&#xFF0C;&#x5185;&#x5B58;&#x4E0D;&#x518D;&#x8BE1;&#x5F02;&#x51CF;&#x5C11;&#x4E86;&#xFF0C;RSS&#x548C;NMT&#x8F93;&#x51FA;&#x4E5F;&#x4E0D;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x4E86;&#x3002;</p>
<h1 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h1><p>&#x6211;&#x5E2E;&#x4F60;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x4E0B;&#x6392;&#x67E5;&#x6B65;&#x9AA4;&#xFF1A;<br>&#x5F53;&#x4F60;&#x6000;&#x7591;&#x7EBF;&#x4E0A;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x786E;&#x5B9A;&#x662F;&#x5806;&#x5916;&#x5185;&#x5B58;&#x9020;&#x6210;&#x7684;&#x8FD8;&#x662F;&#x5806;&#x5185;&#xFF0C;&#x5806;&#x5916;&#x5185;&#x5B58;&#x9020;&#x6210;&#x7684;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ol>
<li>JVM&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x5927;&#x91CF;FGC&#x7B49;&#x60C5;&#x51B5;</li>
<li>&#x673A;&#x5668;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;</li>
<li><code>RSS - NMT</code>&#x7EDF;&#x8BA1;&#x7684;&#x5185;&#x5B58; &#x5DEE;&#x8DDD;&#x8F83;&#x5927;</li>
</ol>
<p>&#x5982;&#x679C;&#x786E;&#x5B9A;&#x662F;&#x5806;&#x5916;&#x5185;&#x5B58;&#x9020;&#x6210;&#xFF0C;&#x6309;&#x7167;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x6392;&#x67E5;&#xFF1A;</p>
<ol>
<li>&#x786E;&#x5B9A;&#x662F;&#x5426;&#x662F;Netty&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x6392;&#x67E5;&#x65B9;&#x5F0F;&#x6709;&#xFF1A;&#x5E94;&#x7528;&#x65E5;&#x5FD7;&#x6709;&#x6CA1;&#x6709;Netty&#x7684;&#x6CC4;&#x6F0F;&#x65E5;&#x5FD7;&#xFF0C;Netty&#x7684;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x6307;&#x6807;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x76F4;&#x4E0A;&#x5347;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0D;&#x662F;Netty&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x6309;&#x7167;&#x5982;&#x4E0B;&#x6D41;&#x7A0B;&#xFF1A;</li>
</ol>
<pre><code>1. &#x4F7F;&#x7528;`pmap -x {pid} &gt; ./pmap.txt` &#x83B7;&#x53D6;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x4FE1;&#x606F;&#x5230;&#x6587;&#x4EF6;&#x91CC;&#x3002;
2. &#x4F7F;&#x7528;`jcmd ${pid} VM.native_memory detail &gt; nmt.txt`&#x83B7;&#x53D6;NMT&#x7EDF;&#x8BA1;&#x7684;JVM&#x5185;&#x5B58;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;
3. &#x627E;nmt&#x4E2D;&#x6CA1;&#x6709;&#x4F46;&#x662F;&#x5728;pmap&#x4E2D;&#x6709;&#x7684;&#x5185;&#x5B58;&#x5757;&#x5730;&#x5740;&#xFF08;tips1&#xFF1A;&#x6700;&#x597D;&#x627E;64MB&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF09;
4. &#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7684;`dump.sh&#xFF1A;./dump.sh {pid} {addr}` dump&#x5BF9;&#x5E94;&#x5185;&#x5B58;&#x5757;&#x7684;&#x5185;&#x5BB9;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#x3002;
5. &#x4F7F;&#x7528; `strings {dump&#x6587;&#x4EF6;&#x540D;} &gt; dumped.txt`&#x8F6C;&#x6362;&#x4E3A;&#x53EF;&#x8BFB;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x8FDB;&#x4E00;&#x6B65;&#x5BFB;&#x627E;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;</code></pre><ol start="3">
<li>&#x5982;&#x679C;&#x662F;Netty&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x6211;&#x7684;&#x8FD9;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;<a href="https://dev.newban.cn/7340127788053856293">juejin.cn/post/734012&#x2026;</a></li>
</ol>
<p>&#x662F;&#x4E0D;&#x662F;&#x8FD8;&#x633A;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x7528;&#x6211;&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;<a href="/external_links/c21dbef0bfa4336ad29f3f4e3b502e74.html" target="blank" rel="noopener">JavaMemLeak</a>(Github&#x5730;&#x5740;)&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x81EA;&#x52A8;&#x5316;&#x4E0A;&#x8FF0;&#x6D41;&#x7A0B;&#xFF0C;&#x53EA;&#x8981;&#x6267;&#x884C;&#xFF1A;<code>./memleak.sh show pid</code>&#x5217;&#x51FA;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x6CC4;&#x6F0F;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x5730;&#x5740;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">css&#x590D;&#x5236;&#x4EE3;&#x7801;00007f2824000000   19396   19396   19396 rw---   [ anon ]</span><br><span class="line">00007f28252f1000   46140       0       0 -----   [ anon ]</span><br><span class="line">00007f2830000000    9752    9672    9672 rw---   [ anon ]</span><br><span class="line">00007f2830986000   55784       0       0 -----   [ anon ]</span><br><span class="line">00007f2834000000   11624   11624   11624 rw---   [ anon ]</span><br></pre></td></tr></table></figure>

<p>&#x547D;&#x4EE4;&#x884C;&#x6267;&#x884C;&#xFF1A;<code>./memleak.sh dump pid addr</code> &#x5F97;&#x5230;&#x5185;&#x5B58;&#x5757;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x6790;&#xFF0C;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">makefile&#x590D;&#x5236;&#x4EE3;&#x7801;Dump&#x6587;&#x4EF6;&#x5DF2;&#x8F93;&#x51FA;&#x81F3;: ./11983_mem_7f2964000000.bin</span><br></pre></td></tr></table></figure>

<p>&#x6700;&#x7EC8;&#x4F1A;&#x4EA7;&#x51FA;&#x4E00;&#x4E2A;&#x6CC4;&#x6F0F;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x7B2C;&#x4E94;&#x6B65;&#x5F00;&#x59CB;&#x5C31;&#x53EF;&#x4EE5;&#x5566;&#xFF01;</p>
<p>&#x5982;&#x679C;&#x6709;&#x5E2E;&#x5230;&#x4F60;&#x7684;&#x8BDD;&#x6B22;&#x8FCE;star&#xFF1A;<a href="/external_links/c21dbef0bfa4336ad29f3f4e3b502e74.html" target="blank" rel="noopener">github.com/hengyoush/J&#x2026;</a></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/dfc37e6e6ece86dca67792363b7cbc72fb34ec6326c74e375ca914e9af18842c" alt="image.png"></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/bafe05045c4210f93d56b9b83ecead4f.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338250632938455049.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338250632938455049.html" itemprop="url">Jetpack Compose -> 重组作用域和remem</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-22T18:56:26+08:00">
                2024-02-22
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h1><hr>
<p>&#x4E0A;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x8BB2;&#x89E3;&#x4E86; <a href="https://dev.newban.cn/7329363655815512102">MutableState &#x548C; mutableStateOf()</a> &#x672C;&#x7AE0;&#x6211;&#x4EEC;&#x8BB2;&#x89E3;&#x4E0B; remember &#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x65B9;&#x6CD5;&#xFF1B;</p>
<h1 id="ReCompose-Scope-&#x91CD;&#x7EC4;&#x4F5C;&#x7528;&#x57DF;"><a href="#ReCompose-Scope-&#x91CD;&#x7EC4;&#x4F5C;&#x7528;&#x57DF;" class="headerlink" title="ReCompose Scope(&#x91CD;&#x7EC4;&#x4F5C;&#x7528;&#x57DF;)"></a>ReCompose Scope(&#x91CD;&#x7EC4;&#x4F5C;&#x7528;&#x57DF;)</h1><hr>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/536f14f42fa0fcee780c8d3efd91e6ccc2b1e585b2d9dad17deaabdd8de13c28" alt="infoflow 2024-02-20 15-12-01.png"></p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5C06;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">csharp&#x590D;&#x5236;&#x4EE3;&#x7801;var name by mutableStateOf(&quot;&#x8001;A&quot;)</span><br><span class="line"></span><br><span class="line">lifecycleScope.launch{}</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x653E;&#x5230; setContent &#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x63D0;&#x793A;&#x7EA2;&#x8272;&#x4E86;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x6837;&#x5199;&#xFF0C;Compose &#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x7684;&#xFF08;&#x8FD9;&#x91CC;&#x5176;&#x5B9E;&#x662F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD0;&#x884C;&#x4E4B;&#x540E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; name &#x7684;&#x503C;&#x5728;3s&#x540E;&#x5E76;&#x6CA1;&#x6709;&#x53D8;&#x6210; &#x201C;Mars&#x201D;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x8FD9;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x534F;&#x7A0B;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5B83;&#x4E5F;&#x6B63;&#x5E38;&#x7684;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x6548;&#x679C;&#x7684;&#x662F; mutableStateOf &#x63D0;&#x793A;&#x7684;&#x90A3;&#x884C;&#x4EE3;&#x7801;&#xFF1B;</p>
<p>&#x6211;&#x4EEC;&#x524D;&#x9762;&#x6709;&#x8BF4;&#x5230;&#xFF0C;Compose &#x4F1A;&#x5728;&#x4F7F;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#x5F97;&#x5230;&#x901A;&#x77E5;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x91CD;&#x7EC4;(recompose) &#xFF0C;&#x4F8B;&#x5982; Text(name) &#x5B83;&#x4F1A;&#x5728; name &#x53D8;&#x5316;&#x7684;&#x65F6;&#x5019;&#x5F97;&#x5230;&#x901A;&#x77E5;&#xFF0C;&#x8FDB;&#x884C;&#x91CD;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6765;&#x5177;&#x4F53;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5B83;&#x600E;&#x4E48;&#x88AB;&#x6267;&#x884C;&#x7684;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x9700;&#x8981;&#x5199;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECE;&#x754C;&#x9762;&#x4E0A;&#x6307;&#x5B9A;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x53BB;&#x91CD;&#x590D;&#x6267;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#x91CD;&#x590D;&#x6267;&#x884C; Text(name) &#x8FD9;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#x62FF;&#x5230;&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x597D;&#x50CF;&#x4E0D;&#x592A;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x5728; java &#x4E5F;&#x597D; kotlin &#x4E2D;&#x4E5F;&#x7F62;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x592A;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#xFF1B;</p>
<p>&#x4F46;&#x662F;&#x5728; Compose &#x4E2D;&#xFF0C;&#x5B83;&#x66FF;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x4E86;&#x5B9E;&#x73B0;&#xFF0C;Compose &#x7684;&#x7F16;&#x8BD1;&#x5668;&#x63D2;&#x4EF6;&#x4F1A;&#x4FEE;&#x6539;&#x903B;&#x8F91;&#xFF0C;&#x5B83;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x91CD;&#x65B0;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x7ED9;&#x5305;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E2A;&#x88AB;&#x5305;&#x8D77;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x5E76;&#x6807;&#x8BB0;&#x5230;&#x5F53;&#x524D;&#x5B83;&#x88AB;&#x6267;&#x884C;&#x7684;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x53BB;&#x505A;&#x4E2A;&#x6807;&#x8BB0;&#xFF0C;&#x5F53;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x7684;&#x6761;&#x4EF6;&#x8FBE;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x5F53; name &#x7684;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;Text(name) &#x6240;&#x5728;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x5C31;&#x4F1A;&#x53D1;&#x751F; Recompose &#x5177;&#x4F53;&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x6240;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x5B83;&#x4F1A;&#x91CD;&#x65B0;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5B83;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x53D8;&#x91CF;&#x503C;&#x5C31;&#x662F;&#x6700;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x5C31;&#x80FD;&#x57FA;&#x4E8E;&#x6700;&#x65B0;&#x503C;&#x7EC4;&#x5408;&#x51FA;&#x6700;&#x65B0;&#x7684;&#x754C;&#x9762;&#xFF1B;&#x5982;&#x679C;&#x7EC4;&#x5408;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x4E0A;&#x4E00;&#x6B21;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5E03;&#x5C40;&#x548C;&#x7ED8;&#x5236;&#x6D41;&#x7A0B;&#x4E5F;&#x4F1A;&#x91CD;&#x65B0;&#x518D;&#x8D70;&#x4E00;&#x904D;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x66F4;&#x65B0;&#x754C;&#x9762;&#x7684;&#x663E;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x7EC4;&#x5408;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x4E0A;&#x6B21;&#x7684;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x8BF4;&#x660E;&#x754C;&#x9762;&#x7684;&#x5B9E;&#x8D28;&#x5185;&#x5BB9;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#xFF1B;</p>
<p>Compose &#x5E76;&#x4E0D;&#x662F;&#x5305;&#x88F9;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x662F;&#x5305;&#x88F9;&#x9700;&#x8981;&#x5305;&#x88F9;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x9700;&#x8981;&#x5305;&#x88F9;&#x7684;&#x4EE3;&#x7801;&#xFF1F;&#x5C31;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F8B;&#x5982; Text(name) &#x8FD9;&#x4E2A; name &#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A; name &#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A; Text &#x5C31;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x9700;&#x8981;&#x88AB;&#x5305;&#x88F9;&#x7684;&#x4EE3;&#x7801;&#xFF1B;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4; ReCompose &#x5E76;&#x4E0D;&#x662F;&#x5168;&#x5C40;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x505A;&#x624D;&#x505A;&#xFF0C;&#x8FD9;&#x79CD;&#x88AB;&#x5305;&#x88F9;&#x8D77;&#x6765;&#x5728; ReCompose &#x7684;&#x65F6;&#x5019;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x8303;&#x56F4;&#x5C31;&#x88AB; Compose &#x79F0;&#x4F5C; ReCompose Scope&#xFF08;&#x91CD;&#x7EC4;&#x4F5C;&#x7528;&#x57DF;&#xFF09;</p>
<p>&#x6240;&#x4EE5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x5728;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">csharp&#x590D;&#x5236;&#x4EE3;&#x7801;var name by mutableStateOf(&quot;&#x8001;A&quot;)</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#x4E0A;&#xFF0C;&#x5B83;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x4E0D;&#x662F; Text(name) &#x8FD9;&#x4E00;&#x884C;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x88AB;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x5305;&#x542B;&#x4E86; name &#x7684;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5F53; Text(name) &#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x6240;&#x7528;&#x5230;&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x521A;&#x624D;&#x88AB;&#x534F;&#x7A0B;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x503C;&#x4E86;&#xFF08;&#x201D;Mars&#x201D;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x7684;&#x503C;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; &#x201C;&#x8001;A&#x201D; &#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x4E0D;&#x662F;&#x8D4B;&#x503C;&#x5931;&#x8D25;&#xFF0C;&#x800C;&#x662F;&#x8D4B;&#x503C;&#x4E4B;&#x540E;&#x89E6;&#x53D1;&#x4E86; ReCompose&#xFF0C;&#x5E76;&#x4E14; ReCompose &#x7684;&#x8303;&#x56F4;&#x6CE2;&#x53CA;&#x5230;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5BFC;&#x81F4;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684; name &#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14; Text(name) &#x91CD;&#x65B0;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#xFF1B;&#x800C;&#x90A3;&#x4E2A;&#x65E7;&#x7684; name &#x786E;&#x5B9E;&#x88AB;&#x6539;&#x6210;&#x4E86; &#x201C;Mars&#x201D; &#x4F46;&#x662F; Text &#x7528;&#x7684;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x65E7;&#x7684; name &#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684; name&#xFF1B;</p>
<p>&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5462;&#xFF1F;&#x628A; Text(name) &#x5305;&#x88F9;&#x8D77;&#x6765;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">scss&#x590D;&#x5236;&#x4EE3;&#x7801;var name by mutableStateOf(&quot;&#x8001;A&quot;)</span><br><span class="line">// &#x8FD9;&#x6837;&#x5305;&#x88F9;&#x4E00;&#x4E0B;</span><br><span class="line">Button(onClick = { /*TODO*/ }) {</span><br><span class="line">    Text(text = name)</span><br><span class="line">}</span><br><span class="line">lifecycleScope.launch {</span><br><span class="line">    delay(3000)</span><br><span class="line">    name = &quot;Mars&quot;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h1 id="remember"><a href="#remember" class="headerlink" title="remember"></a>remember</h1><hr>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x5199;&#x7684;(&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;&#x561B;)&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x89C4;&#x907F;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B; IDE &#x6709;&#x6CA1;&#x6709;&#x7ED9;&#x63D0;&#x4F9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x9F20;&#x6807;&#x653E;&#x5230;&#x8B66;&#x544A;&#x7684;&#x5730;&#x65B9;&#x770B;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/7ce7dde7018c9bdf383c9b2ada7b243503284e5e1782ef4948a3b7653b5df5e4" alt="infoflow 2024-02-22 14-47-56.png"></p>
<p><strong>Creating a state object during composition without using remember</strong></p>
<p>&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4F7F;&#x7528; remember &#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; state object&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4F7F;&#x7528; remember &#x6765;&#x5305;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A; state object</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">csharp&#x590D;&#x5236;&#x4EE3;&#x7801;var name by remember { mutableStateOf(&quot;&#x8001;A&quot;) }</span><br></pre></td></tr></table></figure>

<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7EA2;&#x7EBF;&#x8B66;&#x544A;&#x6D88;&#x5931;&#x4E86;;</p>
<p>remember &#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#xFF1A;&#x5728;&#x5B83;&#x7B2C;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x6267;&#x884C; lambda &#x4E2D;&#x7684;&#x4EE3;&#x7801; {mutableStateOf(&#x201C;&#x8001;A&#x201D;)} &#x540C;&#x65F6;&#x5462;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x4FDD;&#x5B58;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x8FD9;&#x4E2A; remember &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x4FDD;&#x5B58;&#x7684;&#x7ED3;&#x679C;&#xFF0C;remember &#x5728;&#x8FD9;&#x91CC;&#x8D77;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x4F5C;&#x7528;&#xFF1B;</p>
<p>&#x6211;&#x4EEC;&#x628A; Button &#x5305;&#x88F9;&#x53BB;&#x6389;&#x770B;&#x4E0B;&#x6548;&#x679C;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line">scss&#x590D;&#x5236;&#x4EE3;&#x7801;setContent {</span><br><span class="line">    Android_VMTheme {</span><br><span class="line">        Surface {</span><br><span class="line">            var name by remember { mutableStateOf(&quot;&#x8001;A&quot;) } </span><br><span class="line">            Text(text = name)</span><br><span class="line">            lifecycleScope.launch {</span><br><span class="line">                delay(3000)</span><br><span class="line">                name = &quot;Mars&quot;</span><br><span class="line">            }</span><br><span class="line">            // Ui()</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;3s &#x540E;&#x53D8;&#x6210;&#x4E86;&#x300E;Mars&#x300F;,&#x4E5F;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x503C;&#x88AB;&#x6539;&#x6210;&#x4E86; Mars&#xFF0C;&#x4E8C;&#x6B21;&#x521D;&#x59CB;&#x5316;&#x62FF;&#x5230;&#x7684;&#x662F;&#x8001;&#x7684;&#x503C;;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x4E2A; remember &#x5728; Compose &#x4E2D;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x7531;&#x4E8E; ReCompose &#x800C;&#x5BFC;&#x81F4;&#x7684;&#x9884;&#x671F;&#x4E4B;&#x5916;&#x7684;&#x67D0;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x53CD;&#x590D;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x8FD9;&#x4E9B;&#x53CD;&#x590D;&#x521D;&#x59CB;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x52A0;&#x4E00;&#x4E2A; remember &#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E86;&#xFF1B;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x600E;&#x4E48;&#x53BB;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x53D8;&#x91CF;&#x4F1A;&#x88AB; ReCompose &#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x662F;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x7684;&#xFF0C;&#x90A3;&#x6015;&#x8FD9;&#x6BB5;&#x903B;&#x8F91;&#x5F00;&#x53D1;&#x8FD9;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x88AB;&#x5916;&#x90E8;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x53EF;&#x63A7;&#x4E86;&#xFF1B;</p>
<p>&#x6240;&#x4EE5; Compose &#x9488;&#x5BF9;&#x6240;&#x6709;&#x7684; mutableStateOf() &#x90FD;&#x52A0;&#x4E0A; remember &#x5305;&#x88F9;&#xFF1B;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x6211;&#x4EEC;&#x7528; remember &#x5305;&#x88F9;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x88AB; Compose &#x5305;&#x88F9;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C; ReCompose &#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x53D8;&#x91CF;&#x7684;&#x53CD;&#x590D;&#x521D;&#x59CB;&#x5316;&#x5E26;&#x6765;&#x7684;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x7ED3;&#x679C;&#xFF1B;</p>
<p>&#x5982;&#x679C;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x5316;&#x6CA1;&#x6709;&#x88AB; Compose &#x5305;&#x88F9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x5316;&#x653E;&#x5230;&#x4E86;&#x5916;&#x9762;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/5bd7efb26379774c7db51e9d8ef0624194090a38e9f2a6e9d0bf8ebd2018df4a" alt="infoflow 2024-02-22 15-06-45.png"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;remember &#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x7EA2;&#x8272;&#x8B66;&#x544A;</p>
<p><strong>@Composable invocations can only happen from the context of a @Composable function</strong></p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4F7F;&#x7528; remember &#x5173;&#x952E;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x65E0;&#x8BBA; Text(name) &#x600E;&#x6837; ReCompose &#x90FD;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4; name &#x53D8;&#x91CF;&#x7684;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#xFF1B;</p>
<p>&#x56E0;&#x4E3A; remember &#x662F;&#x4E00;&#x4E2A; Composable &#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5728;&#x53E6;&#x4E00;&#x4E2A; Composable &#x51FD;&#x6570;&#x4E2D;&#x88AB;&#x8C03;&#x7528;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/a0ed61e38033bcbfd1b3639d21cdc5b8727c1a5df41dcc1d5a977050d68debbd" alt="infoflow 2024-02-22 18-29-52.png"></p>
<p>&#x8FD9;&#x4E2A;&#x8FD8;&#x4F1A;&#x5BFC;&#x81F4;&#x7F16;&#x8BD1;&#x5931;&#x8D25;&#xFF1B;</p>
<h2 id="&#x5E26;&#x53C2;&#x6570;&#x7684;-remember"><a href="#&#x5E26;&#x53C2;&#x6570;&#x7684;-remember" class="headerlink" title="&#x5E26;&#x53C2;&#x6570;&#x7684; remember"></a>&#x5E26;&#x53C2;&#x6570;&#x7684; remember</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">kotlin&#x590D;&#x5236;&#x4EE3;&#x7801;@Composable</span><br><span class="line">fun Request(value: String) {</span><br><span class="line">    val length = remember {</span><br><span class="line">        value.length</span><br><span class="line">    }</span><br><span class="line">    Text(text = &quot;&#x957F;&#x5EA6;&#x4E3A;$length&quot;)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x8FD9;&#x4E2A; Request &#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F20;&#x9012;&#x7684; value &#x503C;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8D77;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x4F20;&#x5165;&#x7684;&#x503C;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6BB5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5C31;&#x6709;&#x95EE;&#x9898;&#x4E86;&#xFF1B;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x7B2C;&#x4E00;&#x6B21; mars</p>
<p>&#x7B2C;&#x4E8C;&#x6B21; mars</p>
<p>&#x7B2C;&#x4E09;&#x6B21; old a</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86; remember &#x90A3;&#x4E48; length &#x7684;&#x957F;&#x5EA6;&#x5C31;&#x4E0D;&#x5BF9;&#x4E86;&#xFF0C;</p>
<p>&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF1F; remember &#x63D0;&#x4F9B;&#x4E86;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x867D;&#x7136;&#x6211;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8981;&#x7ED9;&#x7F13;&#x5B58;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x51E0;&#x4E2A; key&#xFF0C;&#x5982;&#x679C; key &#x548C;&#x4E0A;&#x6B21;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x5C31;&#x7528;&#x7F13;&#x5B58;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x4E86;&#xFF1B;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">kotlin&#x590D;&#x5236;&#x4EE3;&#x7801;@Composable</span><br><span class="line">fun Request(value: String) {</span><br><span class="line">    val length = remember(value) {</span><br><span class="line">        value.length</span><br><span class="line">    }</span><br><span class="line">    Text(text = &quot;&#x957F;&#x5EA6;&#x4E3A;$length&quot;)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x4E2A;&#x610F;&#x601D;&#x5C31;&#x662F; value &#x4F1A;&#x5F71;&#x54CD; lambda &#x4E2D;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x679C; value &#x6CA1;&#x6709;&#x53D8;&#x5C31;&#x4E0D;&#x8BA1;&#x7B97;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x53D8;&#x4E86;&#x5C31;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x903B;&#x8F91;&#xFF1B;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x5230;&#x8FD9;&#x91CC;&#x5427;~~</p>
<h1 id="&#x4E0B;&#x4E00;&#x7AE0;&#x9884;&#x544A;"><a href="#&#x4E0B;&#x4E00;&#x7AE0;&#x9884;&#x544A;" class="headerlink" title="&#x4E0B;&#x4E00;&#x7AE0;&#x9884;&#x544A;"></a>&#x4E0B;&#x4E00;&#x7AE0;&#x9884;&#x544A;</h1><hr>
<p>&#x65E0;&#x72B6;&#x6001;&#xFF0C;&#x72B6;&#x6001;&#x63D0;&#x5347;&#xFF0C;&#x5355;&#x5411;&#x6570;&#x636E;&#x6D41;</p>
<h1 id="&#x6B22;&#x8FCE;&#x4E09;&#x8FDE;"><a href="#&#x6B22;&#x8FCE;&#x4E09;&#x8FDE;" class="headerlink" title="&#x6B22;&#x8FCE;&#x4E09;&#x8FDE;"></a>&#x6B22;&#x8FCE;&#x4E09;&#x8FDE;</h1><hr>
<p>&#x6765;&#x90FD;&#x6765;&#x4E86;&#xFF0C;&#x70B9;&#x4E2A;&#x5173;&#x6CE8;&#x70B9;&#x4E2A;&#x8D5E;&#x5427;&#xFF0C;&#x4F60;&#x7684;&#x652F;&#x6301;&#x662F;&#x6211;&#x6700;&#x5927;&#x7684;&#x52A8;&#x529B;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/d02c92a084d9d2f66b15ca9837e3317a.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7338022547713622070.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7338022547713622070.html" itemprop="url">谈谈普通人做副业的正确顺序</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-22T11:19:50+08:00">
                2024-02-22
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/a54d9dea1a212abfc11892396590b9a00d73a9212ad2677d3ac65614e1185118" alt="&#x666E;&#x901A;&#x4EBA;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x6B63;&#x786E;&#x987A;&#x5E8F;.jpg"></p>
<blockquote>
<p>&#x672C;&#x6587;&#x9996;&#x53D1;&#x4E8E;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<a href="/external_links/a0600ccf65948bdbc3dd78760c7a4dd5.html" target="blank" rel="noopener">&#x561F;&#x7237;&#x521B;&#x4E1A;&#x65E5;&#x8BB0;</a> &#x3002; &#x6211;&#x5DF2;&#x7ECF;&#x575A;&#x6301;&#x65E5;&#x66F4;120&#x5929;+&#xFF0C;&#x6B22;&#x8FCE;&#x8FC7;&#x6765;&#x8FFD;&#x5267;~</p>
</blockquote>
<p>&#x6700;&#x8FD1;&#x6398;&#x91D1;&#x7684;&#x6587;&#x7AE0;&#x6D41;&#x91CF;&#x7279;&#x522B;&#x5927;&#xFF0C;&#x90A3;&#x7BC7;2023&#x5E74;&#x603B;&#x7ED3;&#x7684;&#x70B9;&#x8D5E;&#x8BC4;&#x8BBA;&#x6570;&#x636E;&#x90FD;&#x4E0D;&#x9519;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6709;&#x4E00;&#x4E9B;&#x6267;&#x884C;&#x529B;&#x9AD8;&#x7684;&#x4EBA;&#x4E3B;&#x52A8;&#x6765;&#x94FE;&#x63A5;&#x3002;</p>
<p>&#x7136;&#x540E;&#x548C;&#x5927;&#x5BB6;&#x804A;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53D1;&#x73B0;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x4EE5;&#x524D;&#x662F;&#x6CA1;&#x600E;&#x4E48;&#x63A5;&#x89E6;&#x8FC7;&#x526F;&#x4E1A;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x4E1A;&#x6536;&#x5165;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x524D;&#x51E0;&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x4E1A;&#x5982;&#x679C;&#x53D1;&#x5C55;&#x5F97;&#x597D;&#xFF0C;&#x662F;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x505A;&#x526F;&#x4E1A;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5E72;&#x5230;&#x9000;&#x4F11;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5BF9;&#x5DE5;&#x4F5C;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x62B1;&#x6709;&#x6000;&#x7591;&#xFF0C;&#x5BB3;&#x6015;&#x7A81;&#x7136;&#x5DE5;&#x4F5C;&#x6CA1;&#x4E86;&#xFF0C;&#x8EAB;&#x4E0A;&#x53C8;&#x80CC;&#x8D1F;&#x7740;&#x5404;&#x79CD;&#x503A;&#x52A1;&#xFF0C;&#x4E0A;&#x6709;&#x8001;&#x4E0B;&#x6709;&#x5C0F;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x89C9;&#x5F97;&#x5F88;&#x7126;&#x8651;&#x538B;&#x529B;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x5C1D;&#x8BD5;&#x4EBA;&#x751F;&#x7B2C;&#x4E8C;&#x66F2;&#x7EBF;&#x7684;&#x60F3;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x70C8;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x5E95;&#x8FD8;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5F15;&#x53D1;&#x7684;&#x7126;&#x8651;&#xFF0C;&#x9762;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x5927;&#x5BB6;&#x60F3;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x6765;&#x5BF9;&#x6297;&#x8FD9;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x6216;&#x8005;&#x8BF4;&#x964D;&#x4F4E;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x8BF4;&#x6765;&#x6211;&#x5F88;&#x6709;&#x611F;&#x89E6;&#x554A;&#xFF0C;&#x6211;&#x8FD9;&#x6B21;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x53D1;&#x4E0D;&#x8D77;&#x5DE5;&#x8D44;&#x800C;&#x79BB;&#x804C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6CA1;&#x6709;&#x591A;&#x5E74;&#x79EF;&#x7D2F;&#x7684;&#x526F;&#x4E1A;&#x5E95;&#x5B50;&#x5728;&#xFF0C;&#x90A3;&#x6211;&#x80AF;&#x5B9A;&#x4E5F;&#x7126;&#x8651;&#x5F97;&#x8981;&#x6B7B;&#xFF0C;&#x4E5F;&#x8981;&#x7EE7;&#x7EED;&#x6295;&#x5165;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x5927;&#x519B;&#x91CC;&#x9762;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x611F;&#x8C22;&#x51E0;&#x5E74;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x505A;&#x51FA;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x662F;&#x5927;&#x5BB6;&#x6295;&#x7968;&#x7684;&#x4E00;&#x4E9B;&#x7ED3;&#x679C;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x662F;&#x5361;&#x5728;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x9636;&#x6BB5;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p4/raw/master/img/58e5ddfa1883f8baab61f1907fec9419df8242e4c4df068446a59128780ac66f" alt="image.png"></p>
<p>&#x56DE;&#x5934;&#x6211;&#x518D;&#x6839;&#x636E;&#x5927;&#x5BB6;&#x6295;&#x7968;&#x7ED3;&#x679C;&#x6765;&#x8F93;&#x51FA;&#x4E00;&#x7BC7;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5BF9;&#x65B0;&#x4EBA;&#x5F00;&#x59CB;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x987A;&#x5E8F;&#x8C08;&#x8C08;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<p>1&#xFF1A;&#x8981;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x610F;&#x613F;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x7684;&#x8BDD;&#x4F60;&#x65E0;&#x6CD5;&#x575A;&#x6301;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x70B9;&#x5C0F;&#x632B;&#x6298;&#x5C31;&#x4F1A;&#x505C;&#x6B62;</p>
<p>2&#xFF1A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;1&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5F00;&#x773C;&#x754C;&#x9636;&#x6BB5;&#xFF0C;&#x4F60;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x5404;&#x79CD;&#x526F;&#x4E1A;&#xFF0C;&#x53BB;&#x62C6;&#x89E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x8D5A;&#x5230;&#x94B1;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6838;&#x5FC3;&#x8D5A;&#x94B1;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5148;&#x8981;&#x89C2;&#x4E16;&#x754C;&#xFF0C;&#x624D;&#x6709;&#x4E16;&#x754C;&#x89C2;&#xFF0C;&#x4F60;&#x8981;&#x770B;&#x7684;&#x591A;&#x4E86;&#x61C2;&#x5F97;&#x591A;&#x4E86;&#xFF0C; &#x53EF;&#x9009;&#x62E9;&#x7684;&#x624D;&#x4F1A;&#x53D8;&#x591A;&#x3002;</p>
<p>&#x5F00;&#x773C;&#x754C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x5C31;&#x662F;&#x5C31;&#x662F;&#x5EFA;&#x7ACB;&#x9AD8;&#x8D28;&#x91CF;&#x4FE1;&#x606F;&#x8F93;&#x5165;&#x7BA1;&#x9053;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x627E;&#x8D44;&#x6599;&#xFF0C;&#x514D;&#x8D39;&#x548C;&#x4ED8;&#x8D39;&#x90FD;&#x884C;&#xFF0C;&#x514D;&#x8D39;&#x82B1;&#x65F6;&#x95F4;&#x7701;&#x94B1;&#xFF0C;&#x4ED8;&#x8D39;&#x82B1;&#x94B1;&#x7701;&#x65F6;&#x95F4;&#xFF0C;&#x770B;&#x81EA;&#x5DF1;&#x53D6;&#x820D;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x6BCF;&#x5E74;&#x7528;&#x6765;&#x77E5;&#x8BC6;&#x4ED8;&#x8D39;&#x5927;&#x90E8;&#x5206;&#x94B1;&#x90FD;&#x662F;&#x7528;&#x6765;&#x4E86;&#x89E3;&#x526F;&#x4E1A;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5F88;&#x5C11;&#x52A0;&#x8BAD;&#x7EC3;&#x8425;&#x3002;</p>
<p>3&#xFF1A;&#x5B9E;&#x64CD;&#x5C0F;&#x9879;&#x76EE;&#xFF0C;&#x770B;&#x5F97;&#x518D;&#x591A;&#xFF0C;&#x90FD;&#x4E0D;&#x5982;&#x81EA;&#x5DF1;&#x8EAC;&#x8EAB;&#x5165;&#x5C40;&#x628A;&#x624B;&#x5F04;&#x810F;&#xFF0C;&#x4F60;&#x5B66;&#x5230;&#x4E0D;&#x7B49;&#x4E8E;&#x662F;&#x4F60;&#x638C;&#x63E1;&#xFF0C;&#x53EA;&#x6709;&#x4E0D;&#x65AD;&#x53BB;&#x8BD5;&#x9519;&#x53BB;&#x8FED;&#x4EE3;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x6280;&#x80FD;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#x548C;&#x80FD;&#x529B;&#x624D;&#x662F;&#x4F60;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x6C89;&#x6DC0;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x7B49;&#x4E0B;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#x6765;&#x4E34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x8D77;&#x70B9;&#x624D;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x6311;&#x9009;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE5;&#x524D;&#x4E5F;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E00;&#x6B21;&#xFF0C;&#x56DE;&#x5934;&#x6211;&#x4E13;&#x95E8;&#x518D;&#x5199;&#x4E00;&#x7BC7;&#x8C08;&#x8C08;&#x6211;&#x7684;&#x770B;&#x6CD5;&#x3002;</p>
<p>4&#xFF1A;&#x9009;&#x62E9;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x91CF;&#x5148;&#x9009;&#x62E9;&#x6210;&#x672C;&#x5C0F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4EEC;&#x521A;&#x5F00;&#x59CB;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5173;&#x6CE8;&#x6280;&#x80FD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5148;&#x4ECE;&#x8D5A;&#x5230;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#x5F00;&#x59CB;&#xFF0C;&#x60F3;&#x77E5;&#x8BC6;&#x4ED8;&#x8D39;&#x53C2;&#x52A0;&#x8BAD;&#x7EC3;&#x8425;&#x5565;&#x7684;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x7B49;&#x4F60;&#x540E;&#x671F;&#x5DF2;&#x7ECF;&#x5B9E;&#x8DF5;&#x8FC7;&#x51E0;&#x4E2A;&#x526F;&#x4E1A;&#x9879;&#x76EE;&#x540E;&#xFF0C;&#x6C89;&#x6DC0;&#x4E86;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x80FD;&#x529B;&#x4E86;&#x518D;&#x53BB;&#x3002;&#x90A3;&#x6837;&#x4F60;&#x6210;&#x529F;&#x7684;&#x6982;&#x7387;&#x624D;&#x4F1A;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x505A;&#x526F;&#x4E1A;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x4EBA;&#x8D27;&#x573A;&#x8FD9;&#x4E2A;&#x5546;&#x4E1A;&#x903B;&#x8F91;&#xFF0C;&#x90FD;&#x6EE1;&#x8DB3;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x80FD;&#x6210;&#x4EA4;&#x3002;</p>
<p>5&#xFF1A;&#x957F;&#x671F;&#x9879;&#x76EE;&#x8FD8;&#x662F;&#x77ED;&#x671F;&#x9879;&#x76EE;</p>
<p>&#x77ED;&#x671F;&#x9879;&#x76EE;&#x7528;&#x6765;&#x7EC3;&#x624B;&#xFF0C;&#x957F;&#x671F;&#x9879;&#x76EE;&#x6765;&#x5403;&#x65F6;&#x95F4;&#x6760;&#x6746;&#x590D;&#x5229;&#x3002;</p>
<p>&#x65B0;&#x4EBA;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x505A;&#x77ED;&#x671F;&#x7684;&#x9879;&#x76EE;&#x6765;&#x7EC3;&#x624B;&#xFF0C;&#x5148;&#x4ECE;&#x8D5A;&#x5230;&#x7B2C;&#x4E00;&#x5757;&#x94B1;&#x5F00;&#x59CB;&#xFF0C;&#x5F62;&#x6210;&#x6B63;&#x53CD;&#x9988;&#x3002;&#x8BF4;&#x5230;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x5C1D;&#x8BD5;&#x505A;&#x8FC7;&#x526F;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x9F13;&#x6363;&#x4E86;&#x597D;&#x4E45;&#x53D1;&#x73B0;&#x6CA1;&#x6709;&#x6B63;&#x53CD;&#x9988;&#xFF0C;1&#x6BDB;&#x94B1;&#x90FD;&#x8D5A;&#x4E0D;&#x5230;&#xFF0C;&#x5F88;&#x6CAE;&#x4E27;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4E5F;&#x53D1;&#x751F;&#x8FC7;&#xFF0C;&#x522B;&#x770B;&#x6211;&#x603B;&#x7ED3;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x63D0;&#x5230;&#x7684;&#x526F;&#x4E1A;&#x90FD;&#x662F;&#x6211;&#x8D5A;&#x5230;&#x94B1;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6211;&#x5C1D;&#x8BD5;&#x4E86;&#x653E;&#x5F03;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x8D5A;&#x5230;&#x94B1;&#x653E;&#x5F03;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x73B0;&#x5728;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6CA1;&#x8D5A;&#x5230;&#x94B1;&#x800C;&#x653E;&#x5F03;&#xFF0C;&#x6211;&#x4F1A;&#x8003;&#x8651;&#x989D;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x80FD;&#x529B;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x505A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x7EFC;&#x5408;&#x8003;&#x8651;&#xFF0C;&#x505A;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x9664;&#x4E86;&#x8D5A;&#x94B1;&#x4E4B;&#x5916;&#x662F;&#x5426;&#x80FD;&#x5B66;&#x5230;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x6211;&#x5C31;&#x7EE7;&#x7EED;&#xFF0C;&#x5982;&#x679C;&#x6280;&#x80FD;&#x90FD;&#x5B66;&#x4F1A;&#x4E86;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x8D5A;&#x5230;&#x94B1;&#xFF0C;&#x6211;&#x518D;&#x8003;&#x8651;&#x653E;&#x5F03;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x5148;&#x8BF4;&#x8FD9;&#x4E9B;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x8981;&#x5C55;&#x5F00;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x9636;&#x6BB5;&#x505A;&#x6CD5;&#x5176;&#x5B9E;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5F88;&#x591A;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x6CA1;&#x7406;&#x987A;&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5927;&#x5BB6;&#x5982;&#x679C;&#x60F3;&#x770B;&#x8FD9;&#x79CD;&#x7CFB;&#x5217;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x53BB;&#x5F52;&#x7EB3;&#x548C;&#x603B;&#x7ED3;&#xFF0C;&#x5199;&#x4E00;&#x4E9B;&#x6211;&#x7684;&#x611F;&#x609F;&#x3002;</p>
<p>&#x9760;&#x8FD1;&#x62FF;&#x5230;&#x8FC7;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#xFF0C;&#x542C;&#x542C;&#x5BF9;&#x65B9;&#x7684;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5FEB;&#x901F;&#x8FDB;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/9816eb9bfa31a2f181bce0d27cd39b92.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7337849561480839231.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7337849561480839231.html" itemprop="url">AI副业最赚钱的应该就是卖课了吧</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2024-02-22T00:21:31+08:00">
                2024-02-22
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8FD9;&#x4E00;&#x5E74;AI&#x76F8;&#x5173;&#x7684;&#x8BDD;&#x9898;&#x4E00;&#x76F4;&#x6CA1;&#x505C;&#x8FC7;&#xFF0C;&#x56FD;&#x5185;&#x5916;&#x5404;&#x5927;&#x5E73;&#x53F0;&#x4E5F;&#x5377;&#x6765;&#x5377;&#x53BB;&#xFF0C;&#x5F53;&#x7136;&#x6700;&#x5F3A;&#x7684;&#x8FD8;&#x662F;Open AI&#x3002;&#x5E73;&#x53F0;&#x4E92;&#x5377;&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x5E73;&#x6C11;&#x767E;&#x59D3;&#x6765;&#x8BF4;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x80FD;&#x767D;&#x5AD6;&#x561B;&#xFF5E;</p>
<p>&#x8FD9;&#x6CE2;AI&#x70ED;&#x6F6E;&#x9664;&#x4E86;AI&#x76F8;&#x5173;&#x7684;&#x4EA7;&#x54C1;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x4E4B;&#x5916;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x70ED;&#x95E8;&#x8BDD;&#x9898;&#x5E94;&#x8BE5;&#x5C31;&#x662F;AI&#x76F8;&#x5173;&#x7684;&#x526F;&#x4E1A;&#x4E86;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x7528;AI&#x5199;&#x4F5C;&#x8D5A;&#x7A3F;&#x8D39;&#xFF0C;&#x7528;AI&#x5199;&#x5C0F;&#x7EA2;&#x4E66;&#x63A8;&#x6587;&#x6070;&#x996D;&#x3002;&#x8FD8;&#x6709;&#x7528;AI&#x7ED8;&#x753B;&#xFF0C;&#x5E2E;&#x522B;&#x4EBA;&#x505A;&#x5934;&#x50CF;&#x3001;&#x505A;&#x58C1;&#x7EB8;&#x8D5A;&#x94B1;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x6CD5;&#x5B50;&#x6211;&#x6CA1;&#x8BD5;&#x8FC7;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x771F;&#x7684;&#x80FD;&#x8D5A;&#x5230;&#x94B1;&#x3002;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x4E1A;&#x6709;&#x70B9;&#x523A;&#x5230;&#x6211;&#x773C;&#x775B;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5356;&#x8BFE;&#x7A0B;&#x3002;</p>
<p>&#x5404;&#x5927;&#x5E73;&#x53F0;&#x90FD;&#x6709;&#x8FD9;&#x7C7B;&#x8BFE;&#x7A0B;&#xFF0C;&#x6155;&#x8BFE;&#x7F51;&#x3001;B&#x7AD9;&#x3001;&#x6781;&#x5BA2;&#x65F6;&#x95F4;&#x3001;&#x77E5;&#x8BC6;&#x661F;&#x7403;&#x7B49;&#x5E73;&#x53F0;&#x90FD;&#x6709;&#x3002;AI&#x8BFE;&#x7A0B;&#x4E3B;&#x8981;&#x5206;2&#x7C7B;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x771F;&#x7684;&#x8BB2;&#x539F;&#x7406;&#x3001;&#x8BB2;&#x642D;&#x5EFA;&#xFF1B;&#x53E6;&#x4E00;&#x7C7B;&#x662F;&#x8BB2;&#x600E;&#x4E48;&#x4F7F;&#x7528;AI&#x4EA7;&#x54C1;&#x3002;&#x524D;&#x4E00;&#x7C7B;&#x8BFE;&#x7A0B;&#x542B;&#x91D1;&#x91CF;&#x662F;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#xFF0C;&#x800C;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;AI&#x4EA7;&#x54C1;&#x8FD9;&#x7C7B;&#x4ED8;&#x8D39;&#x8BFE;&#x7A0B;&#x771F;&#x7684;&#x662F;&#x9570;&#x5200;&#x9AD8;&#x624B;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x662F;<strong>&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;AI&#x4EA7;&#x54C1;&#x7684;&#x4ED8;&#x8D39;&#x8BFE;&#x7A0B;</strong>&#x3002;&#x6BD4;&#x5982;&#x8BA9;&#x4F60;&#x82B1;&#x94B1;&#x5B66;AI&#x5199;&#x4F5C;&#x3001;AI&#x7ED8;&#x753B;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x80FD;&#x81EA;&#x5DF1;&#x505A;&#x526F;&#x4E1A;&#x7684;&#x8FD9;&#x7C7B;&#x8BFE;&#x7A0B;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x90FD;&#x662F;&#x90A3;&#x8001;&#x5E08;&#x7684;&#x526F;&#x4E1A;&#xFF0C;<strong>&#x4ED6;&#x4EEC;&#x662F;&#x771F;&#x7684;&#x5728;&#x505A;&#x81EA;&#x5DF1;&#x526F;&#x4E1A;&#xFF0C;&#x5728;&#x8D5A;&#x4F60;&#x7684;&#x94B1;&#x3002;</strong></p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;B&#x7AD9;&#x8BFE;&#x5802;&#x627E;&#x4E2A;&#x4ED8;&#x8D39;&#x8BFE;&#x7A0B;&#xFF0C;&#x770B;&#x770B;&#x76EE;&#x5F55;&#xFF0C;&#x80FD;&#x7ED9;&#x4F60;&#x8BD5;&#x770B;&#x7684;&#x90FD;&#x662F;&#x65E0;&#x5173;&#x75DB;&#x75D2;&#x7684;&#x7AE0;&#x8282;&#xFF0C;&#x901A;&#x5E38;&#x5148;&#x7ED9;&#x4F60;&#x5236;&#x9020;&#x70B9;&#x7126;&#x8651;&#xFF0C;&#x6BD4;&#x5982;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x638C;&#x63E1;&#x4E86;AI&#x5DE5;&#x5177;&#x8F6C;&#x5316;&#x6210;&#x751F;&#x4EA7;&#x529B;&#x4E86;&#xFF0C;&#x4F60;&#x5462;&#xFF1F;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x5728;&#x7528;AI&#x505A;&#x526F;&#x4E1A;&#x8D5A;&#x94B1;&#x4E86;&#xFF0C;&#x4F60;&#x5462;&#xFF1F;</p>
<p>&#x800C;&#x540E;&#x9762;&#x7684;&#x8BFE;&#x7A0B;&#x5462;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x90FD;&#x662F;&#x6362;&#x6C64;&#x4E0D;&#x6362;&#x836F;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x77E5;&#x9053;&#x201C;&#x5982;&#x4F55;&#x7528;AI&#x505A;&#x79C1;&#x4EBA;&#x5BB6;&#x6559;&#x201D;&#xFF0C;&#x90A3;&#x4F60;&#x201C;&#x628A;AI&#x53D8;&#x6210;&#x8003;&#x8BD5;&#x795E;&#x5668;&#x201D;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x638C;&#x63E1;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x8BD5;&#x770B;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/da8cae25a7de11764da0901d08e2e0266b06bec4249db04224ad1528684a125b" alt="01.png"></p>
<p>&#x7C7B;&#x4F3C;&#x8FD9;&#x79CD;&#x8BFE;&#x7A0B;&#x5E02;&#x9762;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x662F;&#x6253;&#x5F00;&#x4E2A;AI&#x5DE5;&#x5177;&#xFF0C;&#x7136;&#x540E;&#x6F14;&#x793A;&#x7ED9;&#x4F60;&#x770B;&#x600E;&#x4E48;&#x8F93;&#x5165;&#x63D0;&#x793A;&#x8BCD;&#x3002;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x7684;&#x548C;AI&#x5BF9;&#x8BDD;&#x3002;</p>
<p>&#x8FD9;&#x7C7B;&#x8BFE;&#x7A0B;&#x901A;&#x5E38;&#x90FD;&#x6CA1;&#x5565;&#x542B;&#x91D1;&#x91CF;&#xFF0C;&#x4F46;&#x9500;&#x91CF;&#x5374;&#x4E0D;&#x9519;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x622A;&#x56FE;&#x7684;&#x8FD9;&#x4E2A;&#x8BFE;&#x7A0B;&#xFF0C;&#x5728;B&#x7AD9;&#x6392;&#x540D;&#x5F88;&#x524D;&#xFF0C;&#x800C;&#x4E14;&#x8BC4;&#x8BBA;&#x5F88;&#x597D;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/2175d5abcd3da37e8f414e2846df1eb225224f02d6ab6a934029e0bb86ea2aba" alt="02.png"></p>
<p>&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x548C;&#x4F60;&#x70B9;&#x5916;&#x5356;&#x597D;&#x8BC4;&#x8FD4;&#x73B0;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x7C7B;&#x8BFE;&#x7A0B;&#x901A;&#x5E38;&#x4F1A;&#x9001;AI&#x5DE5;&#x5177;&#x7ED9;&#x4F60;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x597D;&#x8BC4;&#x7684;&#x8BDD;&#x4F1A;&#x9001;&#x591A;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x7ED9;&#x4F60;&#x3002;&#x90FD;&#x662F;&#x4E9B;&#x6210;&#x719F;&#x5957;&#x8DEF;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8BF4;&#x8FD9;&#x7C7B;&#x8BFE;&#x7A0B;&#x6CA1;&#x5565;&#x542B;&#x91D1;&#x91CF;&#x5462;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x60F3;&#x7528;AI&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x7A0D;&#x5FAE;&#x767E;&#x5EA6;&#x4E00;&#x4E0B;&#x5C31;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x5806;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x767E;&#x5EA6;&#x641C;&#x201C;AI&#x5DE5;&#x5177;&#x5BFC;&#x822A;&#x201D;&#xFF0C;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x5E7F;&#x544A;&#x6807;&#x8BC6;&#x7684;&#xFF0C;&#x70B9;&#x8FDB;&#x53BB;&#x5927;&#x6982;&#x7387;&#x90FD;&#x4F1A;&#x7ED9;&#x4F60;&#x5217;&#x4E00;&#x5806;&#x51FA;AI&#x5DE5;&#x5177;&#x51FA;&#x6765;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/d4a55de9877118574d188f1dba675a34d9ac9151741b88e2e0a0ac2467e2517d" alt="03.png"></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p3/raw/master/img/2a891eca788ae1dfdc27e35781a55e7c767be62bd4d4ff51f31b71cf463443f3" alt="04.png"></p>
<p>&#x8FD9;&#x4E9B;&#x6559;&#x4F60;&#x5982;&#x4F55;&#x4F7F;&#x7528;AI&#x5DE5;&#x5177;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x548C;&#x4F60;&#x8BF4;&#x4F60;&#x53EA;&#x8981;&#x638C;&#x63E1;&#x4E86;XXX&#x5DE5;&#x5177;&#x5C31;&#x80FD;&#x7528;AI&#x7ED8;&#x753B;&#xFF0C;&#x5C31;&#x80FD;&#x53BB;&#x505A;&#x526F;&#x4E1A;&#x8D5A;&#x94B1;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4F60;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x7ED8;&#x753B;&#x4E13;&#x4E1A;&#x7684;&#xFF0C;&#x4F60;&#x672C;&#x8EAB;&#x5BF9;&#x7ED8;&#x753B;&#x4E00;&#x70B9;&#x77E5;&#x8BC6;&#x90FD;&#x4E0D;&#x61C2;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x9AD8;&#x5149;&#x5E94;&#x8BE5;&#x6253;&#x5728;&#x54EA;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x9634;&#x5F71;&#x51FA;&#x73B0;&#x5728;&#x54EA;&#x91CC;&#x662F;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x753B;&#x6D3E;&#xFF0C;&#x4F60;&#x672C;&#x8EAB;&#x4E0D;&#x5177;&#x5907;&#x4E00;&#x5B9A;&#x7684;&#x827A;&#x672F;&#x5BA1;&#x7F8E;&#x80FD;&#x529B;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x201C;&#x597D;&#x770B;&#x201D;&#x548C;&#x201C;&#x4E0D;&#x597D;&#x770B;&#x201D;&#xFF0C;&#x4F60;&#x771F;&#x7684;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x901A;&#x8FC7;AI&#x7ED8;&#x753B;&#x8D5A;&#x5230;&#x94B1;&#x3002;</p>
<p>&#x5305;&#x62EC;&#x6700;&#x8FD1; OpenAI &#x53D1;&#x5E03;&#x7684; Sora&#xFF0C;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x89C6;&#x9891;&#x3002;&#x8FD9;&#x5BF9;&#x666E;&#x901A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x7528;&#x5B83;&#x751F;&#x6210;&#x7684;&#x89C6;&#x9891;&#x5927;&#x6982;&#x7387;&#x662F;&#x6CA1;&#x7535;&#x5F71;&#x4E13;&#x4E1A;&#x7684;&#x540C;&#x5B66;&#x7528;&#x5B83;&#x751F;&#x6210;&#x7684;&#x89C6;&#x9891;&#x90A3;&#x4E48;&#x597D;&#x770B;&#x3002;</p>
<p>&#x4F5C;&#x5BB6;&#x901A;&#x8FC7;AI&#x8F85;&#x52A9;&#x5199;&#x4F5C;&#xFF0C;&#x4ED6;&#x4EEC;&#x5199;&#x51FA;&#x6765;&#x7684;&#x5C0F;&#x8BF4;&#x80AF;&#x5B9A;&#x6BD4;&#x7D20;&#x4EBA;&#x7528;AI&#x5199;&#x7684;&#x5C0F;&#x8BF4;&#x7545;&#x9500;&#x3002;</p>
<p>&#x8FD9;&#x7C7B;AI&#x5DE5;&#x5177;&#x6682;&#x65F6;&#x5BF9;&#x7279;&#x5B9A;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x7FA4;&#x662F;&#x6709;&#x8F85;&#x52A9;&#x4F5C;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x8FDC;&#x6CA1;&#x6709;&#x5230;&#x201C;&#x4EBA;&#x4EBA;&#x90FD;&#x201D;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x88AB;&#x8BFE;&#x7A0B;&#x5BA3;&#x4F20;&#x7247;&#x9A97;&#x5230;&#xFF0C;AI&#x6682;&#x65F6;&#x8FD8;&#x53EA;&#x662F;&#x6253;&#x8F85;&#x52A9;&#xFF0C;&#x8981;&#x66FF;&#x4EE3;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#x73B0;&#x5728;&#x4E0D;&#x5B66;&#x5982;&#x4F55;&#x4F7F;&#x7528;AI&#x5DE5;&#x5177;&#x5C31;&#x4F1A;&#x7ACB;&#x523B;&#x88AB;&#x6DD8;&#x6C70;&#x3002;&#x8FD9;&#x90FD;&#x662F;&#x5356;&#x8BFE;&#x7A0B;&#x7684;&#x9500;&#x552E;&#x6280;&#x5DE7;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x90A3;&#x4E9B;&#x901A;&#x8FC7;AI&#x641E;&#x526F;&#x4E1A;&#x8D5A;&#x5230;&#x94B1;&#x7684;&#xFF08;&#x521D;&#x5356;&#x8BFE;&#x5916;&#xFF09;&#x901A;&#x5E38;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x9886;&#x57DF;&#x6709;&#x4E00;&#x5B9A;&#x6280;&#x672F;&#x57FA;&#x7840;&#x3002;&#x5F53;&#x4E0B;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x8981;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x9886;&#x57DF;&#x53BB;&#x6DF1;&#x8015;&#xFF0C;&#x9047;&#x5230;&#x5408;&#x9002;&#x7684;AI&#x5DE5;&#x5177;&#x5C31;&#x7528;&#x5B83;&#x6765;&#x8F85;&#x52A9;&#x81EA;&#x5DF1;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/f2eee8d5d3dc7e1e5ed1232d00cc7b95.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
  </section>

  
  <nav class="pagination">
    <a class="extend prev" rel="prev" href="../78/"><i class="fa fa-angle-left"></i></a><a class="page-number" href="../../">1</a><span class="space">&hellip;</span><a class="page-number" href="../78/">78</a><span class="page-number current">79</span><a class="page-number" href="../80/">80</a><span class="space">&hellip;</span><a class="page-number" href="../178/">178</a><a class="extend next" rel="next" href="../80/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">1775</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">725</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="../../atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="../../lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="../../lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="../../lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="../../lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="../../lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="../../lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="../../js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="../../js/src/motion.js?v=5.1.4"></script>



  
  

  

  


  <script type="text/javascript" src="../../js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
