<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">
<meta name="referrer" content="never">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="../../lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="../../lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="../../css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="../../images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="../../images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="../../images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="../../images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="Hexo, NexT">





  <link rel="alternate" href="../../atom.xml" title="开发者博客 – IT技术 尽在开发者博客" type="application/atom+xml">






<meta property="og:type" content="website">
<meta property="og:title" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:url" content="https://dev.newban.cn/page/183/index.html">
<meta property="og:site_name" content="开发者博客 – IT技术 尽在开发者博客">
<meta property="og:locale" content="zh-Hans">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="开发者博客 – IT技术 尽在开发者博客">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>
<!--谷歌广告验证代码-->
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({
          google_ad_client: "ca-pub-2626449904708114",
          enable_page_level_ads: true
     });
</script>
<!--谷歌广告验证代码-->



  <link rel="canonical" href="https://dev.newban.cn/page/183/">





  <title>开发者博客 – IT技术 尽在开发者博客</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left 
  page-home">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">开发者博客 – IT技术 尽在开发者博客</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">开发者博客 – 科技是第一生产力</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="http://dev.newban.cn/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="https://dev.newban.cn/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off" placeholder="搜索..." spellcheck="false" type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034760120659640333.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034760120659640333.html" itemprop="url">爱奇艺智能内容中台｜无人值守的应用与实践</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T14:22:32+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x672C;&#x6587;&#x4E3A;&#x7231;&#x5947;&#x827A;&#x667A;&#x80FD;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x7CFB;&#x5217;&#x7A3F;&#x4EF6;&#x7684;&#x7B2C;&#x4E00;&#x5F39;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x9646;&#x7EED;&#x4E3A;&#x5927;&#x5BB6;&#x5E26;&#x6765;&#x7231;&#x5947;&#x827A;&#x5728;&#x667A;&#x80FD;&#x5185;&#x5BB9;&#x751F;&#x4EA7;&#x3001;&#x8FD0;&#x8425;&#x4E0A;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x63A2;&#x7D22;&#xFF0C;&#x656C;&#x8BF7;&#x671F;&#x5F85;&#x3002;</p>
<p>&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x662F;&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x667A;&#x80FD;&#x5316;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x5BC6;&#x5EA6;&#x5927;&#x3001;&#x6D41;&#x7A0B;&#x957F;&#x3001;&#x4F9D;&#x8D56;&#x670D;&#x52A1;&#x591A;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x5F53;&#x4E2D;&#xFF0C;&#x6545;&#x969C;&#x7684;&#x51FA;&#x73B0;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x73B0;&#x8C61;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x6001;&#x3002;&#x6240;&#x4EE5;&#x6545;&#x969C;&#x51FA;&#x73B0;&#x540E;&#xFF0C;&#x80FD;&#x53CA;&#x65F6;&#x53D1;&#x73B0;&#x3001;&#x53CA;&#x65F6;&#x5904;&#x7406;&#x662F;&#x5BF9;&#x7EBF;&#x4E0A;&#x8FD0;&#x884C;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;&#x5FC5;&#x7136;&#x8981;&#x6C42;&#x3002;&#x5E38;&#x89C4;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x62A5;&#x8B66;+&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5BFC;&#x81F4;&#x4E86;&#x5FC5;&#x987B;&#x6709;&#x4EBA;&#x503C;&#x5B88;&#xFF0C;&#x800C;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#x7684;&#x65F6;&#x6548;&#x6027;&#x4E0D;&#x597D;&#x4FDD;&#x8BC1;&#xFF0C;&#x540C;&#x65F6;&#x4EBA;&#x5DE5;&#x6210;&#x672C;&#x4E5F;&#x5FC5;&#x7136;&#x589E;&#x52A0;&#x3002;</p>
<p>&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x540C;&#x6837;&#x9762;&#x4E34;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x89E3;&#x51B3;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x672C;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#xFF0C;&#x4E5F;&#x662F;&#x4E2D;&#x53F0;&#x667A;&#x80FD;&#x5316;&#x7684;&#x91CD;&#x8981;&#x65B9;&#x5411;&#x3002;&#x5BF9;&#x6BD4;&#x4F20;&#x7EDF;&#x7684;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x667A;&#x80FD;&#x5316;&#x7684;&#x670D;&#x52A1;&#x6765;&#x5B8C;&#x6210;&#x76D1;&#x63A7;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x517C;&#x987E;&#x6545;&#x969C;&#x667A;&#x80FD;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x65B9;&#x4FBF;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x624B;&#x6BB5;&#x4ECB;&#x5165;&#x3002;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x662F;&#x5728;&#x4E0A;&#x8FF0;&#x80CC;&#x666F;&#x4E0B;&#x7531;&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x8BBE;&#x8BA1;&#x7814;&#x53D1;&#x7684;&#x667A;&#x80FD;&#x5316;&#x5F00;&#x653E;&#x5F0F;&#x6545;&#x969C;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x4E00;&#x3001;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x76EE;&#x6807;"><a href="#&#x4E00;&#x3001;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x76EE;&#x6807;" class="headerlink" title="&#x4E00;&#x3001;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x76EE;&#x6807;"></a>&#x4E00;&#x3001;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x76EE;&#x6807;</h3><p>&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8F85;&#x52A9;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x8FBE;&#x5230;&#x6D41;&#x7A0B;&#x81EA;&#x52A8;&#x5316;&#x3001;&#x7ED3;&#x679C;&#x53EF;&#x4FE1;&#x8D56;&#x3001;&#x65E0;&#x9700;&#x4EBA;&#x5DE5;&#x503C;&#x5B88;&#x3002;</p>
<p>&#x5728;&#x9879;&#x76EE;&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x521D;&#x8877;&#x662F;&#xFF1A;&#x5728;&#x7231;&#x5947;&#x827A;&#x4E2D;&#x53F0;&#x8282;&#x76EE;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x76EF;&#x76D8;&#x6765;&#x4FDD;&#x969C;&#x8282;&#x76EE;&#x751F;&#x4EA7;&#x6D41;&#x7A0B;&#x6B63;&#x5E38;&#x3001;&#x4E0A;&#x7EBF;&#x51C6;&#x65F6;&#x3002;&#x5728;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x53CA;&#x65F6;&#x53D1;&#x73B0;&#x3001;&#x81EA;&#x52A8;&#x4FEE;&#x590D;&#x3001;&#x98CE;&#x9669;&#x9884;&#x8B66;&#x3001;&#x901A;&#x77E5;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#x7B49;&#x4EE5;&#x4FDD;&#x969C;&#x8282;&#x76EE;&#x51C6;&#x65F6;&#x4E0A;&#x7EBF;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x9700;&#x8981;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x80FD;&#x529B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/f574037bdbae28c1fbca05089723566459effcccfc11819db0eb3efbf331e405" alt></p>
<h3 id="&#x4E8C;&#x3001;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x4ECB;&#x7ECD;"><a href="#&#x4E8C;&#x3001;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x4E8C;&#x3001;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x4ECB;&#x7ECD;"></a>&#x4E8C;&#x3001;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x4ECB;&#x7ECD;</h3><p>&#x6982;&#x62EC;&#x8D77;&#x6765;&#xFF0C;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#xFF1A;&#x9996;&#x5148;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x7684;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#xFF0C;&#x5C06;&#x4E1A;&#x52A1;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x548C;&#x5F02;&#x5E38;&#x6536;&#x96C6;&#x5230;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x5B9E;&#x65F6;&#x667A;&#x80FD;&#x5206;&#x6790;&#xFF0C;&#x5B9E;&#x65F6;&#x53D1;&#x73B0;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x6545;&#x969C;&#x548C;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x3002;&#x7136;&#x540E;&#x4EA4;&#x7531;&#x6545;&#x969C;&#x548C;&#x4E1A;&#x52A1;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x7684;&#x667A;&#x80FD;&#x5904;&#x7406;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x81EA;&#x52A8;&#x5316;&#x5F02;&#x5E38;&#x548C;&#x6545;&#x969C;&#x5904;&#x7406;&#xFF0C;&#x6700;&#x7EC8;&#x5B9E;&#x73B0;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x548C;&#x7CFB;&#x7EDF;&#x667A;&#x80FD;&#x5316;&#x6062;&#x590D;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/5ad4bc70b8e33c119aff4fa3675afb8894012701a49d214b2cb9a7720f60a1dc" alt></p>
<p>&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x6D41;&#x7A0B;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<ol>
<li>&#x91C7;&#x96C6;&#x751F;&#x4EA7;&#x73AF;&#x8282;&#x6570;&#x636E;&#x5230;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x7231;&#x5947;&#x827A;&#x7684;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x91C7;&#x96C6;&#x3002;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x6295;&#x9012;&#x6570;&#x636E;&#x5230;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x4ECE;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x3002;</li>
<li>&#x7531;&#x51B3;&#x7B56;&#x5F15;&#x64CE;&#x5BF9;&#x91C7;&#x96C6;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5B9E;&#x65F6;&#x5206;&#x6790;&#xFF0C;&#x6839;&#x636E;SLA&#x3001;&#x5F02;&#x5E38;&#x3001;&#x9608;&#x503C;&#x7B49;&#x914D;&#x7F6E;&#x5206;&#x6790;&#x51FA;&#x5F02;&#x5E38;&#x6570;&#x636E;&#xFF0C;&#x5F62;&#x6210;&#x5355;&#x72EC;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</li>
<li>&#x5C06;&#x4E8B;&#x4EF6;&#x6295;&#x9012;&#x5230;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;Beacon&#x3002;</li>
<li>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x4E8B;&#x4EF6;&#x914D;&#x7F6E;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x4E8B;&#x4EF6;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5B8C;&#x5168;&#x914D;&#x7F6E;&#x5316;&#xFF0C;&#x652F;&#x6301;&#x6545;&#x969C;&#x4FEE;&#x590D;&#x3001;&#x62A5;&#x8B66;&#x901A;&#x77E5;&#x3001;&#x6545;&#x969C;&#x6062;&#x590D;&#x68C0;&#x6D4B;&#x3001;&#x6545;&#x969C;&#x7EDF;&#x8BA1;&#x7B49;&#x3002;</li>
<li>&#x8BAD;&#x7EC3;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x79BB;&#x7EBF;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x5206;&#x6790;&#x6A21;&#x578B;&#xFF0C;&#x6A21;&#x578B;&#x6570;&#x636E;&#x518D;&#x63D0;&#x4F9B;&#x7ED9;&#x51B3;&#x7B56;&#x5F15;&#x64CE;&#x7528;&#x4E8E;&#x51B3;&#x7B56;&#x3002;</li>
</ol>
<h3 id="&#x4E09;&#x3001;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4ECB;&#x7ECD;"><a href="#&#x4E09;&#x3001;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x4E09;&#x3001;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4ECB;&#x7ECD;"></a>&#x4E09;&#x3001;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4ECB;&#x7ECD;</h3><p>&#x4E0B;&#x9762;&#x9010;&#x4E00;&#x4ECB;&#x7ECD;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x6A21;&#x5757;&#xFF1A;</p>
<p><strong>3.1 &#x8FD0;&#x884C;&#x6570;&#x636E;&#x5B9E;&#x65F6;&#x91C7;&#x96C6;&#x6A21;&#x5757;&#xFF08;&#x57FA;&#x4E8E;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;</strong></p>
<p>&#x901A;&#x8FC7;&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x56E2;&#x961F;&#x5B9E;&#x73B0;&#x7684;OLTP&#x57FA;&#x7840;&#x7EC4;&#x4EF6;&#xFF08;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#xFF0C;&#x5B9E;&#x65F6;&#x91C7;&#x96C6;&#x5404;&#x4E2A;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x548C;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x8FDB;&#x5EA6;&#x548C;&#x72B6;&#x6001;&#x3002;OLTP&#x57FA;&#x7840;&#x7EC4;&#x4EF6;&#xFF08;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x7ED9;&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x5B9E;&#x65F6;&#x5206;&#x6790;&#x5904;&#x7406;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x4E2D;&#x53F0;&#x8FD0;&#x884C;&#x7684;&#x5404;&#x7C7B;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x6295;&#x9012;&#x5230;&#x8BE5;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x6570;&#x636E;&#x7684;&#x76D1;&#x542C;&#x548C;&#x67E5;&#x8BE2;&#x529F;&#x80FD;&#xFF0C;&#x80FD;&#x652F;&#x6301;TB&#x96C6;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x7BA1;&#x7406;&#x548C;&#x7EF4;&#x62A4;&#x3002;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7684;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x5C55;&#x5F00;&#x3002;</p>
<p>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x6D41;&#x7A0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/9a33c655da7641be7e9ebe25ff2d31fa0944f4bdc31d0afada0be1a828d87aff" alt></p>
<p>&#x4E0B;&#x9762;&#x4EE5;&#x4E13;&#x4E1A;&#x5185;&#x5BB9;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#xFF08;PPC&#xFF09;&#x4E3A;&#x4F8B;&#xFF1A;</p>
<p><strong>&#x5236;&#x4F5C;&#x6295;&#x9012;</strong>&#xFF1A;&#x5236;&#x4F5C;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5C06;&#x5236;&#x4F5C;&#x72B6;&#x6001;&#x3001;&#x6210;&#x7247;&#x751F;&#x4EA7;&#x72B6;&#x6001;&#xFF0C;&#x6295;&#x9012;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
<p><strong>&#x8FD0;&#x8425;&#x6D41;&#x751F;&#x4EA7;&#x6295;&#x9012;</strong>&#xFF1A;&#x8FD0;&#x8425;&#x6D41;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x89C6;&#x9891;&#x6D41;&#x751F;&#x4EA7;&#x72B6;&#x6001;&#x3001;&#x97F3;&#x9891;&#x751F;&#x4EA7;&#x72B6;&#x6001;&#x3001;&#x5B57;&#x5E55;&#x751F;&#x4EA7;&#x72B6;&#x6001;&#x6295;&#x9012;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
<p><strong>&#x5BA1;&#x6838;&#x6295;&#x9012;</strong>&#xFF1A;&#x5BA1;&#x6838;&#x7CFB;&#x7EDF;&#x5C06;&#x5BA1;&#x6838;&#x72B6;&#x6001;&#x3001;&#x5BA1;&#x6838;&#x65F6;&#x95F4;&#x7B49;&#x4FE1;&#x606F;&#x6295;&#x9012;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
<p><strong>&#x53D1;&#x5E03;&#x6295;&#x9012;</strong>&#xFF1A;&#x53D1;&#x5E03;&#x7CFB;&#x7EDF;&#x5C06;&#x7801;&#x6D41;&#x53D1;&#x5E03;&#x72B6;&#x6001;&#x515C;&#x5E95;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x83B7;&#x53D6;&#x5230;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x53D1;&#x9001;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x901A;&#x77E5;&#x5230;RMQ&#x961F;&#x5217;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x76D1;&#x542C;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x62C9;&#x53D6;&#x5230;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x3002;&#x4ECE;&#x800C;&#x83B7;&#x53D6;&#x8282;&#x76EE;&#x4ECE;&#x5236;&#x4F5C;&#x5230;&#x6700;&#x7EC8;&#x53D1;&#x5E03;&#x7684;&#x8FD0;&#x884C;&#x6570;&#x636E;&#xFF0C;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x3002;</p>
<p><strong>3.2 &#x51B3;&#x7B56;&#x5F15;&#x64CE;</strong></p>
<p>&#x57FA;&#x4E8E;&#x91C7;&#x96C6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x65F6;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x548C;&#x4E1A;&#x52A1;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#xFF0C;&#x51B3;&#x7B56;&#x5F15;&#x64CE;&#x4E3B;&#x8981;&#x63D0;&#x4F9B;&#x5982;&#x4E0B;&#x529F;&#x80FD;&#xFF1A;</p>
<p><strong>&#x9519;&#x8BEF;&#x63A2;&#x67E5;</strong>&#xFF1A;&#x5B9E;&#x65F6;&#x63A2;&#x6D4B;&#x7CFB;&#x7EDF;&#x548C;&#x4E1A;&#x52A1;&#x9519;&#x8BEF;&#xFF0C;&#x5BF9;&#x9519;&#x8BEF;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x53D1;&#x9001;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><strong>&#x8D85;&#x65F6;&#x9884;&#x8B66;</strong>&#xFF1A;&#x57FA;&#x4E8E;&#x4E1A;&#x52A1;&#x8282;&#x70B9;&#x7684;SLA&#x914D;&#x7F6E;&#xFF0C;&#x5BF9;&#x8D85;&#x65F6;&#x4E1A;&#x52A1;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x63A2;&#x6D4B;&#x548C;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x53D1;&#x9001;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><strong>&#x53EF;&#x914D;&#x7F6E;&#x5316;&#x7B56;&#x7565;</strong>&#xFF1A;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x63A5;&#x5165;&#x7684;&#x914D;&#x7F6E;&#x548C;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7684;SLA&#x914D;&#x7F6E;&#x3001;&#x6743;&#x9650;&#x914D;&#x7F6E;&#x3001;&#x7EDF;&#x8BA1;&#x901A;&#x77E5;&#x914D;&#x7F6E;&#x7B49;&#x3002;</p>
<p>&#x51B3;&#x7B56;&#x5F15;&#x64CE;&#x7684;&#x8FD0;&#x884C;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x8FB9;&#x5DE5;&#x4F5C;&#x8FB9;&#x6536;&#x96C6;&#x8FDB;&#x5EA6;&#x53CA;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x65AD;check&#x670D;&#x52A1;&#x8FDB;&#x5EA6;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x3001;&#x662F;&#x5426;&#x6709;&#x5F02;&#x5E38;&#x72B6;&#x51B5;&#x6216;&#x8005;&#x8D85;&#x65F6;&#x72B6;&#x51B5;&#xFF0C;&#x65E8;&#x5728;&#x80FD;&#x591F;&#x5728;&#x51FA;&#x95EE;&#x9898;&#x65F6;&#x7684;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6309;&#x7167;&#x4E0B;&#x56FE;&#x7684;&#x903B;&#x8F91;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<p>&#x670D;&#x52A1;&#x6A21;&#x5757;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x5931;&#x8D25;&#x6216;&#x8005;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x901A;&#x77E5;&#x5931;&#x8D25;&#x548C;&#x8D85;&#x65F6;&#x4E8B;&#x4EF6;&#x7ED9;&#x5916;&#x90E8;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x4E1A;&#x52A1;&#x5355;&#x5143;&#x7684;&#x8FD0;&#x884C;&#x8FDB;&#x5EA6;&#xFF0C;&#x5224;&#x65AD;&#x8FDB;&#x5EA6;&#x662F;&#x5426;&#x6B63;&#x5E38;&#xFF0C;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x901A;&#x77E5;&#x8FDB;&#x5EA6;&#x6EDE;&#x540E;&#x4E8B;&#x4EF6;&#x7ED9;&#x5916;&#x90E8;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/47d7d78d8182b66fdf09ad4151da5ba601e858f416d296a3ce32f9536411c9ea" alt></p>
<p>&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x4E86;&#x903B;&#x8F91;&#x6D41;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x670D;&#x52A1;&#x6A21;&#x5757;&#x7684;&#x8FD0;&#x884C;&#x903B;&#x8F91;&#xFF1A;</p>
<p>&#x670D;&#x52A1;&#x6A21;&#x5757;&#x7684;&#x4E3B;&#x8981;&#x6982;&#x5FF5;&#xFF1A;</p>
<p><strong>&#x6570;&#x636E;&#x6E90;</strong>&#xFF1A;&#x6570;&#x636E;&#x6E90;&#x4E3B;&#x8981;&#x662F;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x64AD;&#x63A7;&#x7684;&#x90E8;&#x5206;&#x6570;&#x636E;&#x4ECE;RMQ&#x91C7;&#x96C6;&#x3002;&#x6570;&#x636E;&#x6E90;&#x7684;&#x6570;&#x636E;&#x7531;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x6295;&#x9012;&#x5230;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
<p><strong>Process</strong>&#xFF1A;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x4ECE;&#x6570;&#x636E;&#x6E90;&#x91C7;&#x96C6;&#x5230;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x5206;&#x522B;&#x6709;&#x4E0D;&#x540C;&#x7684;process&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x91C7;&#x96C6;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
<p><strong>Filter</strong>&#xFF1A;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x91C7;&#x96C6;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x6709;&#x4E9B;&#x662F;&#x7CFB;&#x7EDF;&#x4E0D;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x5B57;&#x6BB5;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x7684;&#xFF0C;filter&#x8D1F;&#x8D23;&#x628A;&#x65E0;&#x6548;&#x7684;&#x6570;&#x636E;&#x8FC7;&#x6EE4;&#x6389;&#x3002;</p>
<p><strong>Transform</strong>&#xFF1A;&#x6570;&#x636E;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x7EDF;&#x4E00;&#x8F6C;&#x6362;&#x6210;&#x51B3;&#x7B56;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p><strong>&#x89C4;&#x5219;&#x6A21;&#x5757;</strong>&#xFF1A;&#x89C4;&#x5219;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x627F;&#x63A5;transform&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6267;&#x884C;&#x914D;&#x7F6E;&#x597D;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8F93;&#x51FA;&#x6210;&#x529F;&#x3001;&#x5931;&#x8D25;&#x3001;&#x5F00;&#x59CB;&#x4E09;&#x79CD;&#x89C4;&#x5219;&#x7ED3;&#x679C;&#x3002;</p>
<p><strong>&#x51B3;&#x7B56;&#x6A21;&#x5757;</strong>&#xFF1A;&#x51B3;&#x7B56;&#x6A21;&#x5757;&#x662F;&#x505A;&#x8D85;&#x65F6;&#x5224;&#x65AD;&#x7684;&#xFF0C;&#x8D85;&#x65F6;&#x5224;&#x65AD;&#x548C;&#x666E;&#x901A;&#x7684;&#x6210;&#x529F;&#x3001;&#x5931;&#x8D25;&#x4E0D;&#x540C;&#xFF0C;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x6BD4;&#x8F83;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x548C;&#x8FDB;&#x5EA6;&#x6765;&#x5224;&#x65AD;&#x4EFB;&#x52A1;&#x662F;&#x5426;&#x8D85;&#x65F6;&#x3002;</p>
<p><strong>&#x5EF6;&#x8FDF;&#x6D88;&#x606F;&#x6A21;&#x5757;</strong>&#xFF1A;&#x901A;&#x8FC7;&#x5EF6;&#x8FDF;&#x6D88;&#x606F;&#xFF0C;&#x5B9A;&#x65F6;&#x672A;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x6765;&#x6821;&#x9A8C;&#x4E1A;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x662F;&#x5426;&#x8D85;&#x65F6;&#x3002;</p>
<p><strong>Sink&#x56DE;&#x5199;</strong>&#xFF1A;&#x8D85;&#x65F6;&#x3001;&#x8D85;&#x9884;&#x671F;&#x4E0A;&#x7EBF;&#x65F6;&#x95F4;&#x7B49;&#x7ED3;&#x8BBA;&#x56DE;&#x5199;&#x6570;&#x636E;&#x6E90;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x6A21;&#x5757;&#x8FD0;&#x884C;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x6982;&#x5FF5;&#x7684;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#xFF0C;&#x8FD0;&#x884C;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#x4E8B;&#x4EF6;&#x6295;&#x9012;&#x7ED9;&#x5916;&#x90E8;&#x3002;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/6fcfe6d81c1bf12fae08bcf791c86470fa10137b43c33a0688cf70d98da0865c" alt></p>
<p><strong>3.3 &#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;Beacon</strong></p>
<p>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;Beacon&#x662F;&#x81EA;&#x7814;&#x7684;&#x63A5;&#x6536;&#x51B3;&#x7B56;&#x5F15;&#x64CE;&#x7684;&#x4E8B;&#x4EF6;&#x5E76;&#x8FDB;&#x884C;&#x6D41;&#x7A0B;&#x5316;&#x5904;&#x7406;&#x7684;&#x6A21;&#x5757;&#x3002;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5343;&#x5DEE;&#x4E07;&#x522B;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x8F6C;&#x7801;&#x5F02;&#x5E38;&#x6709;50&#x591A;&#x79CD;&#xFF0C;&#x6309;&#x7167;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5206;&#x6210;&#x597D;&#x591A;&#x7EC4;&#xFF0C;&#x6BCF;&#x7EC4;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#xFF0C;&#x901A;&#x77E5;&#x4E0D;&#x540C;&#x7684;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x901A;&#x77E5;&#x6A21;&#x5757;&#x5185;&#x5BB9;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x6709;&#x4E9B;&#x4E8B;&#x4EF6;&#x6709;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6CBB;&#x6108;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x6CA1;&#x6709;&#x6CBB;&#x6108;&#x65B9;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x77E5;&#x4E1A;&#x52A1;&#x4EBA;&#x5458;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x6837;&#x591A;&#x6837;&#x5316;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x8BBE;&#x8BA1;&#x4E86;&#x4E13;&#x95E8;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;&#xFF08;Beacon&#xFF09;&#x3002;&#x8BE5;&#x5F15;&#x64CE;&#x652F;&#x6301;&#x6D41;&#x7A0B;&#x7684;&#x914D;&#x7F6E;&#x5316;&#x548C;&#x5B9A;&#x5236;&#x5316;&#xFF0C;&#x9884;&#x7559;&#x4E86;&#x62BD;&#x8C61;&#x5EA6;&#x8F83;&#x9AD8;&#x7684;&#x4E1A;&#x52A1;&#x5BF9;&#x63A5;&#x63A5;&#x53E3;&#x3001;&#x5904;&#x7406;&#x80FD;&#x529B;&#x6269;&#x5C55;&#x65B9;&#x5F0F;&#x548C;&#x6D41;&#x7A0B;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;&#x3002;&#x5C06;&#x652F;&#x6301;&#x65B0;&#x4E1A;&#x52A1;&#x7684;&#x4EE3;&#x4EF7;&#x964D;&#x5230;&#x4E86;&#x6700;&#x4F4E;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7684;&#x6545;&#x969C;&#x662F;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x7ED9;Beacon&#x5904;&#x7406;&#x5F15;&#x64CE;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x67B6;&#x6784;&#xFF1A;</p>
<p>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<p><strong>&#x4E0A;&#x4E0B;&#x6587;&#x529F;&#x80FD;</strong>&#xFF1A;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x53C2;&#x6570;&#x7684;&#x83B7;&#x53D6;&#x548C;&#x4FDD;&#x5B58;&#x3002;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x4FDD;&#x5B58;&#x548C;&#x83B7;&#x53D6;&#x5B9E;&#x73B0;&#x5728;Step&#x57FA;&#x7C7B;&#x4E2D;&#x3002;</p>
<p><strong>&#x6267;&#x884C;&#x5F15;&#x64CE;</strong>&#xFF1A;&#x7B80;&#x5355;&#x53EF;&#x9760;&#x7684;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x3001;&#x6267;&#x884C;&#x5EF6;&#x8FDF;&#x3001;&#x6267;&#x884C;&#x65E5;&#x5FD7;&#x7B49;&#x57FA;&#x7840;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7D22;&#x5F15;Step&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x6D41;&#x7A0B;&#x914D;&#x7F6E;</strong>&#xFF1A;JSON&#x683C;&#x5F0F;&#x7684;&#x6D41;&#x7A0B;&#x914D;&#x7F6E;&#xFF0C;&#x5305;&#x62EC;Step&#xFF0C;StopStrategy&#xFF0C;StepAction&#xFF0C;WaitTimeAfter&#x7B49;&#x6982;&#x5FF5;&#xFF0C;&#x6D41;&#x7A0B;&#x6309;&#x7167;StepIndex&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;</p>
<p>Step&#xFF1A;&#x6B65;&#x9AA4;&#xFF0C;&#x6B65;&#x9AA4;&#x662F;&#x7EC4;&#x6210;&#x6D41;&#x7A0B;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x4F1A;&#x6267;&#x884C;&#x914D;&#x7F6E;&#x7684;StepAction&#x548C;StopStrategy&#x3002;</p>
<p>StopStrategy&#xFF1A;&#x6D41;&#x7A0B;&#x7EC8;&#x6B62;&#x5224;&#x65AD;&#x7B56;&#x7565;&#xFF0C;Step&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x7EE7;&#x627F;&#x4E86;&#x4E0A;&#x4E0B;&#x6587;&#x529F;&#x80FD;&#x3002;&#x6839;&#x636E;&#x914D;&#x7F6E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5224;&#x65AD;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x6700;&#x7EC8;&#x5F62;&#x6001;&#xFF0C;&#x6BD4;&#x5982;&#x6545;&#x969C;&#x662F;&#x5426;&#x6062;&#x590D;&#x7684;&#x5224;&#x65AD;&#x3002;</p>
<p>StepAction&#xFF1A;&#x8981;&#x6267;&#x884C;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;Step&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982;&#x53D1;&#x90AE;&#x4EF6;&#x3001;&#x53D1;&#x6D88;&#x606F;&#x3001;&#x8C03;&#x4E1A;&#x52A1;&#x63A5;&#x53E3;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x5305;&#x88C5;&#x6210;StepAction&#x3002;</p>
<p>WaitTimeAfter&#xFF1A;&#x672C;&#x6B65;&#x9AA4;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5230;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#x9AA4;&#x7684;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x3002;</p>
<p><strong>&#x90AE;&#x4EF6;&#x7B49;&#x901A;&#x77E5;&#x529F;&#x80FD;&#x5BF9;&#x63A5;</strong>&#xFF1A;&#x5BF9;&#x63A5;&#x4F01;&#x4E1A;&#x90AE;&#x4EF6;&#x7CFB;&#x7EDF;&#x7B49;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x77E5;&#x529F;&#x80FD;&#x7684;&#x57FA;&#x7840;&#x7EC4;&#x4EF6;&#x3002;</p>
<p><strong>&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;</strong>&#xFF1A;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#x662F;&#x7EC4;&#x6210;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x4EF6;&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x8F7D;&#x4F53;&#x3002;&#x6D41;&#x7A0B;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x8981;&#x652F;&#x6301;&#x65B0;&#x4E1A;&#x52A1;&#x95EE;&#x9898;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#x6C60;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x4ECE;&#x800C;&#x6269;&#x5C55;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/adf57626f9c344a427d8b0f43643e00c8c68f0077247de611fbf5fcac927d4e6" alt></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6D41;&#x7A0B;&#x914D;&#x7F6E;&#x4F8B;&#x5B50;**&#xFF1A;**</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/9dffe2afe53855850023e993b0149f596c0599fbb17b6acd48ecc910a78dbe4b" alt></p>
<p>&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x914D;&#x7F6E;&#x6545;&#x969C;&#x5904;&#x7406;Action&#x548C;&#x6CBB;&#x6108;&#x5224;&#x65AD;&#x7684;StopStrategy&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x6545;&#x969C;&#x81EA;&#x884C;&#x6062;&#x590D;&#x548C;&#x6CBB;&#x6108;&#x3002;&#x8FD9;&#x91CC;&#x6545;&#x969C;&#x5B9E;&#x9645;&#x662F;&#x4E8B;&#x4EF6;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x6700;&#x540E;&#x7CFB;&#x7EDF;&#x80FD;&#x5E76;&#x6839;&#x636E;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#x51FA;&#x6545;&#x969C;&#x6570;&#x91CF;&#x548C;&#x6CBB;&#x6108;&#x767E;&#x5206;&#x6BD4;&#x3002;</p>
<h3 id="&#x56DB;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF1A;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x9884;&#x4F30;"><a href="#&#x56DB;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF1A;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x9884;&#x4F30;" class="headerlink" title="&#x56DB;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF1A;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x9884;&#x4F30;"></a>&#x56DB;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF1A;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x9884;&#x4F30;</h3><p>&#x6839;&#x636E;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#x8BBE;&#x8BA1;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x8981;&#x63D0;&#x4F9B;&#x5BF9;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#x7684;&#x9884;&#x671F;&#x7BA1;&#x7406;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x8FD0;&#x884C;&#x53EF;&#x9884;&#x671F;&#x7684;&#x76EE;&#x7684;&#x3002;&#x57FA;&#x4E8E;&#x91C7;&#x96C6;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E94;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6280;&#x672F;&#xFF0C;&#x8BAD;&#x7EC3;&#x5404;&#x79CD;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x8FD0;&#x884C;&#x8017;&#x65F6;&#x65B9;&#x9762;&#x7684;&#x5404;&#x79CD;&#x9884;&#x6D4B;&#x80FD;&#x529B;&#xFF0C;&#x6539;&#x8FDB;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x8BF4;&#x660E;&#xFF1A;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x7684;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x8D44;&#x6E90;&#x7A33;&#x5B9A;&#xFF0C;&#x6216;&#x8005;&#x8D44;&#x6E90;&#x6709;&#x4FDD;&#x969C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x8D44;&#x6E90;&#x53D8;&#x52A8;&#x5BF9;&#x8FD0;&#x884C;&#x8017;&#x65F6;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x9488;&#x5BF9;&#x5176;&#x4E2D;&#x7684;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x9884;&#x4F30;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#xFF1A;</p>
<p><strong>&#x95EE;&#x9898;&#x7C7B;&#x578B;&#x5206;&#x6790;</strong>&#xFF1A;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E30;&#x5BCC;&#x7684;&#x89C6;&#x9891;&#x751F;&#x4EA7;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x671F;&#x671B;&#x5F62;&#x6210;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x4EE5;&#x5386;&#x53F2;&#x6570;&#x636E;&#x8BA1;&#x7B97;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x4E3A;&#x7F16;&#x8F91;&#x9884;&#x4F30;&#x89C6;&#x9891;&#x751F;&#x4EA7;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/c7369ba0ad2556df5ee8ff427cd56c5b34606ce4c9410c04822dded207939acb" alt></p>
<p><strong>&#x7279;&#x5F81;&#x5206;&#x6790;</strong>&#xFF1A;&#x6392;&#x9664;&#x7A7A;&#x503C;&#x6570;&#x636E;&#xFF0C;&#x7B5B;&#x9009;&#x6709;&#x4EF7;&#x503C;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;&#x7C7B;&#x522B;&#x7279;&#x5F81;&#xFF1A;</p>
<p>&#x2018;businessType&#x2019;, &#x201C;channel&#x201D;, &#x2018;cloudEncode&#x2019;,&#x2019;trancodeType&#x2019;, &#x201C;priority&#x201D;, &#x201C;programType&#x201D;,  </p>
<p>&#x201C;serviceCode&#x201D;, &#x201C;needAIInsertFrame&#x201D;, &#x201C;needAudit&#x201D;,&#x201D;bitrateCode&#x201D;, &#x201C;platform&#x201D;, &#x201C;resolution&#x201D;&#x2026;&#x2026;</p>
<p>&#x6570;&#x503C;&#x7279;&#x5F81;&#xFF1A;&#x2019;duration&#x2019;</p>
<p><strong>&#x7C7B;&#x522B;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x5206;&#x5E03;&#x5206;&#x6790;</strong></p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/95da3bcc37c13c6d8d04314acd0c41bdc7300ec8c11b13b2f4c5996aad6674ec" alt></p>
<p><strong>&#x7B97;&#x6CD5;&#x9009;&#x62E9;</strong>&#xFF1A;</p>
<p>&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x53BB;&#x9664;&#x5F02;&#x5E38;&#x503C;&#xFF0C;&#x91C7;&#x7528;XGBoost&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x3002;</p>
<p>XGBoost&#xFF1A;&#x5B9E;&#x73B0;&#x4E86;GBDT&#x7B97;&#x6CD5;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x7B97;&#x6CD5;&#x548C;&#x5DE5;&#x7A0B;&#x4E0A;&#x7684;&#x8BB8;&#x591A;&#x6539;&#x8FDB;&#xFF0C;&#xFF08;GBDT(Gradient Boosting Decision Tree)&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x51B3;&#x7B56;&#x6811;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x53EB;X (Extreme) GBoosted&#x3002;</p>
<p>&#x5B83;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#x5C06;&#x57FA;&#x5206;&#x7C7B;&#x5668;&#x5C42;&#x5C42;&#x53E0;&#x52A0;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x524D;&#x4E00;&#x5C42;&#x57FA;&#x5206;&#x7C7B;&#x5668;&#x6837;&#x672C;&#xFF0C;&#x8C03;&#x6574;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x91CD;&#x3002;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x6839;&#x636E;&#x5404;&#x5C42;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x52A0;&#x6743;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x6709;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x76F8;&#x52A0;&#x7B49;&#x4E8E;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x4E0B;&#x4E00;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x53BB;&#x62DF;&#x5408;&#x8BEF;&#x5DEE;&#x51FD;&#x6570;&#x5BF9;&#x9884;&#x6D4B;&#x503C;&#x7684;&#x6B8B;&#x5DEE;(&#x8FD9;&#x4E2A;&#x6B8B;&#x5DEE;&#x5C31;&#x662F;&#x9884;&#x6D4B;&#x503C;&#x4E0E;&#x771F;&#x5B9E;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;)&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/1b7468d442e340396e172b6c1ce4d535e5c42e3ff0209c5e40cb37339728258b" alt></p>
<h3 id="&#x4E94;&#x3001;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x53CD;&#x9988;"><a href="#&#x4E94;&#x3001;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x53CD;&#x9988;" class="headerlink" title="&#x4E94;&#x3001;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x53CD;&#x9988;"></a>&#x4E94;&#x3001;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x53CD;&#x9988;</h3><p>&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x4E3A;&#x6240;&#x6709;&#x5BF9;&#x63A5;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x751F;&#x6210;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x65E5;&#x62A5;&#xFF0C;&#x5E76;&#x63A8;&#x9001;&#x7ED9;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x9519;&#x8BEF;&#x3001;&#x6545;&#x969C;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x548C;&#x660E;&#x7EC6;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x6EE1;&#x8DB3;SLA&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x57FA;&#x4E8E;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x53CD;&#x9988;&#x7684;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x6539;&#x8FDB;&#x548C;&#x7CFB;&#x7EDF;&#x4F18;&#x5316;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x63A8;&#x52A8;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x6301;&#x7EED;&#x5347;&#x7EA7;&#x6539;&#x9020;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x65E5;&#x62A5;&#x7684;&#x5185;&#x5BB9;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/e9aa52ba4187cfcc8723a0b3c371e0cd48f048ef3408d8824a3e04188f4d69fe" alt></p>
<h3 id="&#x516D;&#x3001;&#x4E0A;&#x7EBF;&#x6548;&#x679C;"><a href="#&#x516D;&#x3001;&#x4E0A;&#x7EBF;&#x6548;&#x679C;" class="headerlink" title="&#x516D;&#x3001;&#x4E0A;&#x7EBF;&#x6548;&#x679C;"></a>&#x516D;&#x3001;&#x4E0A;&#x7EBF;&#x6548;&#x679C;</h3><p>&#x5728;&#x7231;&#x5947;&#x827A;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8986;&#x76D6;&#x4E86;&#x7231;&#x5947;&#x827A;&#x5185;&#x5BB9;&#x4E2D;&#x53F0;&#x7684;&#x91CD;&#x8981;&#x751F;&#x4EA7;&#x73AF;&#x8282;&#xFF0C;&#x5BF9;&#x6BCF;&#x5929;&#x51E0;&#x5341;&#x4E07;&#x7684;&#x8282;&#x76EE;&#x751F;&#x4EA7;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x9760;&#x6027;&#x62A5;&#x969C;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7387;&#x8FBE;&#x5230;&#x4E86;99%&#x4EE5;&#x4E0A;&#xFF0C;&#x7D2F;&#x79EF;&#x53D1;&#x73B0;&#x95EE;&#x9898;3000&#x591A;&#x4E2A;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x5904;&#x7406;2800&#x4E2A;&#x4EE5;&#x4E0A;&#x3002;&#x6781;&#x5927;&#x7684;&#x8282;&#x7EA6;&#x4E86;&#x4EBA;&#x529B;&#x6210;&#x672C;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x8282;&#x76EE;&#x6309;&#x65F6;&#x4E0A;&#x7EBF;&#x7387;&#x3002;</p>
<h3 id="&#x4E03;&#x3001;&#x672A;&#x6765;&#x65B9;&#x5411;"><a href="#&#x4E03;&#x3001;&#x672A;&#x6765;&#x65B9;&#x5411;" class="headerlink" title="&#x4E03;&#x3001;&#x672A;&#x6765;&#x65B9;&#x5411;"></a>&#x4E03;&#x3001;&#x672A;&#x6765;&#x65B9;&#x5411;</h3><p>&#x672A;&#x6765;&#xFF0C;&#x5E0C;&#x671B;&#x57FA;&#x4E8E;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x7684;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x667A;&#x80FD;&#x5316;&#x5206;&#x6790;&#xFF0C;&#x4E3B;&#x52A8;&#x53D1;&#x73B0;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x524D;&#x9884;&#x8B66;&#xFF0C;&#x63D0;&#x524D;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7CFB;&#x7EDF;&#x76EE;&#x524D;&#x53EA;&#x662F;&#x9488;&#x5BF9;&#x70B9;&#x72B6;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x503C;&#x5B88;&#xFF0C;&#x672A;&#x6765;&#x4F1A;&#x4EE5;&#x8282;&#x76EE;&#x4E3A;&#x6574;&#x4F53;&#x8FDB;&#x884C;&#x503C;&#x5B88;&#x548C;&#x95EE;&#x9898;&#x5904;&#x7406;&#xFF0C;&#x63D0;&#x4F9B;&#x7531;&#x70B9;&#x5230;&#x7EBF;&#xFF0C;&#x518D;&#x5230;&#x9762;&#x7684;&#x5168;&#x65B9;&#x4F4D;&#x503C;&#x5B88;&#x670D;&#x52A1;&#x3002;&#x6BD4;&#x5982;&#x4EE5;&#x8282;&#x76EE;&#x4E3A;&#x7C92;&#x5EA6;&#xFF0C;&#x63D0;&#x4F9B;&#x65AD;&#x70B9;&#x7EED;&#x8F6C;&#xFF0C;&#x540E;&#x6765;&#x5C45;&#x4E0A;&#x7B49;&#x66F4;&#x52A0;&#x667A;&#x80FD;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/80db344902d13fbb4079ae0c76a54355.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034745656862310407.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034745656862310407.html" itemprop="url">【第三方库】Captcha captcha</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T13:28:34+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="captcha"><a href="#captcha" class="headerlink" title="captcha"></a>captcha</h1><blockquote>
<p>&#x6587;&#x6863;&#xFF1A;<a href="/external_links/333ab9f0141cff759b958b4bcc713b38.html" target="blank" rel="noopener">&#x5B98;&#x65B9;</a></p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x5E93;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;&#x4ED6;&#x5177;&#x5907;&#x5F88;&#x591A;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x81EA;&#x5B9A;&#x4E49;&#x9A8C;&#x8BC1;&#x7801;&#x957F;&#x5EA6;</li>
<li>&#x751F;&#x6210;&#x7684;&#x56FE;&#x7247;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x5185;&#x5B58;&#x5B58;&#x50A8;&#xFF0C;&#x901A;&#x8FC7; <code>path</code> &#x751F;&#x6210;&#x5373;&#x53EF;</li>
<li>&#x4F7F;&#x7528;&#x672C;&#x5730; <code>cache</code>&#xFF0C;&#x53EF; <code>reload</code> &#x9A8C;&#x8BC1;&#x7801;</li>
<li>&#x901A;&#x8FC7;hash&#x751F;&#x6210;&#x968F;&#x673A;&#x6570;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x7801; <code>ID</code></li>
</ul>
<h2 id="&#x5FEB;&#x901F;&#x4F7F;&#x7528;"><a href="#&#x5FEB;&#x901F;&#x4F7F;&#x7528;" class="headerlink" title="&#x5FEB;&#x901F;&#x4F7F;&#x7528;"></a>&#x5FEB;&#x901F;&#x4F7F;&#x7528;</h2><p>&#x8FD9;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#xFF0C;&#x4ED6;&#x5DF2;&#x7ECF;&#x5C06;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x8FDB;&#x884C;&#x4E86;&#x5C01;&#x88C5;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x6309;&#x7167;&#x4F60;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x3002;</p>
<h3 id="&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801;-ID"><a href="#&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801;-ID" class="headerlink" title="&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801; ID"></a>&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801; ID</h3><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;type Captcha struct {</span><br><span class="line">	Id      string `json:&quot;id,omitempty&quot;`      //&#x9A8C;&#x8BC1;&#x7801;ID</span><br><span class="line">	ImgUrl  string `json:&quot;img_url,omitempty&quot;` //&#x9A8C;&#x8BC1;&#x7801;&#x56FE;&#x50CF;&#x5730;&#x5740;</span><br><span class="line">	Refresh string `json:&quot;refresh,omitempty&quot;` //&#x91CD;&#x65B0;&#x83B7;&#x53D6;</span><br><span class="line">	Verify  string `json:&quot;verify,omitempty&quot;`  //&#x9A8C;&#x8BC1;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">//GenerateId</span><br><span class="line">/* @Description: &#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801;Id</span><br><span class="line"> * @receiver c</span><br><span class="line"> * @param ctx</span><br><span class="line"> */</span><br><span class="line">func (c *Captcha) GenerateId(ctx *gin.Context) {</span><br><span class="line">	//&#x83B7;&#x53D6;&#x9A8C;&#x8BC1;&#x7801;&#x9A8C;&#x8BC1;&#x6570;&#x5B57;&#x957F;&#x5EA6;</span><br><span class="line">	var length = variable.ConfigYml.GetInt(&quot;Captcha.Length&quot;)</span><br><span class="line">	//&#x81EA;&#x5B9A;&#x4E49;&#x9A8C;&#x8BC1;&#x7801;&#x6570;&#x5B57;&#x957F;&#x5EA6;</span><br><span class="line">	captchaId := captcha.NewLen(length)</span><br><span class="line">	//&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x4FE1;&#x606F;</span><br><span class="line">	c.Id = captchaId</span><br><span class="line">	c.ImgUrl = captchaId + &quot;.png&quot;</span><br><span class="line">	c.Refresh = c.ImgUrl + &quot;?reload=1&quot;</span><br><span class="line">	c.Verify = captchaId + &quot;/&#x8FD9;&#x91CC;&#x66FF;&#x6362;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&quot;</span><br><span class="line">	response.Success(ctx, &quot;&#x9A8C;&#x8BC1;&#x7801;&#x4FE1;&#x606F;&quot;, c)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p><code>ID</code> &#x53EF;&#x4EE5;&#x751F;&#x6210;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x952E;&#x7684;&#x5F62;&#x5F0F;&#x53BB;&#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x8FD9;&#x4E2A;&#x8FD8;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<h3 id="&#x83B7;&#x53D6;&#x56FE;&#x7247;"><a href="#&#x83B7;&#x53D6;&#x56FE;&#x7247;" class="headerlink" title="&#x83B7;&#x53D6;&#x56FE;&#x7247;"></a>&#x83B7;&#x53D6;&#x56FE;&#x7247;</h3><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;//GetImg</span><br><span class="line">/* @Description: &#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x56FE;&#x7247;</span><br><span class="line"> * @receiver c</span><br><span class="line"> * @param ctx</span><br><span class="line"> */</span><br><span class="line">func (c *Captcha) GetImg(ctx *gin.Context) {</span><br><span class="line">	//&#x901A;&#x8FC7;param&#x83B7;&#x53D6;&#x9A8C;&#x8BC1;&#x7801;Id</span><br><span class="line">	captchaId := ctx.Param(captchaIdKey)</span><br><span class="line">	//&#x6839;&#x636E;&#x8DEF;&#x5F84;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x659C;&#x6760;&#xFF0C; &#x5C06;&#x8DEF;&#x5F84;&#x5212;&#x5206;&#x4E3A;&#x76EE;&#x5F55;&#x90E8;&#x5206;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x90E8;&#x5206;&#x3002; &#x4F8B; http://localhost:20201/captcha/  JUpvESBqAcPxvSVz5Cy9.png</span><br><span class="line">	_, file := path.Split(ctx.Request.URL.Path)</span><br><span class="line">	//&#x83B7;&#x53D6;&#x6269;&#x5C55;&#x540D; .png</span><br><span class="line">	ext := path.Ext(file)</span><br><span class="line">	//&#x83B7;&#x53D6;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;Id</span><br><span class="line">	id := file[:len(file)-len(ext)]</span><br><span class="line">	//&#x9A8C;&#x8BC1;&#x53C2;&#x6570;&#x662F;&#x5426;&#x83B7;&#x53D6;&#x6B63;&#x5E38;</span><br><span class="line">	if ext == &quot;&quot; || captchaId == &quot;&quot; {</span><br><span class="line">		response.Fail(ctx, http.StatusBadRequest, consts.CaptchaGetParamsInvalidCode, consts.CaptchaGetParamsInvalidMsg)</span><br><span class="line">		return</span><br><span class="line">	}</span><br><span class="line">	//&#x5F53;&#x83B7;&#x53D6;&#x5230; Reload &#x5C31;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;</span><br><span class="line">	if ctx.Query(Reload) != &quot;&quot; {</span><br><span class="line">		//&#x91CD;&#x8F7D;&#x4E3A;&#x7ED9;&#x5B9A;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x751F;&#x6210;&#x5E76;&#x8BB0;&#x4F4F;&#x65B0;&#x7684;&#x6570;&#x5B57;&#x3002;</span><br><span class="line">		captcha.Reload(id)</span><br><span class="line">	}</span><br><span class="line">	//&#x8BBE;&#x7F6E;http&#x534F;&#x8BAE;</span><br><span class="line">	ctx.Header(&quot;Cache-Control&quot;, &quot;no-cache, no-store, must-revalidate&quot;)</span><br><span class="line">	ctx.Header(&quot;Expires&quot;, &quot;0&quot;)</span><br><span class="line">	var vBytes bytes.Buffer</span><br><span class="line">	if ext == &quot;.png&quot; {</span><br><span class="line">		ctx.Header(&quot;Content-Type&quot;, &quot;image/png&quot;)</span><br><span class="line">		//&#x5199;&#x5165;&#x56FE;&#x7247;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x4FE1;&#x606F;</span><br><span class="line">		_ = captcha.WriteImage(&amp;vBytes, id, Width, Height)</span><br><span class="line">		//&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x5E76;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</span><br><span class="line">		http.ServeContent(ctx.Writer, ctx.Request, id+ext, time.Time{}, bytes.NewReader(vBytes.Bytes()))</span><br><span class="line">	}</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p><code>Captcha</code> &#x4ED6;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7801; ID &#x53BB;&#x751F;&#x6210;&#x9A8C;&#x8BC1;&#x7801;&#x56FE;&#x50CF;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x4E8C;&#x8FDB;&#x5236;&#x4FE1;&#x606F;&#x653E;&#x5230; <code>http</code> &#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x663E;&#x793A;&#x5C31;&#x53EF;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x4E0D;&#x9700;&#x8981;&#x4F60;&#x5229;&#x7528;&#x989D;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x5B58;&#x50A8;&#x56FE;&#x7247;&#x3002;</p>
<h3 id="&#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;"><a href="#&#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;" class="headerlink" title="&#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;"></a>&#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;</h3><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;//CheckCode</span><br><span class="line">/* @Description: &#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;&#x4F20;&#x6765;&#x7684;&#x6570;&#x5B57;</span><br><span class="line"> * @receiver c</span><br><span class="line"> * @param ctx</span><br><span class="line"> */</span><br><span class="line">func (c *Captcha) CheckCode(ctx *gin.Context) {</span><br><span class="line">	//&#x83B7;&#x53D6;&#x9A8C;&#x8BC1;&#x7801;ID &#x4E0E;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x503C;</span><br><span class="line">	captchaId := ctx.Param(captchaIdKey)</span><br><span class="line">	value := ctx.Param(captchaValueKey)</span><br><span class="line">	//&#x53BB;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;</span><br><span class="line">	if captcha.VerifyString(captchaId, value) {</span><br><span class="line">		response.Success(ctx, consts.CaptchaCheckParamsOk)</span><br><span class="line">	} else {</span><br><span class="line">		response.Fail(ctx, http.StatusBadRequest, consts.CaptchaCheckParamsInvalidCode, consts.CaptchaCheckParamsInvalidMsg)</span><br><span class="line">	}</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x6839;&#x636E;&#x8BF7;&#x6C42;&#x8DEF;&#x5F84;&#x83B7;&#x53D6;&#x7684;&#x5B57;&#x6BB5;&#x503C;&#xFF0C;<code>Captcha</code>&#x4ED6;&#x4F1A;&#x5C06; <code>captchaId</code> &#x4E0E; <code>value</code> &#x653E;&#x5230;&#x672C;&#x5730;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x67E5;&#x5230;&#x5C31;&#x8FD4;&#x56DE; <code>true</code>&#x3002;</p>
<h3 id="&#x521B;&#x5EFA;&#x8DEF;&#x7531;"><a href="#&#x521B;&#x5EFA;&#x8DEF;&#x7531;" class="headerlink" title="&#x521B;&#x5EFA;&#x8DEF;&#x7531;"></a>&#x521B;&#x5EFA;&#x8DEF;&#x7531;</h3><p>&#x7136;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8DEF;&#x7531;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;	// &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#x8DEF;&#x7531;</span><br><span class="line">	verifyCode := router.Group(&quot;captcha&quot;)</span><br><span class="line">	{</span><br><span class="line">		// &#x9A8C;&#x8BC1;&#x7801;&#x4E1A;&#x52A1;&#xFF0C;&#x8BE5;&#x4E1A;&#x52A1;&#x65E0;&#x9700;&#x4E13;&#x95E8;&#x6821;&#x9A8C;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x63A7;&#x5236;&#x5668;</span><br><span class="line">		verifyCode.GET(&quot;/&quot;, (&amp;captcha.Captcha{}).GenerateId)                          //  &#x83B7;&#x53D6;&#x9A8C;&#x8BC1;&#x7801;ID</span><br><span class="line">		verifyCode.GET(&quot;/:captcha_id&quot;, (&amp;captcha.Captcha{}).GetImg)                   // &#x83B7;&#x53D6;&#x56FE;&#x50CF;&#x5730;&#x5740;</span><br><span class="line">		verifyCode.GET(&quot;/:captcha_id/:captcha_value&quot;, (&amp;captcha.Captcha{}).CheckCode) // &#x6821;&#x9A8C;&#x9A8C;&#x8BC1;&#x7801;</span><br><span class="line">	}</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x4E2A;&#x6574;&#x4F53;&#x6D41;&#x7A0B;&#x5176;&#x5B9E;&#x4E0D;&#x96BE;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x660E;&#x767D;&#xFF0C;&#x4ED6;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#xFF01;</p>
<h2 id="&#x6269;&#x5C55;"><a href="#&#x6269;&#x5C55;" class="headerlink" title="&#x6269;&#x5C55;"></a>&#x6269;&#x5C55;</h2><h3 id="&#x66F4;&#x6539;&#x5B58;&#x50A8;&#x5668;"><a href="#&#x66F4;&#x6539;&#x5B58;&#x50A8;&#x5668;" class="headerlink" title="&#x66F4;&#x6539;&#x5B58;&#x50A8;&#x5668;"></a>&#x66F4;&#x6539;&#x5B58;&#x50A8;&#x5668;</h3><p>&#x4ED6;&#x8BBE;&#x7F6E;&#x4E86;&#x4E24;&#x4E2A;&#x5E38;&#x91CF; <code>CollectNum</code> &#x548C; <code>Expiration</code> &#x3002;</p>
<ul>
<li><code>CollectNum</code> &#x4EE3;&#x8868;&#x521B;&#x5EFA;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6570;&#x91CF;&#x4F1A;&#x53BB;&#x89E6;&#x53D1;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#xFF08;&#x4E00;&#x6B21;&#x6E05;&#x7406;&#x8FC7;&#x671F;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6570;&#x91CF;&#xFF09;</li>
<li><code>Expiration</code> &#x4EE3;&#x8868;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;</li>
</ul>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;func init() {</span><br><span class="line">	//&#x5BF9;&#x5B58;&#x50A8;&#x5668;&#x8FDB;&#x884C;&#x81EA;&#x5B9A;&#x4E49;&#x8BBE;&#x7F6E;</span><br><span class="line">	//&#x8BBE;&#x7F6E;&#x4E00;&#x6B21;&#x6E05;&#x7406;&#x8FC7;&#x671F;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6570;&#x91CF;</span><br><span class="line">	collectNum := variable.ConfigYml.GetInt(&quot;Captcha.CollectNum&quot;)</span><br><span class="line">	//&#x8FC7;&#x671F;&#x65F6;&#x95F4;</span><br><span class="line">	expiration := variable.ConfigYml.GetDuration(&quot;Captcha.Expiration&quot;)</span><br><span class="line">	// &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6807;&#x51C6;&#x5185;&#x5B58;&#x5B58;&#x50A8;&#x5668;</span><br><span class="line">	s := captcha.NewMemoryStore(collectNum, expiration)</span><br><span class="line">	//&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B58;&#x50A8;&#x5668;</span><br><span class="line">	captcha.SetCustomStore(s)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h3 id="&#x521B;&#x5EFA;&#x97F3;&#x9891;&#x9A8C;&#x8BC1;&#x7801;"><a href="#&#x521B;&#x5EFA;&#x97F3;&#x9891;&#x9A8C;&#x8BC1;&#x7801;" class="headerlink" title="&#x521B;&#x5EFA;&#x97F3;&#x9891;&#x9A8C;&#x8BC1;&#x7801;"></a>&#x521B;&#x5EFA;&#x97F3;&#x9891;&#x9A8C;&#x8BC1;&#x7801;</h3><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;func (c *Captcha) GetAudio(ctx *gin.Context) {</span><br><span class="line">	//&#x901A;&#x8FC7;param&#x83B7;&#x53D6;&#x9A8C;&#x8BC1;&#x7801;Id</span><br><span class="line">	captchaId := ctx.Param(captchaIdKey)</span><br><span class="line">	//&#x6839;&#x636E;&#x8DEF;&#x5F84;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x659C;&#x6760;&#xFF0C; &#x5C06;&#x8DEF;&#x5F84;&#x5212;&#x5206;&#x4E3A;&#x76EE;&#x5F55;&#x90E8;&#x5206;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x90E8;&#x5206;&#x3002; &#x4F8B; http://localhost:20201/captcha/  JUpvESBqAcPxvSVz5Cy9.wav</span><br><span class="line">	_, file := path.Split(ctx.Request.URL.Path)</span><br><span class="line">	//&#x83B7;&#x53D6;&#x6269;&#x5C55;&#x540D; .wav</span><br><span class="line">	ext := path.Ext(file)</span><br><span class="line">	//&#x83B7;&#x53D6;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;Id</span><br><span class="line">	id := file[:len(file)-len(ext)]</span><br><span class="line">	//&#x9A8C;&#x8BC1;&#x53C2;&#x6570;&#x662F;&#x5426;&#x83B7;&#x53D6;&#x6B63;&#x5E38;</span><br><span class="line">	if ext == &quot;&quot; || captchaId == &quot;&quot; {</span><br><span class="line">		response.Fail(ctx, http.StatusBadRequest, consts.CaptchaGetParamsInvalidCode, consts.CaptchaGetParamsInvalidMsg)</span><br><span class="line">		return</span><br><span class="line">	}</span><br><span class="line">	ctx.Header(&quot;Cache-Control&quot;, &quot;no-cache, no-store, must-revalidate&quot;)</span><br><span class="line">	ctx.Header(&quot;Pragma&quot;, &quot;no-cache&quot;)</span><br><span class="line">	ctx.Header(&quot;Expires&quot;, &quot;0&quot;)</span><br><span class="line">	//&#x5F53;&#x83B7;&#x53D6;&#x5230; Reload &#x5C31;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;</span><br><span class="line">	if ctx.Query(Reload) != &quot;&quot; {</span><br><span class="line">		//&#x91CD;&#x8F7D;&#x4E3A;&#x7ED9;&#x5B9A;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x751F;&#x6210;&#x5E76;&#x8BB0;&#x4F4F;&#x65B0;&#x7684;&#x6570;&#x5B57;&#x3002;</span><br><span class="line">		captcha.Reload(id)</span><br><span class="line">	}</span><br><span class="line">	var vBytes bytes.Buffer</span><br><span class="line">	if ext == &quot;.wav&quot; {</span><br><span class="line">		ctx.Header(&quot;Content-Type&quot;, &quot;audio/wav&quot;)</span><br><span class="line">		//&#x5199;&#x5165;audio&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x4FE1;&#x606F;</span><br><span class="line">		_ = captcha.WriteAudio(&amp;vBytes, id, Lang)</span><br><span class="line">		//&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x5E76;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</span><br><span class="line">		http.ServeContent(ctx.Writer, ctx.Request, id+ext, time.Time{}, bytes.NewReader(vBytes.Bytes()))</span><br><span class="line">	}</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h2 id="&#x53C2;&#x8003;&#x6587;&#x7AE0;"><a href="#&#x53C2;&#x8003;&#x6587;&#x7AE0;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x7AE0;"></a>&#x53C2;&#x8003;&#x6587;&#x7AE0;</h2><blockquote>
<p><a href="/external_links/fcd08eb1e685cd5b751907fa5ef9f296.html" target="blank" rel="noopener">captcha&#x9A8C;&#x8BC1;&#x7801;&#x603B;&#x7ED3;</a></p>
<p><a href="/external_links/b77bc1533d805a344248347d10d2f7d1.html" target="blank" rel="noopener">Golang Http &#x9A8C;&#x8BC1;&#x7801;&#x793A;&#x4F8B;</a></p>
</blockquote>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/f2554b5ef069acd19e32c28ae51e8731.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034735574917316615.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034735574917316615.html" itemprop="url">qsort库函数排序 qsort库函数排序</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:48:52+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x300C;&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;26&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a>&#x300D;</p>
<h1 id="qsort&#x5E93;&#x51FD;&#x6570;&#x6392;&#x5E8F;"><a href="#qsort&#x5E93;&#x51FD;&#x6570;&#x6392;&#x5E8F;" class="headerlink" title="qsort&#x5E93;&#x51FD;&#x6570;&#x6392;&#x5E8F;"></a>qsort&#x5E93;&#x51FD;&#x6570;&#x6392;&#x5E8F;</h1><h2 id="quick-sort&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x539F;&#x51FD;&#x6570;&#x89E3;&#x91CA;"><a href="#quick-sort&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x539F;&#x51FD;&#x6570;&#x89E3;&#x91CA;" class="headerlink" title="quick sort&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x539F;&#x51FD;&#x6570;&#x89E3;&#x91CA;"></a>quick sort&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x539F;&#x51FD;&#x6570;&#x89E3;&#x91CA;</h2><p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/76e1a38ac77237813d7819bc93ab0f3ffab94641bfd5d85d9c3e505e421a4044" alt>image-20210818230558340  </p>
<h2 id="&#x7528;qsort"><a href="#&#x7528;qsort" class="headerlink" title="&#x7528;qsort"></a>&#x7528;qsort</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br></pre></td><td class="code"><pre><span class="line">c&#x590D;&#x5236;&#x4EE3;&#x7801;#include&lt;stdio.h&gt;</span><br><span class="line">#include&lt;stdlib.h&gt;</span><br><span class="line"></span><br><span class="line">struct Stu</span><br><span class="line">{</span><br><span class="line">	char name[20];</span><br><span class="line">	int age;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line">int cmp_int(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return *(int*)e1 - *(int*)e2;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">int cmp_float(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return (int)(*(float*)e1 - *(float*)e2);</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">//&#x7ED3;&#x6784;&#x4F53;&#x6392;&#x5E8F;&#x6709;&#x4E0D;&#x540C;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x4EBA;&#x662F;&#x540D;&#x5B57;&#xFF0C;&#x6709;&#x4EBA;&#x662F;&#x59D3;&#x540D;</span><br><span class="line">int cmp_stu_age(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return ((struct Stu*)e1)-&gt;age - ((struct Stu*)e2)-&gt;age;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">int cmp_stu_name(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	//&#x540D;&#x5B57;&#x6BD4;&#x8F83;&#x5C31;&#x662F;&#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;</span><br><span class="line">	//&#x5B57;&#x7B26;&#x4E32;&#x6BD4;&#x8F83;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x7528;&lt;&gt;=&#x6765;&#x6BD4;&#x8F83;&#xFF0C;&#x5E94;&#x8BE5;&#x7528;strcmp&#x6765;&#x6BD4;&#x8F83;</span><br><span class="line"></span><br><span class="line">	return strcmp(((struct Stu*)e1)-&gt;name , ((struct Stu*)e2)-&gt;name);</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">void test_int()</span><br><span class="line">{</span><br><span class="line">	int arr[10] = { 0,5,6,3,5,9,6,5,3,9 };</span><br><span class="line">	int sz = sizeof(arr) / sizeof(arr[0]);</span><br><span class="line">	qsort(arr, sz, sizeof(arr[0]), cmp_int);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%2d &quot;, arr[i]);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">void test_float()</span><br><span class="line">{</span><br><span class="line">	float arr[10] = { 0.0,5.0,6.0,3.0,5.1,9.0,6.3,5.6,3.3,9.5 };</span><br><span class="line">	int sz = sizeof(arr) / sizeof(arr[0]);</span><br><span class="line">	qsort(arr, sz, sizeof(arr[0]), cmp_float);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%f &quot;, arr[i]);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">void test_stu_age()</span><br><span class="line">{</span><br><span class="line">	struct Stu s[3] = { {&quot;zhuangsan&quot;,20},{&quot;lisi&quot;,21},{&quot;wangwu&quot;,10} };</span><br><span class="line">	int sz = sizeof(s) / sizeof(s[0]);</span><br><span class="line">	qsort(s, sz, sizeof(s[0]), cmp_stu_age);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%s  &quot;, (&amp;s[i])-&gt;name);</span><br><span class="line">		printf(&quot;%d  &quot;, (&amp;s[i])-&gt;age);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">void test_stu_name()</span><br><span class="line">{</span><br><span class="line">	struct Stu s[3] = { {&quot;zhuangsan&quot;,20},{&quot;lisi&quot;,21},{&quot;wangwu&quot;,10} };</span><br><span class="line">	int sz = sizeof(s) / sizeof(s[0]);</span><br><span class="line">	qsort(s, sz, sizeof(s[0]), cmp_stu_name);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%s  &quot;, (&amp;s[i])-&gt;name);</span><br><span class="line">		printf(&quot;%d  &quot;, (&amp;s[i])-&gt;age);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">int main()</span><br><span class="line">{</span><br><span class="line">	test_int();</span><br><span class="line">	test_float();</span><br><span class="line">	test_stu_age();</span><br><span class="line">	test_stu_name();</span><br><span class="line">	return 0;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/eb5af918937c6f9984e5ae09a5389c1750a3567546297b0e3f89ef8eeb7b474f" alt>image-20210818225357880  </p>
<h2 id="&#x4E00;&#x822C;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x60F3;&#x81EA;&#x5DF1;&#x5199;&#x4E2A;qsort&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4EFF;&#x5199;&#x4E00;&#x4E2A;&#x4E3A;BubbleSort"><a href="#&#x4E00;&#x822C;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x60F3;&#x81EA;&#x5DF1;&#x5199;&#x4E2A;qsort&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4EFF;&#x5199;&#x4E00;&#x4E2A;&#x4E3A;BubbleSort" class="headerlink" title="&#x4E00;&#x822C;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x60F3;&#x81EA;&#x5DF1;&#x5199;&#x4E2A;qsort&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4EFF;&#x5199;&#x4E00;&#x4E2A;&#x4E3A;BubbleSort"></a>&#x4E00;&#x822C;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x60F3;&#x81EA;&#x5DF1;&#x5199;&#x4E2A;qsort&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4EFF;&#x5199;&#x4E00;&#x4E2A;&#x4E3A;BubbleSort</h2><p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/84688e090991ac584275b38ebb4239ace3cbf2b6fdda41a827ae66991b1bdcac" alt>image-20210831222802853  </p>
<h2 id="&#x6F02;&#x4EAE;&#x4E4B;&#x5904;void&#x4E07;&#x80FD;&#x7C7B;&#x578B;&#x548C;char-&#xFF0C;&#x5B57;&#x5BBD;width&#x7684;&#x8054;&#x5408;&#x51FA;&#x51FB;"><a href="#&#x6F02;&#x4EAE;&#x4E4B;&#x5904;void&#x4E07;&#x80FD;&#x7C7B;&#x578B;&#x548C;char-&#xFF0C;&#x5B57;&#x5BBD;width&#x7684;&#x8054;&#x5408;&#x51FA;&#x51FB;" class="headerlink" title="&#x6F02;&#x4EAE;&#x4E4B;&#x5904;void&#x4E07;&#x80FD;&#x7C7B;&#x578B;&#x548C;char*&#xFF0C;&#x5B57;&#x5BBD;width&#x7684;&#x8054;&#x5408;&#x51FA;&#x51FB;"></a>&#x6F02;&#x4EAE;&#x4E4B;&#x5904;void&#x4E07;&#x80FD;&#x7C7B;&#x578B;&#x548C;char*&#xFF0C;&#x5B57;&#x5BBD;width&#x7684;&#x8054;&#x5408;&#x51FA;&#x51FB;</h2><p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/77a2071babbb991b2949a607570ebb6f7a64d307206f45b1f80ca7d9b626abf0" alt>image-20210831222830598  </p>
<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/7e137579f893fa12e630e219c5e221ca41ad0edb16e12af8b3d56fb0e4637c6a" alt>image-20210831223052692  </p>
<h2 id="&#x7528;BubbleSort"><a href="#&#x7528;BubbleSort" class="headerlink" title="&#x7528;BubbleSort"></a>&#x7528;BubbleSort</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br></pre></td><td class="code"><pre><span class="line">C&#x590D;&#x5236;&#x4EE3;&#x7801;#include&lt;stdio.h&gt;</span><br><span class="line">struct Stu</span><br><span class="line">{</span><br><span class="line">	char name[20];</span><br><span class="line">	int age;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line">//&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x4E07;&#x80FD;&#x4EA4;&#x6362;&#x51FD;&#x6570;</span><br><span class="line">void Swap(char* buf1, char* buf2,int width)</span><br><span class="line">{</span><br><span class="line">	size_t i = 0;</span><br><span class="line">	for (i = 0; i &lt; width; i++)</span><br><span class="line">	{</span><br><span class="line">		char tmp = *buf1;</span><br><span class="line">		*buf1 = *buf2;</span><br><span class="line">		*buf2 = tmp;</span><br><span class="line">		buf1++;</span><br><span class="line">		buf2++;</span><br><span class="line">	}</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">//&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x5192;&#x6CE1;&#x51FD;&#x6570;,&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x51FD;&#x6570;</span><br><span class="line">voidBubbleSort(void* base, int num, size_t width, int (*cmp)(const void* e1, const void* e2))</span><br><span class="line">{</span><br><span class="line">	int i = 0;</span><br><span class="line">	//&#x8D9F;&#x6570;</span><br><span class="line">	for (i = 0; i &lt; num - 1; i++)</span><br><span class="line">	{</span><br><span class="line">		//&#x6BD4;&#x8F83;&#x7684;&#x5BF9;&#x6570;</span><br><span class="line">		int j = 0;</span><br><span class="line">		for (j = 0; j &lt; num - 1 - i; j++)</span><br><span class="line">		{</span><br><span class="line">			if (cmp((char*)base+j*width,(char*)base+(j+1)*width) &gt; 0)</span><br><span class="line">			{</span><br><span class="line">				//&#x4EA4;&#x6362;</span><br><span class="line">				Swap((char*)base + j * width, (char*)base + (j + 1) * width,width);</span><br><span class="line">			}</span><br><span class="line">		}</span><br><span class="line">	}</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">int cmp_int(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return *(int*)e1 - *(int*)e2;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">int cmp_float(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return (int)(*(float*)e1 - *(float*)e2);</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">int cmp_stu_age(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	return ((struct Stu*)e1)-&gt;age - ((struct Stu*)e2)-&gt;age;</span><br><span class="line">}</span><br><span class="line">int cmp_stu_name(const void* e1, const void* e2)</span><br><span class="line">{</span><br><span class="line">	//&#x540D;&#x5B57;&#x6BD4;&#x8F83;&#x5C31;&#x662F;&#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;</span><br><span class="line">	//&#x5B57;&#x7B26;&#x4E32;&#x6BD4;&#x8F83;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x7528;&lt;&gt;=&#x6765;&#x6BD4;&#x8F83;&#xFF0C;&#x5E94;&#x8BE5;&#x7528;strcmp&#x6765;&#x6BD4;&#x8F83;</span><br><span class="line"></span><br><span class="line">	return strcmp(((struct Stu*)e1)-&gt;name, ((struct Stu*)e2)-&gt;name);</span><br><span class="line">}</span><br><span class="line">void test_int()</span><br><span class="line">{</span><br><span class="line">	int arr[10] = { 0,5,6,3,5,9,6,5,3,9 };</span><br><span class="line">	int sz = sizeof(arr) / sizeof(arr[0]);</span><br><span class="line">	BubbleSort(arr, sz, sizeof(arr[0]), cmp_int);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%2d &quot;, arr[i]);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">void test_float()</span><br><span class="line">{</span><br><span class="line">	float arr[10] = { 0.0,5.0,6.0,3.0,5.1,9.0,6.3,5.6,3.3,9.5 };</span><br><span class="line">	int sz = sizeof(arr) / sizeof(arr[0]);</span><br><span class="line">	BubbleSort(arr, sz, sizeof(arr[0]), cmp_float);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%f &quot;, arr[i]);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">void test_stu_age()</span><br><span class="line">{</span><br><span class="line">	struct Stu s[3] = { {&quot;zhuangsan&quot;,20},{&quot;lisi&quot;,21},{&quot;wangwu&quot;,10} };</span><br><span class="line">	int sz = sizeof(s) / sizeof(s[0]);</span><br><span class="line">	BubbleSort(s, sz, sizeof(s[0]), cmp_stu_age);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%s  &quot;, (&amp;s[i])-&gt;name);</span><br><span class="line">		printf(&quot;%d  &quot;, (&amp;s[i])-&gt;age);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">void test_stu_name()</span><br><span class="line">{</span><br><span class="line">	struct Stu s[3] = { {&quot;zhuangsan&quot;,20},{&quot;lisi&quot;,21},{&quot;wangwu&quot;,10} };</span><br><span class="line">	int sz = sizeof(s) / sizeof(s[0]);</span><br><span class="line">	BubbleSort(s, sz, sizeof(s[0]), cmp_stu_name);</span><br><span class="line">	int i = 0;</span><br><span class="line">	for (i = 0; i &lt; sz; i++)</span><br><span class="line">	{</span><br><span class="line">		printf(&quot;%s  &quot;, (&amp;s[i])-&gt;name);</span><br><span class="line">		printf(&quot;%d  &quot;, (&amp;s[i])-&gt;age);</span><br><span class="line">	}</span><br><span class="line">	printf(&quot;\n&quot;);</span><br><span class="line">}</span><br><span class="line">int main()</span><br><span class="line">{</span><br><span class="line">	test_int();</span><br><span class="line">	test_float();</span><br><span class="line">	test_stu_age();</span><br><span class="line">	test_stu_name();</span><br><span class="line">	return 0;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/d5054ece33f13d04d2ac39cf170a6d8e3e331588383134a8bd5e89141b67dcb4" alt>image-20210831223655636  </p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/1eeac1022a10f9028abb75e92fd6751d.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034733128279293983.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034733128279293983.html" itemprop="url">Rust - 元组结构体和单元结构体 元组结构体 单元结构体</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:41:06+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;26&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095/">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a></p>
<h1 id="&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;"><a href="#&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;" class="headerlink" title="&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;"></a>&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;</h1><p>&#x9664;&#x4E86;&#x5B9A;&#x4E49;&#x5E38;&#x89C4;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x4E4B;&#x5916;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E0E;&#x5143;&#x7EC4;&#x7C7B;&#x4F3C;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x79F0;&#x4E3A; <strong>&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;</strong>&#xFF08;<em>tuple structs</em>&#xFF09;&#xFF0C;&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x4E3B;&#x8981;&#x7279;&#x5F81;&#x662F;&#x6CA1;&#x6709;&#x5B57;&#x6BB5;&#x540D;&#xFF0C;&#x53EA;&#x6709;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x7ED9;&#x6574;&#x4E2A;&#x5143;&#x7EC4;&#x53D6;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x5E76;&#x4F7F;&#x5143;&#x7EC4;&#x6210;&#x4E3A;&#x4E0E;&#x5176;&#x4ED6;&#x5143;&#x7EC4;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x50CF;&#x5E38;&#x89C4;&#x7ED3;&#x6784;&#x4F53;&#x90A3;&#x6837;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x547D;&#x540D;&#x5C31;&#x663E;&#x5F97;&#x591A;&#x4F59;&#x548C;&#x5F62;&#x5F0F;&#x5316;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x4E49;&#x989C;&#x8272;&#x7684;RGB&#x548C;&#x5750;&#x6807;&#x3002;&#x8981;&#x5B9A;&#x4E49;&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x4EE5; <code>struct</code> &#x5173;&#x952E;&#x5B57;&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x540D;&#x5F00;&#x5934;&#x5E76;&#x540E;&#x8DDF;&#x5143;&#x7EC4;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E24;&#x4E2A;&#x5206;&#x522B;&#x53EB;&#x505A; <code>Color</code> &#x548C; <code>Point</code> &#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x7528;&#x6CD5;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;struct Color(i32, i32, i32);</span><br><span class="line">struct Point(i32, i32, i32);</span><br><span class="line"></span><br><span class="line">let black = Color(0, 0, 0);</span><br><span class="line">let origin = Point(0, 0, 0);</span><br></pre></td></tr></table></figure>

<p>&#x9700;&#x8981;&#x6CE8;&#x610F; <code>black</code> &#x548C; <code>origin</code> &#x503C;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x4F60;&#x5B9A;&#x4E49;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x6709;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x4F7F;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x83B7;&#x53D6; <code>Color</code> &#x7C7B;&#x578B;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#x4E0D;&#x80FD;&#x63A5;&#x53D7; <code>Point</code> &#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x4FBF;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#x90FD;&#x7531;&#x4E09;&#x4E2A; <code>i32</code> &#x503C;&#x7EC4;&#x6210;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x5143;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x5B9E;&#x4F8B;&#x7C7B;&#x4F3C;&#x4E8E;&#x5143;&#x7EC4;&#xFF1A;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x89E3;&#x6784;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>.</code> &#x540E;&#x8DDF;&#x7D22;&#x5F15;&#x6765;&#x8BBF;&#x95EE;&#x5355;&#x72EC;&#x7684;&#x503C;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<h1 id="&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;"><a href="#&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;" class="headerlink" title="&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;"></a>&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;</h1><p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF01;&#x5B83;&#x4EEC;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x7C7B;&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;</strong>&#xFF08;<em>unit-like structs</em>&#xFF09;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7C7B;&#x4F3C;&#x4E8E; <code>()</code>&#xFF0C;&#x5373; unit &#x7C7B;&#x578B;&#x3002;&#x7C7B;&#x5355;&#x5143;&#x7ED3;&#x6784;&#x4F53;&#x5E38;&#x5E38;&#x5728;&#x4F60;&#x60F3;&#x8981;&#x5728;&#x67D0;&#x4E2A;&#x7C7B;&#x578B;&#x4E0A;&#x5B9E;&#x73B0; trait &#x4F46;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x7C7B;&#x578B;&#x4E2D;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x3002;<code>trait</code>&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<h1 id="&#x7ED3;&#x6784;&#x4F53;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;"><a href="#&#x7ED3;&#x6784;&#x4F53;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;" class="headerlink" title="&#x7ED3;&#x6784;&#x4F53;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;"></a>&#x7ED3;&#x6784;&#x4F53;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;</h1><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;struct UserInfo {</span><br><span class="line">    name: String,</span><br><span class="line">    age: i32,</span><br><span class="line">    sex: bool,  // true&#x8868;&#x793A;&#x7537;  false&#x8868;&#x793A;&#x5973;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x5728;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x81EA;&#x8EAB;&#x62E5;&#x6709;&#x6240;&#x6709;&#x6743;&#x7684; <code>String</code> &#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F; <code>&amp;str</code> &#x5B57;&#x7B26;&#x4E32; slice &#x7C7B;&#x578B;&#x3002;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x60F3;&#x8981;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x62E5;&#x6709;&#x5B83;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E3A;&#x6B64;&#x53EA;&#x8981;&#x6574;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x662F;&#x6709;&#x6548;&#x7684;&#x8BDD;&#x5176;&#x6570;&#x636E;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x4F1A;&#x63D0;&#x5230;&#x4E00;&#x4E2A; <strong>&#x751F;&#x547D;&#x5468;&#x671F;</strong>&#xFF08;<em>lifetimes</em>&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x540E;&#x7EED;&#x6587;&#x7AE0;&#x4E5F;&#x4F1A;&#x4ECB;&#x7ECD;&#x54E6;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x786E;&#x4FDD;&#x7ED3;&#x6784;&#x4F53;&#x5F15;&#x7528;&#x7684;&#x6570;&#x636E;&#x6709;&#x6548;&#x6027;&#x8DDF;&#x7ED3;&#x6784;&#x4F53;&#x672C;&#x8EAB;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x5982;&#x679C;&#x5C1D;&#x8BD5;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x800C;&#x4E0D;&#x6307;&#x5B9A;&#x751F;&#x547D;&#x5468;&#x671F;&#x5C06;&#x4F1A;&#x5F15;&#x53D1;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x5931;&#x8D25;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;struct User {</span><br><span class="line">    username: &amp;str,</span><br><span class="line">    email: &amp;str,</span><br><span class="line">    sign_in_count: u64,</span><br><span class="line">    active: bool,</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">fn main() {</span><br><span class="line">    let user1 = User {</span><br><span class="line">        email: &quot;someone@example.com&quot;,</span><br><span class="line">        username: &quot;someusername123&quot;,</span><br><span class="line">        active: true,</span><br><span class="line">        sign_in_count: 1,</span><br><span class="line">    };</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x62A5;&#x9519;&#x4FE1;&#x606F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">lua&#x590D;&#x5236;&#x4EE3;&#x7801;error[E0106]: missing lifetime specifier</span><br><span class="line"> --&gt;</span><br><span class="line">  |</span><br><span class="line">2 |     username: &amp;str,</span><br><span class="line">  |               ^ expected lifetime parameter</span><br><span class="line"></span><br><span class="line">error[E0106]: missing lifetime specifier</span><br><span class="line"> --&gt;</span><br><span class="line">  |</span><br><span class="line">3 |     email: &amp;str,</span><br><span class="line">  |            ^ expected lifetime parameter</span><br></pre></td></tr></table></figure>

<p>&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4FEE;&#x590D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4EE5;&#x4FBF;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x5B58;&#x50A8;&#x5F15;&#x7528;&#x3002;</p>
<h1 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h1><blockquote>
<p>&#x6587;&#x7AE0;&#x9996;&#x53D1;&#x4E8E;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;<strong>&#x7A0B;&#x5E8F;&#x5A9B;&#x5C0F;&#x5E84;</strong>&#xFF0C;&#x540C;&#x6B65;&#x4E8E;<a href="/external_links/f7671c2bae94c1c55b771f079a8a64a0.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a>&#x3002;</p>
<p>&#x7801;&#x5B57;&#x4E0D;&#x6613;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8BF4;&#x660E;&#x51FA;&#x5904;&#xFF0C;&#x8D70;&#x8FC7;&#x8DEF;&#x8FC7;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x4F38;&#x51FA;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x6307;&#x5934;&#x70B9;&#x4E2A;&#x8D5E;&#x518D;&#x8D70;&#x5427;(<em>&#x2579;&#x25BD;&#x2579;</em>)</p>
</blockquote>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/92516f043485683442fee64e9f36dd2d.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034732723889504269.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034732723889504269.html" itemprop="url">Rust - 初识结构体 定义并实例化结构体 基于已有实例创</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:40:11+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;26&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095/">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a></p>
<p><em>struct<em>&#xFF0C;&#x6216;&#x8005; *structure</em>&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5141;&#x8BB8;&#x547D;&#x540D;&#x548C;&#x5305;&#x88C5;&#x591A;&#x4E2A;&#x76F8;&#x5173;&#x7684;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#xFF0C;*struct</em> &#x5C31;&#x50CF;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5C5E;&#x6027;&#x3002;</p>
<h1 id="&#x5B9A;&#x4E49;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#x7ED3;&#x6784;&#x4F53;"><a href="#&#x5B9A;&#x4E49;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#x7ED3;&#x6784;&#x4F53;" class="headerlink" title="&#x5B9A;&#x4E49;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#x7ED3;&#x6784;&#x4F53;"></a>&#x5B9A;&#x4E49;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#x7ED3;&#x6784;&#x4F53;</h1><p>&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x4E4B;&#x524D;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#x5143;&#x7EC4;&#x7C7B;&#x4F3C;&#xFF0C;&#x548C;&#x5143;&#x7EC4;&#x4E00;&#x6837;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x4E0D;&#x540C;&#x4E8E;&#x5143;&#x7EC4;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x9700;&#x8981;&#x547D;&#x540D;&#x5404;&#x90E8;&#x5206;&#x6570;&#x636E;&#x4EE5;&#x4FBF;&#x80FD;&#x6E05;&#x695A;&#x7684;&#x8868;&#x660E;&#x5176;&#x503C;&#x7684;&#x610F;&#x4E49;&#x3002;&#x7531;&#x4E8E;&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x540D;&#x5B57;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x6BD4;&#x5143;&#x7EC4;&#x66F4;&#x7075;&#x6D3B;&#xFF1A;&#x4E0D;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x987A;&#x5E8F;&#x6765;&#x6307;&#x5B9A;&#x6216;&#x8BBF;&#x95EE;&#x5B9E;&#x4F8B;&#x4E2D;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5B9A;&#x4E49;&#x7ED3;&#x6784;&#x4F53;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>struct</code>&#x5173;&#x952E;&#x5B57;&#x5E76;&#x7ED9;&#x7ED3;&#x6784;&#x4F53;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x53D8;&#x91CF;&#x540D;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x540D;&#x5B57;&#x9700;&#x8981;&#x63CF;&#x8FF0;&#x5B83;&#x6240;&#x7EC4;&#x5408;&#x7684;&#x6570;&#x636E;&#x7684;&#x610F;&#x4E49;&#x3002;&#x7136;&#x540E;&#x5728;&#x5927;&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x5B9A;&#x4E49;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x7684;&#x540D;&#x5B57;&#x548C;&#x7C7B;&#x578B;&#xFF0C;&#x540D;&#x5B57;&#x548C;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7528;<code>:</code>&#x5206;&#x9694;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E3A; <strong>&#x5B57;&#x6BB5;</strong>&#xFF08;<em>field</em>&#xFF09;&#xFF0C;&#x4E0D;&#x540C;&#x5B57;&#x6BB5;&#x4E4B;&#x95F4;&#x7528;<code>,</code>&#x9694;&#x5F00;&#x3002;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;// &#x5B9A;&#x4E49;&#x7ED3;&#x6784;&#x4F53;</span><br><span class="line">struct UserInfo {</span><br><span class="line">    name: String,</span><br><span class="line">    age: i32,</span><br><span class="line">    sex: bool,  // true&#x8868;&#x793A;&#x7537;  false&#x8868;&#x793A;&#x5973;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x4E00;&#x65E6;&#x5B9A;&#x4E49;&#x4E86;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x6307;&#x5B9A;&#x5177;&#x4F53;&#x503C;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684; <strong>&#x5B9E;&#x4F8B;</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B9E;&#x4F8B;&#x5316;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x9700;&#x8981;&#x4EE5;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x540D;&#x5B57;&#x5F00;&#x5934;&#xFF0C;&#x63A5;&#x7740;&#x5728;&#x5927;&#x62EC;&#x53F7;&#x4E2D;&#x4F7F;&#x7528; <code>key: value</code> &#x952E;-&#x503C;&#x5BF9;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x4F9B;&#x5B57;&#x6BB5;&#xFF0C;&#x5176;&#x4E2D; key &#x662F;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x5B57;&#xFF0C;value &#x662F;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x5728;&#x5B57;&#x6BB5;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x503C;&#x3002;&#x5B9E;&#x4F8B;&#x4E2D;&#x5B57;&#x6BB5;&#x7684;&#x987A;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x548C;&#x5B83;&#x4EEC;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B9A;&#x4E49;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x901A;&#x7528;&#x6A21;&#x677F;&#xFF0C;&#x800C;&#x5B9E;&#x4F8B;&#x5219;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x677F;&#x4E2D;&#x653E;&#x5165;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;// &#x7ED3;&#x6784;&#x4F53;&#x5B9E;&#x4F8B;&#x5316;</span><br><span class="line"></span><br><span class="line">let userinfo = UserInfo {</span><br><span class="line">    name: String::from(&quot;rust&quot;),</span><br><span class="line">    age: 18,</span><br><span class="line">    sex: true,</span><br><span class="line">};</span><br></pre></td></tr></table></figure>

<p>&#x5982;&#x679C;&#x8981;&#x4ECE;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x83B7;&#x53D6;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x70B9;&#x53F7;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x8981;&#x7528;&#x6237;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>userinfo.name</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x8BED;&#x6CD5;&#x548C;python&#x4E2D;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5C31;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B9E;&#x4F8B;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x60F3;&#x8981;&#x4FEE;&#x6539;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x70B9;&#x53F7;&#x7ED9;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x6BB5;&#x91CD;&#x65B0;&#x8D4B;&#x503C;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;let userinfo = UserInfo {</span><br><span class="line">    name: String::from(&quot;rust&quot;),</span><br><span class="line">    age: 18,</span><br><span class="line">    sex: true,</span><br><span class="line">};</span><br><span class="line">// &#x4FEE;&#x6539;&#x5B9E;&#x4F8B;&#x7684;&#x503C;</span><br><span class="line">userinfo.age = 10;</span><br></pre></td></tr></table></figure>

<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x6574;&#x4E2A;&#x5B9E;&#x4F8B;&#x5FC5;&#x987B;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF1B;Rust &#x5E76;&#x4E0D;&#x5141;&#x8BB8;&#x53EA;&#x5C06;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x53D8;&#x3002;&#x53E6;&#x5916;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x540C;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x8868;&#x8FBE;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x6765;&#x9690;&#x5F0F;&#x5730;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;fn main() {</span><br><span class="line">    let name = String::from(&quot;rust&quot;);</span><br><span class="line">    let age = 20;</span><br><span class="line">    let userinfo = build_userinfo(name, age);</span><br><span class="line">    println!(&quot;user info name is {}&quot;, userinfo.name)</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">struct UserInfo {</span><br><span class="line">    name: String,</span><br><span class="line">    age: i32,</span><br><span class="line">    sex: bool,  // true&#x8868;&#x793A;&#x7537;  false&#x8868;&#x793A;&#x5973;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">fn build_userinfo(name: String, age: i32) -&gt;UserInfo {</span><br><span class="line">    UserInfo {</span><br><span class="line">        name: name,</span><br><span class="line">        age: age,</span><br><span class="line">        sex: true,</span><br><span class="line">    }  // &#x6CE8;&#x610F;&#x4E0D;&#x80FD;&#x52A0;&#x5206;&#x53F7;&#x54E6;&#xFF0C;&#x52A0;&#x4E0A;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x8BED;&#x53E5;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x7A7A;&#x5143;&#x7EC4;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x4E3A;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x8D77;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;&#x5B57;&#x6BB5;&#x76F8;&#x540C;&#x7684;&#x540D;&#x5B57;&#x662F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x91CD;&#x590D; <code>email</code> &#x548C; <code>username</code> &#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x4E0E;&#x53D8;&#x91CF;&#x663E;&#x5F97;&#x6709;&#x4E9B;&#x5570;&#x55E6;&#x3002;&#x5982;&#x679C;&#x7ED3;&#x6784;&#x4F53;&#x6709;&#x66F4;&#x591A;&#x5B57;&#x6BB5;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x8981;&#x54ED;&#x4E86;~~&#x56E0;&#x6B64;Rust&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x7684;&#x7B80;&#x5199;&#x8BED;&#x6CD5;&#x3002;&#x5C31;&#x662F;&#x5F53;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5199;&#x5B57;&#x6BB5;&#x540D;&#x5373;&#x53EF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>&#x5B57;&#x6BB5;&#x540D;: &#x51FD;&#x6570;&#x53C2;&#x6570;&#x540D;</code>&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;fn build_userinfo(name: String, age: i32) -&gt;UserInfo {</span><br><span class="line">    UserInfo {</span><br><span class="line">        name,</span><br><span class="line">        age,</span><br><span class="line">        sex: true,</span><br><span class="line">    }  // &#x6CE8;&#x610F;&#x4E0D;&#x80FD;&#x52A0;&#x5206;&#x53F7;&#x54E6;&#xFF0C;&#x52A0;&#x4E0A;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x8BED;&#x53E5;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x7A7A;&#x5143;&#x7EC4;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h1 id="&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x5B9E;&#x4F8B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;"><a href="#&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x5B9E;&#x4F8B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;" class="headerlink" title="&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x5B9E;&#x4F8B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;"></a>&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x5B9E;&#x4F8B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;</h1><p>&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x5B9E;&#x4F8B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<strong>&#x7ED3;&#x6784;&#x4F53;&#x66F4;&#x65B0;&#x8BED;&#x6CD5;</strong>&#xFF08;<em>struct update syntax</em>&#xFF09;&#x5B9E;&#x73B0;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x6BB5;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x66F4;&#x65B0;&#x8BED;&#x6CD5;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x5728; <code>userinfo1</code> &#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0; <code>UserInfo</code> &#x5B9E;&#x4F8B;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;let userinfo1  = UserInfo {</span><br><span class="line">    name: String::from(&quot;rust&quot;),</span><br><span class="line">    age: user info.age,</span><br><span class="line">    sex: userinfo.sex,</span><br><span class="line">};</span><br></pre></td></tr></table></figure>

<p>&#x4E0B;&#x9762;&#x662F;&#x4F7F;&#x7528;&#x7ED3;&#x6784;&#x4F53;&#x66F4;&#x65B0;&#x8BED;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF0C;<code>..</code>&#x8BED;&#x6CD5;&#x6307;&#x5B9A;&#x4E86;&#x5269;&#x4F59;&#x672A;&#x663E;&#x5F0F;&#x8BBE;&#x7F6E;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#x5E94;&#x6709;&#x4E0E;&#x7ED9;&#x5B9A;&#x5B9E;&#x4F8B;&#x5BF9;&#x5E94;&#x5B57;&#x6BB5;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">rust&#x590D;&#x5236;&#x4EE3;&#x7801;let userinfo1  = UserInfo {</span><br><span class="line">    name: String::from(&quot;rust&quot;),</span><br><span class="line">    ..userinfo</span><br><span class="line">};</span><br></pre></td></tr></table></figure>

<h1 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h1><blockquote>
<p>&#x6587;&#x7AE0;&#x9996;&#x53D1;&#x4E8E;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;<strong>&#x7A0B;&#x5E8F;&#x5A9B;&#x5C0F;&#x5E84;</strong>&#xFF0C;&#x540C;&#x6B65;&#x4E8E;<a href="/external_links/f7671c2bae94c1c55b771f079a8a64a0.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a>&#x3002;</p>
<p>&#x7801;&#x5B57;&#x4E0D;&#x6613;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8BF4;&#x660E;&#x51FA;&#x5904;&#xFF0C;&#x8D70;&#x8FC7;&#x8DEF;&#x8FC7;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x4F38;&#x51FA;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x6307;&#x5934;&#x70B9;&#x4E2A;&#x8D5E;&#x518D;&#x8D70;&#x5427;(<em>&#x2579;&#x25BD;&#x2579;</em>)</p>
</blockquote>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/a9641be9ea6b8afa6bb5cb7b84b7757d.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034732859386494983.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034732859386494983.html" itemprop="url">Linux启动tomcat命令行关闭后服务会停止</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:38:20+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;26&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095/">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a>&#x300D;</p>
<p>&#x200B;<br>&#x6700;&#x8FD1;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x9879;&#x76EE;&#x9700;&#x8981;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3001;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8FD8;&#x8981;&#x517C;&#x987E;&#x8FD0;&#x7EF4;&#x7684;&#x4E8B;&#x60C5;&#x771F;&#x662F;&#x592A;&#x96BE;&#x4E86;&#x3001;&#x7531;&#x4E8E;&#x4E0D;&#x719F;&#x6089;&#x3001;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5C0F;&#x5751;&#x3001;&#x5728;&#x6B64;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3001;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x8FD8;&#x8BF7;&#x6307;&#x6B63;&#x3002;</p>
<blockquote>
<p><strong>&#x95EE;&#x9898;&#xFF1A;Linux&#x542F;&#x52A8;tomcat&#x547D;&#x4EE4;&#x884C;&#x5173;&#x95ED;&#x540E;&#x670D;&#x52A1;&#x4F1A;&#x505C;&#x6B62;&#xFF1F;</strong></p>
</blockquote>
<p>&#x4E00;&#x822C;Linux&#x4E0B;tomcat&#x670D;&#x52A1;&#x7684;&#x542F;&#x52A8;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x5207;&#x6362;&#x5230; apache-tomcat-8.5.73/bin/&#x76EE;&#x5F55;&#x4E0B;&#x6267;&#x884C; ./startup.sh &#x547D;&#x4EE4;&#x3002;&#x8FD9;&#x6837;&#x662F;&#x80FD;&#x6210;&#x529F;&#x542F;&#x52A8;&#x3001;&#x4F46;&#x662F;ctrl c&#x9000;&#x51FA;&#x547D;&#x4EE4;&#x884C;&#x4E4B;&#x540E;&#x670D;&#x52A1;&#x4F1A;&#x505C;&#x6B62;&#x3002;</p>
<blockquote>
<p><strong>&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1A;&#x901A;&#x8FC7;&#x6267;&#x884C; nohup ./startup.sh &amp;  &#x547D;&#x4EE4;&#x6765;&#x542F;&#x52A8;&#x670D;&#x52A1;</strong></p>
</blockquote>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">csharp&#x590D;&#x5236;&#x4EE3;&#x7801;[root@ecs-d8ce ~]# cd /data/liuzhuren/apache-tomcat-8.5.73/bin/</span><br><span class="line">[root@ecs-d8ce bin]# nohup ./startup.sh &amp;</span><br><span class="line">[1] 34925</span><br></pre></td></tr></table></figure>

<p><img src="%22%E7%82%B9%E5%87%BB%E5%B9%B6%E6%8B%96%E6%8B%BD%E4%BB%A5%E7%A7%BB%E5%8A%A8%22" alt></p>
<p>&#x8FD9;&#x6837;&#x95EE;&#x9898;&#x5C31;&#x6210;&#x529F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x6269;&#x5C55;&#x77E5;&#x8BC6;&#xFF1A;</p>
</blockquote>
<p><strong>1.nohup</strong></p>
<p>&#x7528;&#x9014;&#xFF1A;&#x4E0D;&#x6302;&#x65AD;&#x5730;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x8BED;&#x6CD5;&#xFF1A;nohup Command [ Arg &#x2026; ] [&#x3000;&amp; ]</p>
<p>&#x3000;&#x3000;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x5C06; nohup &#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x7EC8;&#x7AEF;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x90FD;&#x5C06;&#x9644;&#x52A0;&#x5230;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684; nohup.out &#x6587;&#x4EF6;&#x4E2D;&#x91CC;&#x9762;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684; nohup.out &#x6587;&#x4EF6;&#x4E0D;&#x53EF;&#x4EE5;&#x5199;&#xFF0C;&#x9700;&#x8981;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#x5230; $HOME/nohup.out &#x6587;&#x4EF6;&#x4E2D;&#x91CC;&#x9762;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6587;&#x4EF6;&#x80FD;&#x521B;&#x5EFA;&#x6216;&#x6253;&#x5F00;&#x4EE5;&#x7528;&#x4E8E;&#x8FFD;&#x52A0;&#xFF0C;&#x90A3;&#x4E48; Command &#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x547D;&#x4EE4;&#x4E0D;&#x53EF;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x9000;&#x51FA;&#x72B6;&#x6001;&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x8FD4;&#x56DE;&#x4E0B;&#x5217;&#x51FA;&#x53E3;&#x503C;&#xFF1A; &#x3000;&#x3000;</p>
<p>&#x3000;&#x3000;126 &#x53EF;&#x4EE5;&#x67E5;&#x627E;&#x4F46;&#x4E0D;&#x80FD;&#x8C03;&#x7528; Command &#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x547D;&#x4EE4;&#x3002; &#x3000;&#x3000;</p>
<p>&#x3000;&#x3000;127 nohup &#x547D;&#x4EE4;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x6216;&#x4E0D;&#x80FD;&#x67E5;&#x627E;&#x7531; Command &#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x547D;&#x4EE4;&#x3002; &#x3000;&#x3000;</p>
<p>&#x3000;&#x3000;&#x5426;&#x5219;&#xFF0C;nohup &#x547D;&#x4EE4;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x662F; Command &#x53C2;&#x6570;&#x6307;&#x5B9A;&#x547D;&#x4EE4;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x3002;</p>
<p><strong>2.&amp;</strong></p>
<p>&#x7528;&#x9014;&#xFF1A;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;</p>
<p>&#x4E00;&#x822C;&#x4E24;&#x4E2A;&#x4E00;&#x8D77;&#x7528;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">csharp&#x590D;&#x5236;&#x4EE3;&#x7801;[root@ecs-d8ce ~]# cd /data/liuzhuren/apache-tomcat-8.5.73/bin/</span><br><span class="line">[root@ecs-d8ce bin]# nohup ./startup.sh &amp;</span><br><span class="line">[1] 34925</span><br></pre></td></tr></table></figure>

<p>&#x8FD9;&#x6837;&#x5C31;&#x7B97;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;tomcat&#x3001;&#x5373;&#x4F7F;&#x9000;&#x51FA;&#x547D;&#x4EE4;&#x884C;&#x6216;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p>&#x200B;&#x5927;&#x5BB6;<strong>&#x70B9;&#x8D5E;&#x3001;&#x6536;&#x85CF;&#x3001;&#x5173;&#x6CE8;&#x3001;&#x8BC4;&#x8BBA;</strong>&#x5566; &#x3001; &#x6253;&#x5361; &#x6587;&#x7AE0; &#x66F4;&#x65B0; <strong>105/  365&#x5929;</strong></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/7a3482b57880844ff1f5596fae7abe56.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034730692407722020.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034730692407722020.html" itemprop="url">TCP/IP五层网络协议</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:30:13+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p><strong>&#x672C;&#x6587;&#x6B63;&#x5728;&#x53C2;&#x4E0E; &#x201C;<a href="https://dev.newban.cn/7033976124547792927">&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x5FC5;&#x77E5;&#x5FC5;&#x4F1A;</a>&#x201D;&#x5F81;&#x6587;&#x6D3B;&#x52A8;</strong></p>
<h2 id="C-S-amp-B-S&#x673A;&#x6784;"><a href="#C-S-amp-B-S&#x673A;&#x6784;" class="headerlink" title="C/S &amp; B/S&#x673A;&#x6784;"></a>C/S &amp; B/S&#x673A;&#x6784;</h2><p>&#x4E92;&#x8054;&#x7F51;&#x901A;&#x4FE1;&#x8F6F;&#x4EF6;&#x6709;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x662F;C/S&#x67B6;&#x6784;&#x548C;B/S&#x67B6;&#x6784;&#x3002;</p>
<p>C/S&#x67B6;&#x6784;&#x6307;&#x7684;&#x662F;Client-Server&#xFF0C;&#x5206;&#x522B;&#x6709;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x5B89;&#x88C5;&#x7684;QQ&#x3001;WeChat&#x3001;Youku&#x7B49;&#x90FD;&#x5C5E;&#x4E8E;C/S&#x67B6;&#x6784;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x8F6F;&#x4EF6;&#xFF0C;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>B/S&#x67B6;&#x6784;&#x6307;&#x7684;&#x662F;Brower-Server&#xFF0C;B/S&#x67B6; &#x6784;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;C/S&#x67B6;&#x6784;&#xFF0C;B&#x6307;&#x7684;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x4E2D;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6BD4;&#x5982;&#x8BBF;&#x95EE;&#x767E;&#x5EA6;&#xFF0C;&#x767E;&#x5EA6;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x7AEF; &#xFF0C;&#x8BBF;&#x95EE;&#x4F18;&#x9177;&#x7F51;&#x9875;&#x7AEF;&#xFF0C;&#x4F18;&#x9177;&#x7F51;&#x9875;&#x7AEF;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x57FA;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x7269;&#x7406;&#x4ECB;&#x8D28;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4ECB;&#x7ECD;"><a href="#&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4ECB;&#x7ECD;"></a>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4ECB;&#x7ECD;</h2><p>&#x7F51;&#x7EDC;&#x5B58;&#x5728;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x8DE8;&#x5730;&#x57DF;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x901A;&#x4FE1;&#xFF1B;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x5982;&#x4F55;&#x63A5;&#x5165;Internet&#x4EE5;&#x53CA;&#x63A5;&#x5165;Internet&#x7684;&#x6807;&#x51C6;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x4E2D;&#x56FD;&#x4EBA;&#x548C;&#x4E2D;&#x56FD;&#x4EBA;&#x6253;&#x7535;&#x8BDD;&#x8BF4;&#x7684;&#x662F;&#x4E2D;&#x6587;&#xFF0C;&#x7F8E;&#x56FD;&#x4EBA;&#x548C;&#x7F8E;&#x56FD;&#x4EBA;&#x6253;&#x7535;&#x8BDD;&#x8BF4;&#x7684;&#x662F;&#x82F1;&#x6587;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BF4;&#x7F51;&#x7EDC; = &#x7269;&#x7406;&#x94FE;&#x63A5;&#x4ECB;&#x8D28; + &#x4E92;&#x8054;&#x7F51;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x534F;&#x8BAE;"><a href="#&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x534F;&#x8BAE;" class="headerlink" title="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x534F;&#x8BAE;"></a>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x534F;&#x8BAE;</h2><p>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x5806;&#x534F;&#x8BAE;&#x7EC4;&#x6210;&#xFF0C;&#x76EE;&#x524D;&#x6765;&#x8BB2;&#x4E16;&#x754C;&#x4E0A;&#x901A;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x82F1;&#x8BED;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x8BA1;&#x7B97;&#x673A;&#x6BD4;&#x4F5C;&#x4EBA;&#x7684;&#x8BDD;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x754C;&#x7684;&#x82F1;&#x8BED;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x9075;&#x5B88;&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x7EDF;&#x4E00;&#x7684;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x6536;&#x53D1;&#x4FE1;&#x606F;&#x4ECE;&#x800C;&#x5B8C;&#x6210;&#x901A;&#x4FE1;&#x3002;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x5982;&#x4F55;&#x63A5;&#x5165;Internet&#x4EE5;&#x53CA;&#x63A5;&#x5165;Internet&#x7684;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#x6309;&#x7167;&#x529F;&#x80FD;&#x4E0D;&#x540C;&#x5206;&#x4E3A;osi&#x4E03;&#x5C42;&#x534F;&#x8BAE;&#x6216;&#x8005;tcp/ip&#x4E94;&#x5C42;&#x534F;&#x8BAE;&#x6216;&#x8005;tcp/ip&#x56DB;&#x5C42;&#x534F;&#x8BAE;&#x3002;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/88652e4456df5875173d6fc67448cc2af79a5ce02aa54275332be4d90939e88a" alt="image-20210606153337950"></p>
<p>OSI&#x4E03;&#x5C42;&#x534F;&#x8BAE;&#x662F;&#x56FD;&#x9645;&#x6807;&#x51C6;&#x5316;&#x7EC4;&#x7EC7;ISO&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x662F;&#x5E02;&#x573A;&#x539F;&#x56E0;&#x548C;&#x8BE5;&#x534F;&#x8BAE;&#x672C;&#x8EAB;&#x7684;&#x7F3A;&#x70B9;&#xFF08;&#x534F;&#x8BAE;&#x5B9E;&#x73B0;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7B49;&#xFF09;&#x5BFC;&#x81F4;&#x8D77;&#x521D;&#x5E02;&#x573A;&#x4E0A;&#x5927;&#x89C4;&#x6A21;&#x4F7F;&#x7528;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x8BE5;&#x534F;&#x8BAE;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x7279;&#x7F51;&#x3002;&#x6240;&#x4EE5;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x73B0;&#x8C61;&#xFF1A;&#x5F97;&#x5230;&#x6700;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x7684;&#x4E0D;&#x662F;&#x6CD5;&#x5F8B;&#x4E0A;&#x7684;&#x56FD;&#x9645;&#x6807;&#x51C6;OSI&#xFF0C;&#x800C;&#x662F;&#x975E;&#x56FD;&#x9645;&#x6807;&#x51C6;TCP/IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;&#x3002;&#x8FD9;&#x6837;TCP/IP&#x4E94;&#x5C42;&#x6210;&#x4E3A;&#x4E86;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x56FD;&#x9645;&#x6807;&#x51C6;&#x3002;</p>
<h2 id="TCP-IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;"><a href="#TCP-IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;" class="headerlink" title="TCP/IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;"></a>TCP/IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;</h2><p>&#x5C06;&#x5E94;&#x7528;&#x5C42;&#x3001;&#x8868;&#x793A;&#x5C42;&#x3001;&#x4F1A;&#x8BDD;&#x5C42;&#x5408;&#x5E76;&#x4E3A;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x4ECE;TCP/IP&#x4E94;&#x5C42;&#x534F;&#x8BAE;&#x7684;&#x89D2;&#x5EA6;&#x4ECB;&#x7ECD;&#x6BCF;&#x5C42;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7406;&#x89E3;&#x4E92;&#x8054;&#x7F51;&#x901A;&#x4FE1;&#x539F;&#x7406;&#x3002;</p>
<p>&#x7528;&#x6237;&#x611F;&#x77E5;&#x5230;&#x7684;&#x53EA;&#x6709;&#x6700;&#x4E0A;&#x9762;&#x4E00;&#x5C42;&#x534F;&#x8BAE;&#x5373;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x6BCF;&#x5C42;&#x90FD;&#x4F9D;&#x8D56;&#x4E0B;&#x4E00;&#x5C42;&#xFF0C;&#x56E0;&#x6B64;&#x4ECE;&#x6700;&#x4E0B;&#x9762;&#x4E00;&#x5C42;-&#x7269;&#x7406;&#x5C42;&#x8FD8;&#x662F;&#x4ECB;&#x7ECD;&#xFF0C;&#x6BCF;&#x5C42;&#x90FD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x8D8A;&#x5F80;&#x4E0A;&#x8D8A;&#x9760;&#x8FD1;&#x7528;&#x6237;&#xFF0C;&#x8D8A;&#x5F80;&#x4E0B;&#x8D8A;&#x9760;&#x8FD1;&#x786C;&#x4EF6;&#x3002;</p>
<h3 id="&#x7269;&#x7406;&#x5C42;"><a href="#&#x7269;&#x7406;&#x5C42;" class="headerlink" title="&#x7269;&#x7406;&#x5C42;"></a>&#x7269;&#x7406;&#x5C42;</h3><p>&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x60F3;&#x8981;&#x4E00;&#x8D77;happy&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x63A5;&#x5165;Internet&#xFF0C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x7EC4;&#x7F51;&#x3002;</p>
<p>&#x7269;&#x7406;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x53D1;&#x9001;&#x7535;&#x4FE1;&#x53F7;&#xFF0C;&#x4E00;&#x7EC4;&#x7269;&#x7406;&#x5C42;&#x7684;&#x6570;&#x636E;&#x79F0;&#x4E3A;<code>&#x4F4D;</code>&#xFF0C;&#x5355;&#x7EAF;&#x7684;&#x7535;&#x4FE1;&#x53F7;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x610F;&#x4E49;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x7535;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#x624D;&#x80FD;&#x4F7F;&#x8FD9;&#x4E9B;&#x7535;&#x4FE1;&#x53F7;&#x5177;&#x6709;&#x6570;&#x636E;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5BF9;&#x8FD9;&#x4E9B;&#x7535;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#x5462;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;"><a href="#&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;" class="headerlink" title="&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;"></a>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;</h3><p>&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x5E95;&#x5C42;&#x662F;&#x57FA;&#x4E8E;&#x7535;&#x4FE1;&#x53F7;&#x7684;&#xFF0C;&#x7535;&#x4FE1;&#x53F7;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x72B6;&#x6001;0&#x548C;1&#xFF0C;&#x4F46;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x7535;&#x4FE1;&#x53F7;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x8FD9;&#x4E9B;&#x7535;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x6BCF;&#x7EC4;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x3002;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x7535;&#x4FE1;&#x53F7;&#x7684;&#x5206;&#x7EC4;&#x65B9;&#x5F0F;&#x3002;</p>
<h4 id="&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;"><a href="#&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;" class="headerlink" title="&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;"></a>&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;</h4><p>&#x5BF9;&#x7535;&#x4FE1;&#x53F7;&#x7684;&#x5206;&#x7EC4;&#x65B9;&#x5F0F;&#x4EE5;&#x524D;&#x662F;&#x4E0D;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x5F62;&#x6210;&#x7EDF;&#x4E00;&#x7684;&#x6807;&#x51C6;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x7684;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x4E86;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5BF9;&#x7535;&#x4FE1;&#x53F7;&#x7684;&#x5206;&#x7EC4;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#xFF0C;&#x4E00;&#x7EC4;&#x7535;&#x4FE1;&#x53F7;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x53EB;&#x505A;<code>&#x5E27;</code>&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E27;&#x5206;&#x6210;&#x62A5;&#x5934;head&#x548C;&#x6570;&#x636E;data&#x4E24;&#x90E8;&#x5206;&#x3002;</p>
<table>
<thead>
<tr>
<th>head - &#x56FA;&#x5B9A;&#x5305;&#x542B;18&#x4E2A;&#x5B57;&#x8282;</th>
<th>data - 46~1500&#x5B57;&#x8282;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x53D1;&#x9001;&#x8005;/&#x6E90;&#x5730;&#x5740;&#xFF1A;6&#x4E2A;&#x5B57;&#x8282;&#x63A5;&#x6536;&#x8005;/&#x76EE;&#x6807;&#x5730;&#x5740;&#xFF1A;6&#x4E2A;&#x5B57;&#x8282;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;6&#x4E2A;&#x5B57;&#x8282;</td>
<td>&#x7535;&#x4FE1;&#x53F7;&#x6570;&#x636E;&#x5305;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;</td>
</tr>
</tbody></table>
<p>&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E27;&#x5305;&#x542B;&#x7684;&#x6570;&#x636E;&#x6700;&#x77ED;&#x4E3A;64&#x5B57;&#x8282;&#xFF0C;&#x6700;&#x957F;&#x4E3A;1518&#x5B57;&#x8282;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x6700;&#x5927;&#x9650;&#x5236;&#x5C31;&#x5206;&#x7247;&#x53D1;&#x9001;&#x3002;</p>
<h4 id="mac&#x5730;&#x5740;"><a href="#mac&#x5730;&#x5740;" class="headerlink" title="mac&#x5730;&#x5740;"></a>mac&#x5730;&#x5740;</h4><p>&#x62A5;&#x5934;&#x4E2D;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x7684;&#x5730;&#x5740;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x6765;&#x7684;&#x5462;&#xFF1F;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x63A5;&#x5165;Internet&#x7684;&#x8BBE;&#x5907;&#x90FD;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x7F51;&#x5361;&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x7684;&#x5730;&#x5740;&#x5C31;&#x662F;&#x6307;&#x7F51;&#x5361;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5373;<code>mac&#x5730;&#x5740;</code>&#x3002;&#x6BCF;&#x5757;&#x7F51;&#x5361;&#x5728;&#x51FA;&#x573A;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x88AB;&#x523B;&#x4E0A;&#x4E16;&#x754C;&#x4E0A;&#x552F;&#x4E00;&#x7684;mac&#x5730;&#x5740;&#x3002;</p>
<h4 id="&#x5E7F;&#x64AD;"><a href="#&#x5E7F;&#x64AD;" class="headerlink" title="&#x5E7F;&#x64AD;"></a>&#x5E7F;&#x64AD;</h4><p>&#x6709;&#x4E86;mac&#x5730;&#x5740;&#x6807;&#x8BC6;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x540C;&#x4E00;&#x7F51;&#x7EDC;&#x5185;&#x7684;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x4FE1;&#x4E86;(&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x8FC7;ARP&#x534F;&#x8BAE;&#x83B7;&#x53D6;&#x53E6;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;mac&#x5730;&#x5740;)&#xFF0C;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x91C7;&#x7528;&#x6700;&#x539F;&#x59CB;&#x7684;&#x65B9;&#x5F0F;&#x2014;&#x5E7F;&#x64AD;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x53EA;&#x8981;&#x6709;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5168;&#x4E16;&#x754C;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5168;&#x4E16;&#x754C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#x3002;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x5E7F;&#x64AD;&#x7684;&#x8FD9;&#x79CD;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x53D1;&#x9001;&#x8005;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x65F6;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x53EF;&#x4EE5;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x592A;&#x5927;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x7684;&#x8FD9;&#x79CD;&#x5E7F;&#x64AD;&#x9760;&#x543C;&#x4EA7;&#x751F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x5C31;&#x6709;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848; &#x2014; &#x5C06;&#x8BA1;&#x7B97;&#x673A;&#x653E;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5E7F;&#x64AD;&#x57DF;&#x4E2D;&#x3002;</p>
<h3 id="&#x7F51;&#x7EDC;&#x5C42;"><a href="#&#x7F51;&#x7EDC;&#x5C42;" class="headerlink" title="&#x7F51;&#x7EDC;&#x5C42;"></a>&#x7F51;&#x7EDC;&#x5C42;</h3><p>&#x901A;&#x8FC7;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5F7C;&#x6B64;&#x901A;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x4E2A;&#x5F7C;&#x6B64;&#x9694;&#x79BB;&#x7684;&#x5C0F;&#x7684;&#x5C40;&#x57DF;&#x7F51;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x901A;&#x4FE1;&#x90FD;&#x91C7;&#x7528;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x7684;&#x8FD9;&#x79CD;&#x5E7F;&#x64AD;&#x8FDB;&#x884C;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x5305;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x80FD;&#x6536;&#x5F97;&#x5230;&#xFF0C;&#x8FD9;&#x5DF2;&#x7ECF;&#x4E0D;&#x53EA;&#x662F;&#x6548;&#x7387;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x533A;&#x5206;&#x54EA;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#x4E2D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E7F;&#x64AD;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5305;&#x7684;&#x4F20;&#x8F93;&#x3002;</p>
<p>&#x7F51;&#x7EDC;&#x5C42;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x5957;&#x65B0;&#x7684;&#x5730;&#x5740;&#x6765;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x5E7F;&#x64AD;&#x57DF;(&#x5B50;&#x7F51;)&#xFF0C;&#x8FD9;&#x5957;&#x5730;&#x5740;&#x5C31;&#x662F;&#x7F51;&#x7EDC;IP&#x5730;&#x5740;&#x3002;</p>
<h4 id="IP&#x534F;&#x8BAE;"><a href="#IP&#x534F;&#x8BAE;" class="headerlink" title="IP&#x534F;&#x8BAE;"></a>IP&#x534F;&#x8BAE;</h4><p>IP&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x4E86;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#xFF0C;&#x8BE5;&#x5730;&#x5740;&#x79F0;&#x4E3A;IP&#x5730;&#x5740;&#xFF0C;&#x76EE;&#x524D;&#x591A;&#x6570;&#x8FD8;&#x662F;&#x4F7F;&#x7528;&#x7684;v4&#x7248;&#x672C;ipv4&#xFF0C;&#x8303;&#x56F4;&#x662F;0.0.0.0~255.255.255.255&#xFF0C;&#x4E00;&#x4E2A;IP&#x5730;&#x5740;&#x901A;&#x5E38;&#x643A;&#x7A0B;&#x56DB;&#x6BB5;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x6BD4;&#x5982;112.162.78.49.</p>
<p>IP&#x534F;&#x8BAE;&#x540C;&#x65F6;&#x89C4;&#x5B9A;&#xFF0C;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5934;&#x548C;&#x6570;&#x636E;&#xFF0C;&#x5934;&#x5305;&#x542B;&#x6E90;IP&#x5730;&#x5740;&#x548C;&#x76EE;&#x6807;IP&#x5730;&#x5740;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x4F20;&#x8F93;&#x5C42;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>IP&#x5730;&#x5740;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x5C40;&#x57DF;&#x7F51;(&#x5B50;&#x7F51;),&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E3B;&#x673A;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x4E3B;&#x673A;&#xFF0C;&#x5355;&#x7EAF;&#x7684;ip&#x5730;&#x5740;&#x6BB5;&#x53EA;&#x662F;&#x6807;&#x8BC6;&#x4E86;IP&#x5730;&#x5740;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x4ECE;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x6216;&#x4E3B;&#x673A;&#x90E8;&#x5206;&#x90FD;&#x65E0;&#x6CD5;&#x8FA8;&#x8BC6;&#x4E00;&#x4E2A;ip&#x6240;&#x5904;&#x7684;&#x5B50;&#x7F51;&#x3002;&#x6BD4;&#x5982;112.162.78.49&#x548C;112.162.78.94&#x5E76;&#x4E0D;&#x80FD;&#x8BF4;&#x660E;&#x8FD9;&#x4E24;&#x4E2A;IP&#x5730;&#x5740;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7684;ipv4&#x5730;&#x5740;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x5E94;&#x5F53;&#x662F;&#xFF1A;IP&#x5730;&#x5740; /&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x5730;&#x5740;&#x3002;</p>
<h4 id="&#x5B50;&#x7F51;&#x63A9;&#x7801;"><a href="#&#x5B50;&#x7F51;&#x63A9;&#x7801;" class="headerlink" title="&#x5B50;&#x7F51;&#x63A9;&#x7801;"></a>&#x5B50;&#x7F51;&#x63A9;&#x7801;</h4><p>&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x662F;&#x8868;&#x793A;&#x5C40;&#x57DF;&#x7F51;(&#x5B50;&#x7F51;)&#x7279;&#x5F81;&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x5F62;&#x5F0F;&#x4E0A;&#x7B49;&#x540C;&#x4E8E;IP&#x5730;&#x5740;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;32&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x5168;&#x90E8;&#x4E3A;1&#xFF0C;&#x4E3B;&#x673A;&#x90E8;&#x5206;&#x5168;&#x90E8;&#x4E3A;0&#x3002;&#x6BD4;&#x5982;&#xFF0C;IP&#x5730;&#x5740;&#x4E3A;172.16.10.1&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x77E5;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x662F;&#x524D;24&#x4F4D;&#xFF0C;&#x4E3B;&#x673A;&#x90E8;&#x5206;&#x662F;&#x540E;8&#x4F4D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x5C31;&#x662F;&#xFF1A;</p>
<p>11111111.11111111.11111111.00000000&#xFF0C;&#x5199;&#x6210;&#x5341;&#x8FDB;&#x5236;&#x5C31;&#x662F;255.255.255.0</p>
<p>&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5224;&#x65AD;&#x4EFB;&#x610F;&#x4E24;&#x4E2A;IP&#x5730;&#x5740;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5B50;&#x7F51;(&#x5C40;&#x57DF;&#x7F51;)&#xFF0C;&#x5224;&#x65AD;&#x4E24;&#x4E2A;IP &#x5730;&#x5740;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5C06;&#x4E24;&#x4E2A;IP&#x5730;&#x5740;&#x4E0E;&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x5206;&#x522B;&#x8FDB;&#x884C;<code>&#x4E0E;&#x8FD0;&#x7B97;</code>(&#x4E24;&#x4E2A;&#x6570;&#x4F4D;&#x90FD;&#x4E3A;1&#xFF0C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x4E3A;1&#xFF0C;&#x5426;&#x5219;&#x4E3A;0)&#x3002;&#x5982;&#x679C;&#x6BD4;&#x8F83;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x76F8;&#x540C;&#x5C31;&#x8868;&#x660E;&#x5B83;&#x4EEC;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5B50;&#x7F51;&#x4E2D;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x5728;&#x3002; &#x5224;&#x65AD;&#x4E24;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">python&#x590D;&#x5236;&#x4EE3;&#x7801;# IP&#x5730;&#x5740;&#x548C;&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x914D;&#x5408;&#x5230;&#x4E00;&#x8D77;&#x4F1A;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#x5730;&#x5740;/&#x5B50;&#x7F51;&#x5730;&#x5740;/&#x5C40;&#x57DF;&#x7F51;&#x5730;&#x5740;</span><br><span class="line"># &#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#xFF1A;&#x5C06;IP&#x5730;&#x5740;&#x548C;&#x5B50;&#x7F51;&#x63A9;&#x7801;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x4E8C;&#x7EA7;&#x5236; --- &#x6309;&#x4F4D;&#x4E0E;&#x8FD0;&#x7B97;</span><br><span class="line">&#x8BA1;&#x7B97;&#x673A;1</span><br><span class="line">172.16.10.1&#xFF1A;       10101100.00010000.00001010.00000001</span><br><span class="line">255.255.255.0       11111111.11111111.11111111.00000000</span><br><span class="line">&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF1A; 172.16.10.0&#xFF1A; 10101100.00010000.00001010.00000000</span><br><span class="line"></span><br><span class="line">&#x8BA1;&#x7B97;&#x673A;2</span><br><span class="line">172.16.10.2&#xFF1A;       10101100.00010000.00001010.00000010</span><br><span class="line">255.255.255.0    11111111.11111111.11111111.00000000</span><br><span class="line">&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF1A; 172.16.10.0&#xFF1A; 10101100.00010000.00001010.00000000</span><br></pre></td></tr></table></figure>

<p>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x76F4;&#x63A5;&#x9760;&#x5E7F;&#x64AD;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5305;&#x7684;&#x4F20;&#x8F93;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F51;&#x5173;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5305;&#x8F93;&#x51FA;&#x5230;&#x516C;&#x7F51;&#xFF0C;&#x6839;&#x636E;IP&#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x3002;</p>
<h4 id="ARP&#x534F;&#x8BAE;"><a href="#ARP&#x534F;&#x8BAE;" class="headerlink" title="ARP&#x534F;&#x8BAE;"></a>ARP&#x534F;&#x8BAE;</h4><p>&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x4FE1;&#x57FA;&#x672C;&#x9760;&#x543C;&#xFF0C;&#x5373;&#x5E7F;&#x64AD;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x6709;&#x4E0A;&#x5C42;&#x7684;&#x5305;&#x5230;&#x6700;&#x540E;&#x90FD;&#x8981;&#x5C01;&#x88C5;&#x4E0A;&#x4EE5;&#x592A;&#x7F51;&#x5934;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x53D1;&#x9001;&#xFF0C;&#x5728;&#x8C08;&#x53CA;&#x4EE5;&#x592A;&#x7F51;&#x534F;&#x8BAE;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#x901A;&#x4FE1;&#x662F;&#x57FA;&#x4E8E;mac&#x7684;&#x5E7F;&#x64AD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x53D1;&#x5305;&#x65F6;&#xFF0C;&#x83B7;&#x53D6;&#x81EA;&#x8EAB;&#x7684;mac&#x662F;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x7684;mac&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x901A;&#x8FC7;ARP&#x534F;&#x8BAE;&#x3002;</p>
<p>ARP&#x534F;&#x8BAE;&#x662F;&#x901A;&#x8FC7;&#x83B7;&#x53D6;&#x76EE;&#x6807;&#x8BA1;&#x7B97;&#x673A;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x53D6;&#x83B7;&#x53D6;&#x5176;mac&#x5730;&#x5740;&#x3002;</p>
<h3 id="&#x4F20;&#x8F93;&#x5C42;"><a href="#&#x4F20;&#x8F93;&#x5C42;" class="headerlink" title="&#x4F20;&#x8F93;&#x5C42;"></a>&#x4F20;&#x8F93;&#x5C42;</h3><p>&#x7F51;&#x7EDC;&#x5C42;&#x7684;IP&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x8BA1;&#x7B97;&#x673A;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;mac&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x6807;&#x8BC6;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x6807;&#x8BC6;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D1;&#x9001;&#xFF0C;&#x6BD4;&#x5982;QQ&#x3001;youku&#xFF0C;&#x6807;&#x8BC6;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x9700;&#x8981;&#x9760;&#x7AEF;&#x53E3;&#xFF0C;&#x7AEF;&#x53E3;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0E;&#x7F51;&#x5361;&#x5173;&#x8054;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x7AEF;&#x53E3;&#x7684;&#x8303;&#x56F4;&#x662F;0-65535,0-1023&#x4F4D;&#x7CFB;&#x7EDF;&#x5360;&#x7528;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x4F20;&#x8F93;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x5EFA;&#x7ACB;&#x7AEF;&#x53E3;&#x5230;&#x7AEF;&#x53E3;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x4F20;&#x8F93;&#x5C42;&#x6709;&#x4E24;&#x79CD;&#x534F;&#x8BAE;&#x5206;&#x522B;&#x662F;TCP&#x534F;&#x8BAE;&#x548C;UDP&#x534F;&#x8BAE;&#x3002;</p>
<h4 id="TCP&#x534F;&#x8BAE;"><a href="#TCP&#x534F;&#x8BAE;" class="headerlink" title="TCP&#x534F;&#x8BAE;"></a>TCP&#x534F;&#x8BAE;</h4><p>TCP&#x534F;&#x8BAE;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x597D;&#x4EBA;&#x534F;&#x8BAE;&#xFF0C;&#x662F;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#xFF0C;TCP&#x6570;&#x636E;&#x5305;&#x6CA1;&#x6709;&#x957F;&#x5EA6;&#x9650;&#x5236;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x7F51;&#x7EDC;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x901A;&#x5E38;TCP&#x6570;&#x636E;&#x5305;&#x7684;&#x957F;&#x5EA6;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;IP&#x6570;&#x636E;&#x5305;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5355;&#x4E2A;TCP&#x6570;&#x636E;&#x5305;&#x4E0D;&#x5FC5;&#x518D;&#x5206;&#x5272;&#x3002;</p>
<p>&#x57FA;&#x4E8E;TCP&#x534F;&#x8BAE;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x5FC5;&#x987B;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x5728;&#x5EFA;&#x7ACB;&#x53CC;&#x5411;&#x8FDE;&#x63A5;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;<code>&#x4E09;&#x6B21;&#x63E1;&#x624B;</code>&#xFF0C;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x65F6;&#x5219;&#x9700;&#x8981;<code>&#x56DB;&#x6B21;&#x6325;&#x624B;</code>&#x3002;</p>
<h4 id="UDP&#x534F;&#x8BAE;"><a href="#UDP&#x534F;&#x8BAE;" class="headerlink" title="UDP&#x534F;&#x8BAE;"></a>UDP&#x534F;&#x8BAE;</h4><p>UDP&#x534F;&#x8BAE;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#xFF0C;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x4E0D;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x540C;&#x7406;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7ED3;&#x675F;&#x4E5F;&#x6CA1;&#x6709;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#xFF0C;&#x8FD9;&#x6781;&#x5927;&#x51CF;&#x5C11;&#x4E86;&#x8D44;&#x6E90;&#x5F00;&#x9500;&#xFF0C;&#x4F46;&#x662F;UDP&#x534F;&#x8BAE;&#x4E0D;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x53EF;&#x9760;&#x4EA4;&#x4ED8;&#xFF0C;&#x53EA;&#x8D1F;&#x8D23;&#x5C06;&#x6570;&#x636E;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x7684;&#x53D1;&#x51FA;&#x53BB;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x5C42;"><a href="#&#x5E94;&#x7528;&#x5C42;" class="headerlink" title="&#x5E94;&#x7528;&#x5C42;"></a>&#x5E94;&#x7528;&#x5C42;</h3><p>&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x90FD;&#x5DE5;&#x4F5C;&#x5728;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x5F00;&#x653E;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x5F00;&#x53D1;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6570;&#x636E;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x89C4;&#x5B9A;&#x597D;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x6570;&#x636E;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x89C4;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3002;</p>
<p>TCP&#x534F;&#x8BAE;&#x53EF;&#x4EE5;&#x4E3A;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x4F20;&#x9012;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x90AE;&#x4EF6;&#x3001;&#x6587;&#x4EF6;&#x7B49;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x89C4;&#x5B9A;&#x90AE;&#x4EF6;&#x3001;&#x7F51;&#x9875;&#x3001;&#x6587;&#x4EF6;&#x7B49;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x534F;&#x8BAE;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x5C31;&#x5305;&#x62EC;HTTP&#x534F;&#x8BAE;&#x3001;SMTP&#x3001;FTP&#x7B49;&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;"><a href="#&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;" class="headerlink" title="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;"></a>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;</h2><p>&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x5F88;&#x597D;&#x5730;&#x603B;&#x7ED3;&#x4E86;&#x8FD9;&#x51E0;&#x5C42;&#x534F;&#x8BAE;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x5C01;&#x5305;&#x548C;&#x89E3;&#x5305;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/d5e2fefcbdcf6fb4482145720d748032b97af3ca872060a767d869ade1bcc06f" alt="img"></p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF0C;&#x6BCF;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x9700;&#x8981;&#x5177;&#x5907;&#x56DB;&#x79CD;&#x8981;&#x7D20;&#xFF1A;</p>
<ul>
<li>&#x672C;&#x673A;IP&#x5730;&#x5740;</li>
<li>&#x5B50;&#x7F51;&#x63A9;&#x7801;</li>
<li>&#x7F51;&#x5173;&#x7684;IP&#x5730;&#x5740;</li>
<li>DNS&#x7684;IP&#x5730;&#x5740;</li>
</ul>
<h3 id="DNS&#x57DF;&#x540D;&#x89E3;&#x6790;"><a href="#DNS&#x57DF;&#x540D;&#x89E3;&#x6790;" class="headerlink" title="DNS&#x57DF;&#x540D;&#x89E3;&#x6790;"></a>DNS&#x57DF;&#x540D;&#x89E3;&#x6790;</h3><p>&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x4E8E;<code>www.baidu.com</code>&#x8FD9;&#x79CD;&#x57DF;&#x540D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x662F;IP&#x5730;&#x5740;&#xFF0C;&#x6BD4;&#x5982;&#x767E;&#x5EA6;&#x7684;IP&#x5730;&#x5740;&#x662F;112.112.112.0&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5E94;&#x8BE5;&#x8F93;&#x5165;&#x6B64;IP&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x767E;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4ECA;&#x7F51;&#x7AD9;&#x7684;&#x6570;&#x91CF;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E48;&#x591A;&#x7F51;&#x7AD9;&#x7684;IP&#x5730;&#x5740;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x6240;&#x4EE5;DNS&#x5C31;&#x51FA;&#x51FA;&#x73B0;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x5BF9;DNS&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x60F3;&#x8981;&#x8BE6;&#x7EC6;&#x7684;&#x4E86;&#x89E3;DNS&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x641C;&#x7D22;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x4EEC;&#x6B63;&#x5E38;&#x7F16;&#x7A0B;&#x5F71;&#x54CD;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF0C;DNS&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5C06;IP&#x5730;&#x5740;&#x89E3;&#x6790;&#x4E3A;&#x57DF;&#x540D;&#xFF0C;&#x6BD4;&#x5982;&#x5C06;112.112.112.0&#x89E3;&#x6790;&#x4E3A;<code>www.baidu.com</code>&#x3002;</p>
<h3 id="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;-1"><a href="#&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;-1" class="headerlink" title="&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;"></a>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;</h3><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x8F6F;&#x4EF6;&#x6709;&#x4E24;&#x79CD;&#xFF1A;BS&#x67B6;&#x6784;&#x3001;CS&#x67B6;&#x6784;&#x3002;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;BS&#x67B6;&#x6784;&#x6CA1;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x7279;&#x6B8A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6D41;&#x7A0B;&#x65B9;&#x9762;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;BS&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x7F51;&#x5740;&#x8F93;&#x5165;&#x680F;&#xFF09;&#x591A;&#x4E00;&#x4E2A;DNS&#x57DF;&#x540D;&#x89E3;&#x6790;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7F51;&#x5740;&#x8F93;&#x5165;&#x680F;&#x4E0A;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x7F51;&#x5740;&#xFF0C;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x5230;&#x83B7;&#x53D6;&#x9875;&#x9762;&#x54CD;&#x5E94;&#x4FE1;&#x606F;&#x53D1;&#x751F;&#x4E86;&#x4EE5;&#x4E0B;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;:</p>
<blockquote>
<p>&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;url&#x8F93;&#x5165;&#x6846;&#x4E2D;&#x8F93;&#x5165;&#x60F3;&#x8BBF;&#x95EE;&#x7684;&#x5730;&#x5740;.</p>
<p>(1) &#x5728;&#x53D1;&#x9001;http&#x8BF7;&#x6C42;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x67E5;&#x8BE2;&#x8BF7;&#x6C42;&#x4F1A;&#x5148;&#x627E;&#x5230;&#x672C;&#x5730; DNS &#x670D;&#x52A1;&#x5668;&#x6765;&#x67E5;&#x8BE2;&#x662F;&#x5426;&#x5305;&#x542B; IP &#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x672C;&#x5730; DNS &#x65E0;&#x6CD5;&#x67E5;&#x8BE2;&#x5230;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#xFF0C;&#x5C31;&#x4F1A;&#x5411;&#x6839;&#x57DF;&#x540D;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;&#x4E00;&#x4E2A; DNS &#x67E5;&#x8BE2;&#x7528;&#x6237;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x7684;IP&#x5730;&#x5740;&#x3002;</p>
<p>(2) &#x6D4F;&#x89C8;&#x5668;&#x548C;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x7ACB;TCP&#x8FDE;&#x63A5;&#x3002;</p>
<p>(3) &#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x4E4B;&#x540E;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5411;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;http&#x8BF7;&#x6C42;,&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x5305;&#x3002;</p>
<p>(4) &#x5982;&#x679C;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x4F1A;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x3002;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x7684;&#x91CD;&#x5B9A;&#x5411;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x83B7;&#x53D6;&#x4E86;&#x91CD;&#x5B9A;&#x5411;&#x54CD;&#x5E94;&#x540E;&#xFF0C;&#x627E;&#x5230;&#x91CD;&#x5B9A;&#x5411;&#x5730;&#x5740;&#xFF0C;&#x91CD;&#x590D;&#x7B2C;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x6D4F;&#x89C8;&#x5668;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x643A;&#x5E26;&#x65B0;&#x7684; URL&#xFF0C;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x3002;</p>
</blockquote>
<h2 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h2><blockquote>
<p>&#x6587;&#x7AE0;&#x9996;&#x53D1;&#x4E8E;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;<code>&#x7A0B;&#x5E8F;&#x5A9B;&#x5C0F;&#x5E84;</code>&#xFF0C;&#x540C;&#x6B65;&#x4E8E;<a href="/external_links/f7671c2bae94c1c55b771f079a8a64a0.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a>&#x3001;<a href="/external_links/6593a2e2daca8ef969488812a15b31c3.html" target="blank" rel="noopener">&#x77E5;&#x4E4E;</a>&#x3002;</p>
<p>&#x7801;&#x5B57;&#x4E0D;&#x6613;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8BF4;&#x660E;&#x51FA;&#x5904;&#xFF0C;&#x8D70;&#x8FC7;&#x8DEF;&#x8FC7;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x4F38;&#x51FA;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x6307;&#x5934;&#x70B9;&#x4E2A;&#x8D5E;&#x518D;&#x8D70;&#x5427;(<em>&#x2579;&#x25BD;&#x2579;</em>)</p>
</blockquote>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/b6abe3fbc55da14edec3df3d68b0cffcfa6d34c1f8c654500d472ff6d3e38666" alt="&#x7F51;&#x7EDC;&#x534F;&#x8BAE;"></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/68736c76ca4414d31cf35154a2f04c1c.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034726773312978951.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034726773312978951.html" itemprop="url">Maven使用教程，建议小白(二) Maven核心概念 Ma</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T12:17:35+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;"><a href="#Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;" class="headerlink" title="Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;"></a>Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;</h1><p>&#x300C;&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;25&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095/">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a>&#x300D;&#x3002;</p>
<h2 id="&#x5173;&#x4E8E;&#x4F5C;&#x8005;"><a href="#&#x5173;&#x4E8E;&#x4F5C;&#x8005;" class="headerlink" title="&#x5173;&#x4E8E;&#x4F5C;&#x8005;"></a>&#x5173;&#x4E8E;&#x4F5C;&#x8005;</h2><ul>
<li>&#x4F5C;&#x8005;&#x4ECB;&#x7ECD;</li>
</ul>
<hr>
<blockquote>
<p>&#x1F353; <strong>&#x535A;&#x5BA2;&#x4E3B;&#x9875;&#xFF1A;<a href="/external_links/d4c106e846d85faf031bba5e3198a1e6.html" target="blank" rel="noopener">&#x4F5C;&#x8005;&#x4E3B;&#x9875;</a></strong>  </p>
<p>&#x1F353; <strong>&#x7B80;&#x4ECB;&#xFF1A;JAVA&#x9886;&#x57DF;&#x4F18;&#x8D28;&#x521B;&#x4F5C;&#x8005;&#x1F947;&#x3001;&#x4E00;&#x540D;&#x5728;&#x6821;&#x5927;&#x4E09;&#x5B66;&#x751F;&#x1F393;&#x3001;&#x5728;&#x6821;&#x671F;&#x95F4;&#x53C2;&#x52A0;&#x5404;&#x79CD;&#x7701;&#x8D5B;&#x3001;&#x56FD;&#x8D5B;&#xFF0C;&#x65A9;&#x83B7;&#x4E00;&#x7CFB;&#x5217;&#x8363;&#x8A89;</strong>&#x1F3C6;  </p>
<p>&#x1F353; <strong>&#x5173;&#x6CE8;&#x6211;&#xFF1A;&#x5173;&#x6CE8;&#x6211;&#x5B66;&#x4E60;&#x8D44;&#x6599;&#x3001;&#x6587;&#x6863;&#x4E0B;&#x8F7D;&#x7EDF;&#x7EDF;&#x90FD;&#x6709;&#xFF0C;&#x6BCF;&#x65E5;&#x5B9A;&#x65F6;&#x66F4;&#x65B0;&#x6587;&#x7AE0;&#xFF0C;&#x52B1;&#x5FD7;&#x505A;&#x4E00;&#x540D;JAVA&#x8D44;&#x6DF1;&#x7A0B;&#x5E8F;&#x733F;</strong>&#x1F468;&#x200D;&#x1F4BB;</p>
</blockquote>
<hr>
<h1 id="Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;-1"><a href="#Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;-1" class="headerlink" title="Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;"></a>Maven&#x6838;&#x5FC3;&#x6982;&#x5FF5;</h1><h2 id="1&#x3001;&#x5750;&#x6807;"><a href="#1&#x3001;&#x5750;&#x6807;" class="headerlink" title="1&#x3001;&#x5750;&#x6807;"></a>1&#x3001;&#x5750;&#x6807;</h2><p><strong>&#x4EC0;&#x4E48;&#x662F;&#x5750;&#x6807;&#xFF1F;</strong></p>
<p>&#x5750;&#x6807;&#x5728;&#x5E73;&#x9762;&#x51E0;&#x4F55;&#x4E2D;&#x5750;&#x6807;&#xFF08;x,y&#xFF09;&#x53EF;&#x4EE5;&#x6807;&#x8BC6;&#x5E73;&#x9762;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x70B9;&#x3002;</p>
<p><strong>Maven&#x5750;&#x6807;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#xFF08;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x6807;&#x8BC6;&#x51B3;&#x5B9A;&#x4E86;Maven&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF09;</strong></p>
<p>&#x2013;groupId&#xFF1A;&#x5B9A;&#x4E49;&#x5F53;&#x524D;Maven&#x9879;&#x76EE;&#x96B6;&#x5C5E;&#x9879;&#x76EE;</p>
<ul>
<li>groupld :&#x5B9A;&#x4E49;&#x5F53;&#x524D;Maven&#x9879;&#x76EE;&#x96B6;&#x5C5E;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x3002;&#x9996;&#x5148;, Maven&#x9879;&#x76EE;&#x548C;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E0D;-&#x5B9A;&#x662F;&#x4E00;-&#x5BF9;&#x4E00; -&#x7684;&#x5173;&#x7CFB;&#x3002;&#x6BD4;&#x5982;SpringFrameWork&#x8FD9;&#x4E00;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x5BF9;&#x5E94;&#x7684;Maven&#x9879;&#x76EE;&#x4F1A;&#x6709;&#x5F88;&#x591A;,&#x5982;spring-core spring-contex&#x7B49;&#x3002;&#x8FD9;&#x662F;&#x7531;&#x4E8E;Maven&#x4E2D;&#x6A21;&#x5757;&#x7684;&#x6982;&#x5FF5;,&#x56E0;&#x6B64;,&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x5F80;&#x5F80;&#x4F1A;&#x88AB;&#x5212;&#x5206;&#x6210;&#x5F88;&#x591A;&#x6A21;&#x5757;&#x3002;&#x5176;&#x6B21;&#xFF0C;groupld&#x4E0D;&#x5E94;&#x8BE5;&#x5BF9;&#x5E94;&#x9879;&#x76EE;&#x96B6;&#x5C5E;&#x7684;&#x7EC4;&#x7EC7;&#x6216;&#x516C;&#x53F8;&#x3002;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;, -&#x4E2A;&#x7EC4;&#x7EC7;&#x4E0B;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5B9E;&#x9645;&#x9879;&#x76EE;,&#x5982;&#x679C;groupld&#x53EA;&#x5B9A;&#x4E49;&#x5230;&#x7EC4;&#x7EC7;&#x7EA7;&#x522B;&#xFF0C;&#x800C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230; , aifactd&#x53EA;&#x80FD;&#x5B9A;&#x4E49;Maven&#x9879;&#x76EE;(&#x6A21;&#x5757;) , &#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x8FD9;&#x4E2A;&#x5C42;&#x6B21;&#x5C06;&#x96BE;&#x4EE5;&#x5B9A;&#x4E49;&#x3002;&#x6700;&#x540E;, groupld&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x4E0E;Java&#x5305;&#x540D;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x7C7B;&#x4F3C;,&#x901A;&#x5E38;&#x4E0E;&#x57DF;&#x540D;&#x53CD;&#x5411;&#x4E00;&#x5BF9;&#x5E94;&#x3002;</li>
</ul>
<p>&#x2013;artifactId&#xFF1A;&#x5B9A;&#x4E49;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6A21;&#x5757;</p>
<ul>
<li>artifactld :&#x8BE5;&#x5143;&#x7D20;&#x5B9A;&#x4E49;&#x5F53;&#x524D;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x4E00;-&#x4E2A;Maven&#x9879;&#x76EE;(&#x6A21;&#x5757;) , &#x63A8;&#x8350;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x540D;&#x79F0;&#x4F5C;&#x4E3A;artifactld&#x7684;&#x524D;&#x7F00;&#x3002;&#x6BD4;&#x5982;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;my-app&#x3002;</li>
</ul>
<p>&#x2013;version&#xFF1A;&#x5B9A;&#x4E49;&#x5F53;&#x524D;&#x9879;&#x76EE;&#x7684;&#x5F53;&#x524D;&#x7248;&#x672C;</p>
<ul>
<li>version :&#x8BE5;&#x5143;&#x7D20;&#x5B9A;&#x4E49;Maven&#x9879;&#x76EE;&#x5F53;&#x524D;&#x7684;&#x7248;&#x672C;</li>
</ul>
<p>&#x2013;packaging&#xFF1A;&#x5B9A;&#x4E49;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x6253;&#x5305;&#x65B9;&#x5F0F;</p>
<ul>
<li>packaging :&#x5B9A;&#x4E49;Maven&#x9879;&#x76EE;&#x6253;&#x5305;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x6253;&#x5305;&#x65B9;&#x5F0F;&#x901A;&#x5E38;&#x4E0E;&#x6240;&#x751F;&#x6210;&#x6784;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x6269;&#x5C55;&#x540D;&#x5BF9;&#x5E94;,&#x5982;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;packaging&#x4E3A;jar,&#x6700;&#x7EC8;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x4E3A;my-app-0.1-SNAPSHOT.jar&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x6253;&#x5305;&#x6210;war, ear&#x7B49;&#x3002;&#x5F53;&#x4E0D;&#x5B9A;&#x4E49;packaging&#x7684;&#x65F6;&#x5019; , Maven&#x4F1A;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;jar</li>
</ul>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">xml&#x590D;&#x5236;&#x4EE3;&#x7801;&lt;project xmlns=&quot;http://maven.apache.org/POM/4.0.0&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;</span><br><span class="line">xsi:schemaLocation=&quot;http://maven.apache.org/POM/4.0.0 https://maven.apache.org/xsd/maven-4.0.0.xsd&quot;&gt;</span><br><span class="line">    &lt;modelVersion&gt;4.0.0&lt;/modelVersion&gt;</span><br><span class="line">    &lt;groupId&gt;cn.rjxy.maven&lt;/groupId&gt;</span><br><span class="line">    &lt;artifactId&gt;Hello&lt;/artifactId&gt;</span><br><span class="line">    &lt;version&gt;0.0.1-SNAPSHOT&lt;/version&gt;</span><br><span class="line">    &lt;name&gt;Hello&lt;/name&gt;</span><br><span class="line"></span><br><span class="line">    &lt;dependencies&gt;</span><br><span class="line">        &lt;dependency&gt;</span><br><span class="line">            &lt;groupId&gt;junit&lt;/groupId&gt;</span><br><span class="line">			&lt;artifactId&gt;junit&lt;/artifactId&gt;</span><br><span class="line">            &lt;version&gt;4.9&lt;/version&gt;</span><br><span class="line">            &lt;scope&gt;test&lt;/scope&gt;</span><br><span class="line">        &lt;/dependency&gt;</span><br><span class="line">     &lt;/dependencies&gt;</span><br><span class="line">&lt;/project&gt;</span><br></pre></td></tr></table></figure>

<p><strong>Maven&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x5750;&#x6807;&#xFF1F;</strong></p>
<ul>
<li>Maven&#x4E16;&#x754C;&#x62E5;&#x6709;&#x5927;&#x91CF;&#x6784;&#x5EFA;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x6784;&#x5EFA;&#x7684;&#x7EDF;&#x4E00;&#x89C4;&#x8303;</li>
<li>&#x62E5;&#x6709;&#x4E86;&#x7EDF;&#x4E00;&#x89C4;&#x8303;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x67E5;&#x627E;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x673A;&#x5668;</li>
</ul>
<h2 id="2&#x3001;-&#x4F9D;&#x8D56;&#x7684;&#x8303;&#x56F4;"><a href="#2&#x3001;-&#x4F9D;&#x8D56;&#x7684;&#x8303;&#x56F4;" class="headerlink" title="2&#x3001; &#x4F9D;&#x8D56;&#x7684;&#x8303;&#x56F4;"></a>2&#x3001; &#x4F9D;&#x8D56;&#x7684;&#x8303;&#x56F4;</h2><p>&#x4F9D;&#x8D56;&#x58F0;&#x660E;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x5143;&#x7D20;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">xml&#x590D;&#x5236;&#x4EE3;&#x7801;&lt;dependencies&gt;</span><br><span class="line">        &lt;dependency&gt;</span><br><span class="line">            &lt;groupId&gt;junit&lt;/groupId&gt;</span><br><span class="line">			&lt;artifactId&gt;junit&lt;/artifactId&gt;</span><br><span class="line">            &lt;version&gt;4.9&lt;/version&gt;</span><br><span class="line">            &lt;scope&gt;test&lt;/scope&gt;</span><br><span class="line">        &lt;/dependency&gt;</span><br><span class="line">&lt;/dependencies&gt;</span><br></pre></td></tr></table></figure>

<p>&#x5176;&#x4E2D;&#x4F9D;&#x8D56;&#x8303;&#x56F4;scope &#x7528;&#x6765;&#x63A7;&#x5236;&#x4F9D;&#x8D56;&#x548C;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD0;&#x884C;&#x7684;classpath&#x7684;&#x5173;&#x7CFB;. &#x4E3B;&#x8981;&#x7684;&#x662F;&#x4E09;&#x79CD;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>compile&#xFF1A; &#x9ED8;&#x8BA4;&#x7F16;&#x8BD1;&#x4F9D;&#x8D56;&#x8303;&#x56F4;&#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD0;&#x884C;&#x4E09;&#x79CD;classpath&#x90FD;&#x6709;&#x6548;</li>
<li>test&#xFF1A;&#x6D4B;&#x8BD5;&#x4F9D;&#x8D56;&#x8303;&#x56F4;&#x3002;&#x53EA;&#x5BF9;&#x4E8E;&#x6D4B;&#x8BD5;classpath&#x6709;&#x6548;</li>
<li>provided&#xFF1A;&#x5DF2;&#x63D0;&#x4F9B;&#x4F9D;&#x8D56;&#x8303;&#x56F4;&#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#x7684;classpath&#x90FD;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x8FD0;&#x884C;&#x65E0;&#x6548;&#x3002;&#x56E0;&#x4E3A;&#x7531;&#x5BB9;&#x5668;&#x5DF2;&#x7ECF;&#x63D0;&#x4F9B;&#xFF0C;&#x4F8B;&#x5982;servlet-api&#xFF08;Tomcat&#xFF09;</li>
<li>runtime:&#x8FD0;&#x884C;&#x65F6;&#x63D0;&#x4F9B;&#x3002;&#x4F8B;&#x5982;:jdbc&#x9A71;&#x52A8;</li>
</ol>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/2c85dc14cf278fb6e444337a72ad5faa24358f46e05b3a3d9b9bc101290d66cd" alt="image-20210924130351620"></p>
<h2 id="3&#x3001;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;"><a href="#3&#x3001;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;" class="headerlink" title="3&#x3001;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;"></a>3&#x3001;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;</h2><p><strong>&#x4EC0;&#x4E48;&#x662F;Maven&#x4ED3;&#x5E93;&#xFF1F;</strong></p>
<p>&#x7528;&#x6765;&#x7EDF;&#x4E00;&#x5B58;&#x50A8;&#x6240;&#x6709;Maven&#x5171;&#x4EAB;&#x6784;&#x5EFA;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x662F;&#x4ED3;&#x5E93;</p>
<p><strong>Maven&#x4ED3;&#x5E93;&#x5E03;&#x5C40;</strong></p>
<ul>
<li>&#x6839;&#x636E;Maven&#x5750;&#x6807;&#x5B9A;&#x4E49;&#x6BCF;&#x4E2A;&#x6784;&#x5EFA;&#x5728;&#x4ED3;&#x5E93;&#x4E2D;&#x552F;&#x4E00;&#x5B58;&#x50A8;&#x8DEF;&#x5F84;</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/3aca6ee40229a211990a842e3e666effa2ae6c9cdf759c1ef8851cb5ee34c840" alt="image-20210924135028633"></p>
<p><strong>&#x4ED3;&#x5E93;&#x7684;&#x5206;&#x7C7B;</strong></p>
<ul>
<li>&#x672C;&#x5730;&#x4ED3;&#x5E93;<br>~/.m2/repository/&#xFF08;&#x9ED8;&#x8BA4;&#x7684;&#x4ED3;&#x5E93;&#x76EE;&#x5F55;&#xFF09;<br>&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF08;&#x9700;&#x8981;&#x4ECE;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4E2D;&#x4E0B;&#x8F7D;&#x8D44;&#x6E90;&#x5B58;&#x5230;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF09;</li>
<li>&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;</li>
</ul>
<pre><code>+ &#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF1A;Maven&#x9ED8;&#x8BA4;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93; [repo1.maven.org/maven2](http://repo1.maven.org/maven2)
+ &#x79C1;&#x670D;&#xFF1A;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF0C;&#x5B83;&#x662F;&#x67B6;&#x8BBE;&#x5728;&#x5C40;&#x57DF;&#x7F51;&#x5185;&#x7684;&#x4ED3;&#x5E93;


![image-20210924135412539](https://gitee.com/songjianzaina/juejin_p7/raw/master/img/e31bed022e683a06707bd58b402063bdfb22af9a51e25786b77d60316baeff2a)
+ &#x955C;&#x50CF;&#xFF1A;&#x7528;&#x6765;&#x66FF;&#x4EE3;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF0C;&#x901F;&#x5EA6;&#x4E00;&#x822C;&#x6BD4;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x5FEB;</code></pre><h2 id="4&#x3001;-&#x751F;&#x547D;&#x5468;&#x671F;"><a href="#4&#x3001;-&#x751F;&#x547D;&#x5468;&#x671F;" class="headerlink" title="4&#x3001; &#x751F;&#x547D;&#x5468;&#x671F;"></a>4&#x3001; &#x751F;&#x547D;&#x5468;&#x671F;</h2><p><strong>&#x4F55;&#x4E3A;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF1F;</strong></p>
<ul>
<li>Maven&#x751F;&#x547D;&#x5468;&#x671F;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x548C;&#x7EDF;&#x4E00;</li>
<li>&#x5305;&#x62EC;&#x9879;&#x76EE;&#x6E05;&#x7406;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7F16;&#x8BD1;&#xFF0C;&#x6253;&#x5305;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x90E8;&#x7F72;&#x7B49;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x6784;&#x5EFA;&#x6B65;&#x9AA4;</li>
</ul>
<p><strong>Maven&#x4E09;&#x5927;&#x751F;&#x547D;&#x5468;&#x671F;</strong></p>
<ul>
<li>clean&#xFF1A;&#x6E05;&#x7406;&#x9879;&#x76EE;&#x7684;</li>
<li>default&#xFF1A;&#x6784;&#x5EFA;&#x9879;&#x76EE;&#x7684;</li>
<li>site&#xFF1A;&#x751F;&#x6210;&#x9879;&#x76EE;&#x7AD9;&#x70B9;&#x7684;</li>
</ul>
<p><strong>&#x751F;&#x547D;&#x5468;&#x671F;Maven&#x6709;&#x4E09;&#x5957;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x662F;&#x201C;&#x4E09;&#x5957;&#x201D;&#xFF0C;&#x800C;&#x4E14;&#x201C;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x201D;&#xFF0C;&#x8FD9;&#x4E09;&#x5957;&#x751F;&#x547D;&#x5468;&#x671F;&#x5206;&#x522B;&#x662F;&#xFF1A;</strong></p>
<ul>
<li>Clean Lifecycle &#x5728;&#x8FDB;&#x884C;&#x771F;&#x6B63;&#x7684;&#x6784;&#x5EFA;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>Default Lifecycle &#x6784;&#x5EFA;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#xFF0C;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6253;&#x5305;&#xFF0C;&#x90E8;&#x7F72;&#x7B49;&#x7B49;&#x3002;</li>
<li>Site Lifecycle &#x751F;&#x6210;&#x9879;&#x76EE;&#x62A5;&#x544A;&#xFF0C;&#x7AD9;&#x70B9;&#xFF0C;&#x53D1;&#x5E03;&#x7AD9;&#x70B9;&#x3002;</li>
</ul>
<p>&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x518D;&#x6B21;&#x5F3A;&#x8C03;&#x4E00;&#x4E0B;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4EC5;&#x4EC5;&#x8C03;&#x7528;clean&#x6765;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#xFF0C;&#x4EC5;&#x4EC5;&#x8C03;&#x7528;site&#x6765;&#x751F;&#x6210;&#x7AD9;&#x70B9;&#x3002;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD0;&#x884C; mvn clean install site &#x8FD0;&#x884C;&#x6240;&#x6709;&#x8FD9;&#x4E09;&#x5957;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</li>
</ul>
<p><strong>Clean&#x751F;&#x547D;&#x5468;&#x671F;&#x5305;&#x542B;&#x4E86;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</strong></p>
<ul>
<li>pre-clean &#x6267;&#x884C;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x5728;clean&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;</li>
<li>clean &#x79FB;&#x9664;&#x6240;&#x6709;&#x4E0A;&#x4E00;&#x6B21;&#x6784;&#x5EFA;&#x751F;&#x6210;&#x7684;&#x6587;&#x4EF6;</li>
<li>post-clean &#x6267;&#x884C;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x5728;clean&#x4E4B;&#x540E;&#x7ACB;&#x523B;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;</li>
</ul>
<p>clean&#x751F;&#x547D;&#x5468;&#x671F;&#x6BCF;&#x5957;&#x751F;&#x547D;&#x5468;&#x671F;&#x90FD;&#x7531;&#x4E00;&#x7EC4;&#x9636;&#x6BB5;(Phase)&#x7EC4;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x5165;&#x7684;&#x547D;&#x4EE4;&#x603B;&#x4F1A;&#x5BF9;&#x5E94;&#x4E8E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x8FD0;&#x884C;mvn clean &#xFF0C;&#x8FD9;&#x4E2A;&#x7684;clean&#x662F;Clean&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;&#x6709;Clean&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4E5F;&#x6709;clean&#x9636;&#x6BB5;&#x3002;</p>
<p>mvn clean &#x4E2D;&#x7684;clean&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x7684;clean&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x67D0;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x9636;&#x6BB5;&#x90FD;&#x4F1A;&#x88AB;&#x8FD0;&#x884C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;mvn clean &#x7B49;&#x540C;&#x4E8E; mvn pre-clean clean &#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD0;&#x884C; mvn post-clean &#xFF0C;&#x90A3;&#x4E48; pre-clean&#xFF0C;clean &#x90FD;&#x4F1A;&#x88AB;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x662F;Maven&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7B80;&#x5316;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p><strong>Site&#x751F;&#x547D;&#x5468;&#x671F;</strong></p>
<p>Site&#x751F;&#x547D;&#x5468;&#x671F;pre-site &#x6267;&#x884C;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x5728;&#x751F;&#x6210;&#x7AD9;&#x70B9;&#x6587;&#x6863;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#xFF1B;site &#x751F;&#x6210;&#x9879;&#x76EE;&#x7684;&#x7AD9;&#x70B9;&#x6587;&#x6863; &#xFF1B;post-site &#x6267;&#x884C;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x5728;&#x751F;&#x6210;&#x7AD9;&#x70B9;&#x6587;&#x6863;&#x4E4B;&#x540E;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x90E8;&#x7F72;&#x505A;&#x51C6;&#x5907;&#xFF1B;site-deploy &#x5C06;&#x751F;&#x6210;&#x7684;&#x7AD9;&#x70B9;&#x6587;&#x6863;&#x90E8;&#x7F72;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF1B; &#x8FD9;&#x91CC;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x7684;&#x662F;site&#x9636;&#x6BB5;&#x548C;site-deploy&#x9636;&#x6BB5;&#xFF0C;&#x7528;&#x4EE5;&#x751F;&#x6210;&#x548C;&#x53D1;&#x5E03;Maven&#x7AD9;&#x70B9;&#xFF0C;&#x8FD9;&#x53EF;&#x662F;Maven&#x76F8;&#x5F53;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#xFF0C;Manager&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#xFF0C;&#x6587;&#x6863;&#x53CA;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x81EA;&#x52A8;&#x751F;&#x6210;&#xFF0C;&#x5F88;&#x597D;&#x770B;&#x3002;</p>
<p><strong>Default&#x751F;&#x547D;&#x5468;&#x671F;</strong></p>
<p>Default&#x751F;&#x547D;&#x5468;&#x671F;Default&#x751F;&#x547D;&#x5468;&#x671F;&#x662F;Maven&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x90FD;&#x53D1;&#x751F;&#x5728;&#x8FD9;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x53EA;&#x89E3;&#x91CA;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x548C;&#x5E38;&#x7528;&#x7684;&#x9636;&#x6BB5;&#xFF1A;</p>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/8089bac067d8005406497724b47a208a15d71ddaa3d4323b7df956201d1abfca" alt="img"></p>
<p>&#x8FD0;&#x884C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x524D;&#x9762;&#x7684;&#x6240;&#x6709;&#x9636;&#x6BB5;&#x90FD;&#x4F1A;&#x88AB;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x8FD0;&#x884C;mvn install &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE3;&#x7801;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6253;&#x5305;&#x3002;&#x6B64;&#x5916;&#xFF0C;Maven&#x7684;&#x63D2;&#x4EF6;&#x673A;&#x5236;&#x662F;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;Maven&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x7406;&#x89E3;&#x751F;&#x547D;&#x5468;&#x671F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<h2 id="5&#x3001;Maven&#x63D2;&#x4EF6;"><a href="#5&#x3001;Maven&#x63D2;&#x4EF6;" class="headerlink" title="5&#x3001;Maven&#x63D2;&#x4EF6;"></a>5&#x3001;Maven&#x63D2;&#x4EF6;</h2><ul>
<li>&#x63D2;&#x4EF6;&#x76EE;&#x6807;<br>Maven&#x7684;&#x6838;&#x5FC3;&#x4EC5;&#x4EC5;&#x5B9A;&#x4E49;&#x4E86;&#x62BD;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x4EA4;&#x7531;&#x63D2;&#x4EF6;&#x5B8C;&#x6210;</li>
<li>&#x6BCF;&#x4E2A;&#x63D2;&#x4EF6;&#x90FD;&#x80FD;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x6BCF;&#x4E2A;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x76EE;&#x6807;</li>
<li>Maven&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E0E;&#x63D2;&#x4EF6;&#x76EE;&#x6807;&#x76F8;&#x4E92;&#x7ED1;&#x5B9A;&#xFF0C;&#x4EE5;&#x5B8C;&#x6210;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x6784;&#x5EFA;&#x4EFB;&#x52A1;&#x4F8B;&#x5982;compile&#x5C31;&#x662F;&#x63D2;&#x4EF6;maven-compiler-plugin&#x7684;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x76EE;&#x6807;&#x3002;&#x4F8B;&#x5982;&#xFF1A;mvn compile&#x6216;&#x8005;&#x5168;&#x5199; mvn compiler :compile</li>
</ul>
<p><img src="https://gitee.com/songjianzaina/juejin_p7/raw/master/img/d2b5126125d44334fcdc790080db5a5f229baf30c877e7745dd98c8c08b71149" alt="image-20210924152722238"></p>
<h1 id="&#x540E;&#x8BED;"><a href="#&#x540E;&#x8BED;" class="headerlink" title="&#x540E;&#x8BED;"></a>&#x540E;&#x8BED;</h1><p>&#x5382;&#x957F;&#x5199;&#x535A;&#x5BA2;&#x76EE;&#x7684;&#x521D;&#x8877;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C11;&#x8D70;&#x5F2F;&#x8DEF;&#xFF0C;&#x591A;&#x5B66;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x7559;&#x4E0B;&#x4F60;&#x7684;&#x8D5E;&#x8D5E;&#x1F44D;&#x6216;&#x8005;&#x5173;&#x6CE8;&#x2795;&#x90FD;&#x662F;&#x5BF9;&#x6211;&#x6700;&#x5927;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F60;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x70B9;&#x8D5E;&#x7ED9;&#x5382;&#x957F;&#x6BCF;&#x5929;&#x66F4;&#x6587;&#x7684;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x5BF9;&#x6587;&#x7AE0;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x4E0D;&#x7406;&#x89E3;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8BC4;&#x8BBA;&#x533A;&#x56DE;&#x590D;&#x6211;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#xFF0C;&#x5171;&#x540C;&#x5B66;&#x4E60;&#xFF0C;&#x4E00;&#x8D77;&#x8FDB;&#x6B65;&#xFF01;</p>
<p><strong>&#x5FAE;&#x4FE1;(z613500)&#x6216;&#x8005; qq(1016942589) &#x8BE6;&#x7EC6;&#x4EA4;&#x6D41;&#x3002;</strong></p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/d5ab5bafe5769e01290136682d4122ea.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034718638359724062.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034718638359724062.html" itemprop="url">Go语言学习查缺补漏ing Day8</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T11:41:30+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x300C;&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x4E0E;11&#x6708;&#x66F4;&#x6587;&#x6311;&#x6218;&#x7684;&#x7B2C;26&#x5929;&#xFF0C;&#x6D3B;&#x52A8;&#x8BE6;&#x60C5;&#x67E5;&#x770B;&#xFF1A;<a href="https://dev.newban.cn/7023643374569816095/">2021&#x6700;&#x540E;&#x4E00;&#x6B21;&#x66F4;&#x6587;&#x6311;&#x6218;</a>&#x300D;&#x3002;</p>
<h3 id="Go&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x67E5;&#x7F3A;&#x8865;&#x6F0F;ing-Day8"><a href="#Go&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x67E5;&#x7F3A;&#x8865;&#x6F0F;ing-Day8" class="headerlink" title="Go&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x67E5;&#x7F3A;&#x8865;&#x6F0F;ing Day8"></a>Go&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x67E5;&#x7F3A;&#x8865;&#x6F0F;ing Day8</h3><p><strong>&#x672C;&#x6587;&#x6536;&#x5F55;&#x4E8E;&#x6211;&#x7684;&#x4E13;&#x680F;&#xFF1A;<a href="/external_links/64e9e960156a1426fbcbb92e6f6f2548.html" target="blank" rel="noopener">&#x300A;&#x8BA9;&#x6211;&#x4EEC;&#x4E00;&#x8D77;Golang&#x300B;</a></strong></p>
<h4 id="&#x4E00;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;map&#x7684;value&#x503C;&#x662F;&#x4E0D;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#xFF1F;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;map&#x7684;value&#x503C;&#x662F;&#x4E0D;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#xFF1F;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;map&#x7684;value&#x503C;&#x662F;&#x4E0D;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#xFF1F;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;map&#x7684;value&#x503C;&#x662F;&#x4E0D;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#xFF1F;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1F;</h4><p>&#x5148;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import &quot;fmt&quot;</span><br><span class="line">&#x200B;</span><br><span class="line">type Hello struct {</span><br><span class="line">    x, y int</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">var m = map[string]Hello{</span><br><span class="line">    &quot;hello&quot;: Hello{2, 3},</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    m[&quot;hello&quot;].x = 4</span><br><span class="line">    fmt.Println(m[&quot;hello&quot;].x)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F1A;&#x62A5;&#x9519;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;# command-line-arguments</span><br><span class="line">.\demo.go:14:15: cannot assign to struct field m[&quot;hello&quot;].x in map</span><br></pre></td></tr></table></figure>

<p>&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x6765;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>&#x56E0;&#x4E3A;map&#x662F;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x5BFB;&#x5740;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;m[&#x201C;hello&#x201D;].x&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x5BF9;&#x5176;&#x503C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;Go&#x7684;map&#x662F;&#x901A;&#x8FC7;&#x6563;&#x5217;&#x8868;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x8BF4;&#x5F97;&#x66F4;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x6570;&#x7EC4;&#x548C;&#x94FE;&#x8868;&#x7EC4;&#x5408;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x5E76;&#x4E14;Go&#x7684;map&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#xFF0C;&#x5F53;&#x8FDB;&#x884C;&#x6269;&#x5BB9;&#x4E4B;&#x540E;&#xFF0C;map&#x7684;value&#x90A3;&#x5757;&#x7A7A;&#x95F4;&#x5730;&#x5740;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x6CD5;&#x5BF9;map&#x7684;value&#x8FDB;&#x884C;&#x5BFB;&#x5740;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6CE8;&#x610F;&#xFF0C;map&#x4E0E;slice&#x5207;&#x7247;&#x7684;&#x6269;&#x5BB9;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;map&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x6269;&#x5BB9;&#x540E;&#xFF0C;value&#x5F15;&#x7528;&#x5730;&#x5740;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;map value&#x5143;&#x7D20;&#x4E0D;&#x53EF;&#x5BFB;&#x5740;&#x3002;&#x800C;slice&#x6269;&#x5BB9;&#x540E;&#x662F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5E95;&#x5C42;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x6709;&#x4EC0;&#x4E48;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x4E00;&#xFF1A;&#x4F7F;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import &quot;fmt&quot;</span><br><span class="line">&#x200B;</span><br><span class="line">type Hello struct {</span><br><span class="line">    x, y int</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">var m = map[string]Hello{</span><br><span class="line">    &quot;hello&quot;: Hello{2, 3},</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    tmp := m[&quot;hello&quot;]</span><br><span class="line">    tmp.x = 4</span><br><span class="line">    m[&quot;hello&quot;] = tmp</span><br><span class="line">    fmt.Println(m[&quot;hello&quot;].x)</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br></pre></td></tr></table></figure>

<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;&#x6307;&#x9488;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import &quot;fmt&quot;</span><br><span class="line">&#x200B;</span><br><span class="line">type Hello struct {</span><br><span class="line">    x, y int</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">var m = map[string]*Hello{</span><br><span class="line">    &quot;hello&quot;: &amp;Hello{2, 3},</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    m[&quot;hello&quot;].x = 4</span><br><span class="line">    fmt.Println(m[&quot;hello&quot;].x)</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<h4 id="&#x4E8C;&#x3001;&#x904D;&#x5386;&#x5207;&#x7247;&#x7684;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x4F1A;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;"><a href="#&#x4E8C;&#x3001;&#x904D;&#x5386;&#x5207;&#x7247;&#x7684;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x4F1A;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;" class="headerlink" title="&#x4E8C;&#x3001;&#x904D;&#x5386;&#x5207;&#x7247;&#x7684;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x4F1A;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;"></a>&#x4E8C;&#x3001;&#x904D;&#x5386;&#x5207;&#x7247;&#x7684;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x4F1A;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;</h4><p>&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x5FAA;&#x73AF;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    values := []int{1, 2, 3}</span><br><span class="line">    for value := range values {</span><br><span class="line">        values = append(values, value)</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

<p>&#x7B54;&#x6848;&#x662F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x5728;for&#x2026;range &#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x5FAA;&#x73AF;&#x4E4B;&#x5185;&#x6539;&#x53D8;&#x5207;&#x7247;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x3002;</p>
<h4 id="&#x4E09;&#x3001;-for&#x2026;range&#x590D;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;"><a href="#&#x4E09;&#x3001;-for&#x2026;range&#x590D;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;" class="headerlink" title="&#x4E09;&#x3001; for&#x2026;range&#x590D;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;"></a>&#x4E09;&#x3001; for&#x2026;range&#x590D;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;</h4><p>&#x770B;&#x4E00;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x8BA4;&#x4E3A;&#x4F1A;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#xFF1F;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import (</span><br><span class="line">    &quot;fmt&quot;</span><br><span class="line">    &quot;time&quot;</span><br><span class="line">)</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    var s = [...]int{1, 2, 3}</span><br><span class="line">    for index, value := range s {</span><br><span class="line">        go func() {</span><br><span class="line">            fmt.Println(index, value)</span><br><span class="line">        }()</span><br><span class="line">    }</span><br><span class="line">    time.Sleep(time.Second * 3)</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br></pre></td></tr></table></figure>

<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/cf7d894ad78a9674d12006535ddb7fb5be3b0fade940c9531796828c0569b2d3" alt="image-20211126112113115"></p>
<p>&#x54C8;&#x54C8;&#xFF0C;&#x6709;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4F1A;&#x4E0D;&#x4F1A;&#x5F88;&#x5947;&#x602A;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x8F93;&#x51FA;&#x4E00;&#x6837;&#x7684;&#x503C;&#xFF1F;</p>
<p>&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;:=&#x7684;&#x5F62;&#x5F0F;&#x8FED;&#x4EE3;&#x53D8;&#x91CF;&#xFF0C;index&#x548C;value&#x90FD;&#x4F1A;&#x5728;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x88AB;&#x91CD;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x58F0;&#x660E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5404;&#x4E2A;&#x534F;&#x7A0B;&#x90FD;&#x662F;&#x8F93;&#x51FA;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x540E;&#x7684;index&#x4EE5;&#x53CA;value&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x534F;&#x7A0B;&#x5F00;&#x59CB;&#x65F6;&#x7684;index&#x4EE5;&#x53CA;value&#x503C;&#x3002;</p>
<p>&#x90A3;&#x6709;&#x4EC0;&#x4E48;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x4E4B;&#x4E00;&#xFF1A;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4F20;&#x9012;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import (</span><br><span class="line">    &quot;fmt&quot;</span><br><span class="line">    &quot;time&quot;</span><br><span class="line">)</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    var s = [...]int{1, 2, 3}</span><br><span class="line">    for index, value := range s {</span><br><span class="line">        go func(index,value int) {</span><br><span class="line">            fmt.Println(index, value)</span><br><span class="line">        }(index,value)</span><br><span class="line">    }</span><br><span class="line">    time.Sleep(time.Second * 3)</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br></pre></td></tr></table></figure>

<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/9696a3d9e3f7438bd85a7e9965b276bb4b600f165b671cf6f639123880f837c8" alt="image-20211126113014044"></p>
<p>&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x4E86;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x4F20;&#x9012;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">go&#x590D;&#x5236;&#x4EE3;&#x7801;package main</span><br><span class="line">&#x200B;</span><br><span class="line">import (</span><br><span class="line">    &quot;fmt&quot;</span><br><span class="line">    &quot;time&quot;</span><br><span class="line">)</span><br><span class="line">&#x200B;</span><br><span class="line">func main() {</span><br><span class="line">    var s = [...]int{1, 2, 3}</span><br><span class="line">    for index, value := range s {</span><br><span class="line">        i := index</span><br><span class="line">        v := value</span><br><span class="line">        go func() {</span><br><span class="line">            fmt.Println(i, v)</span><br><span class="line">        }()</span><br><span class="line">    }</span><br><span class="line">    time.Sleep(time.Second * 3)</span><br><span class="line">}</span><br><span class="line">&#x200B;</span><br></pre></td></tr></table></figure>

<p><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/56a20dd7172cd82c8d92655cc8f51b977585363fdcf695ac0cfcfe5ae2b1976d" alt="image-20211126113203098"></p>
<p>&#x8FD9;&#x6837;&#x4E5F;&#x80FD;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/d43ef14dc15d30a2edd6b2a19a5f97fc.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://dev.newban.cn../../7034717398494101535.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="开发者博客">
      <meta itemprop="description" content>
      <meta itemprop="image" content="../../images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="开发者博客 – IT技术 尽在开发者博客">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="../../7034717398494101535.html" itemprop="url">【BUG日记】【MySQL】多个排序字段，是有优先级的，先来</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-11-26T11:36:45+08:00">
                2021-11-26
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p><strong>&#x3010;&#x65E5;&#x671F;&#x3011;</strong>&#xFF1A;2021/11/26</p>
<p><strong>&#x3010;&#x95EE;&#x9898;&#x3011;</strong>&#xFF1A;&#x5728;&#x7528;JPA&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x5E76;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x6392;&#x5E8F;&#x65F6;&#x5019;&#xFF0C;&#x67E5;&#x8BE2;&#x7684;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#x672A;&#x8FBE;&#x5230;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;</p>
<p><strong>&#x3010;&#x539F;&#x56E0;&#x3011;</strong>&#xFF1A;&#x62FC;&#x63A5;&#x7684;MySQL&#x8BED;&#x53E5;&#x6392;&#x5E8F;&#x5B57;&#x6BB5;&#x987A;&#x5E8F;&#x4E0D;&#x5BF9;</p>
<p><strong>&#x3010;&#x5982;&#x4F55;&#x53D1;&#x73B0;&#x3011;</strong> &#xFF1A;&#x4EE5;&#x4E3A;&#x662F;jpa&#x7684;&#x64CD;&#x4F5C;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x5199;MySQL&#x8BED;&#x53E5;&#x5728;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x53D1;&#x73B0;&#x662F;MySQL&#x8BED;&#x53E5;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6392;&#x5E8F;&#x5B57;&#x6BB5;&#x7684;&#x4F4D;&#x7F6E;&#x6362;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5C1D;&#x8BD5;&#x8FD0;&#x884C;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x53D1;&#x73B0;&#x8FBE;&#x5230;&#x6211;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;&#x4E86;&#x3002;</p>
<p><strong>&#x3010;&#x5982;&#x4F55;&#x4FEE;&#x590D;&#x3011;</strong> &#xFF1A;&#x591A;&#x4E2A;&#x6392;&#x5E8F;&#x5B57;&#x6BB5;&#x60F3;&#x8981;&#x8FBE;&#x5230;&#x60F3;&#x8981;&#x7684;&#x67E5;&#x8BE2;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#xFF0C;&#x662F;&#x6839;&#x636E;&#x6392;&#x5E8F;&#x5B57;&#x6BB5;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x7684;&#x3002;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x5148;&#x8D8A;&#x6392;&#x524D;&#x8D8A;&#x9AD8;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ol>
<li>&#x67E5;&#x8BE2;&#x5F53;&#x524D;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x9605;&#x8BFB;&#x91CF;&#x6700;&#x591A;&#x3001;&#x8BC4;&#x8BBA;&#x6700;&#x591A;&#x3001;&#x662F;&#x65B0;&#x6587;&#x7AE0;&#x3002;&#xFF08;ps&#xFF1A;&#x6CE8;&#x610F;&#x987A;&#x5E8F;&#xFF09;</li>
</ol>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">mysql&#x590D;&#x5236;&#x4EE3;&#x7801;select * from t_ey_essay where is_hide=0 and is_del = 0 order by read_sum desc, comment_sum desc, id desc</span><br></pre></td></tr></table></figure>

<p>&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#xFF1A;<br><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/d4728b8efdd7ee830130937ec42d550c33f8b41db401714ab4c872075ca5f71b" alt="image.png"><br>2. &#x67E5;&#x8BE2;&#x5F53;&#x524D;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x9605;&#x8BFB;&#x91CF;&#x6700;&#x591A;&#x3001;&#x662F;&#x65B0;&#x6587;&#x7AE0;&#x3001;&#x8BC4;&#x8BBA;&#x6700;&#x591A;&#x3002;&#xFF08;ps&#xFF1A;&#x6CE8;&#x610F;&#x987A;&#x5E8F;&#xFF09;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">mysql&#x590D;&#x5236;&#x4EE3;&#x7801;select * from t_ey_essay where is_hide=0 and is_del = 0 order by read_sum desc, id desc, comment_sum desc</span><br></pre></td></tr></table></figure>

<p>&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#xFF1A;<br><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/56664619dd1536970b88ead92e06b7439b057642fcd47998cfb84293667c9908" alt="image.png"><br>3. &#x67E5;&#x8BE2;&#x5F53;&#x524D;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x662F;&#x65B0;&#x6587;&#x7AE0;&#x3001;&#x9605;&#x8BFB;&#x91CF;&#x6700;&#x591A;&#x3001;&#x8BC4;&#x8BBA;&#x6700;&#x591A;&#x3002;&#xFF08;ps&#xFF1A;&#x6CE8;&#x610F;&#x987A;&#x5E8F;&#xFF09;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">mysql&#x590D;&#x5236;&#x4EE3;&#x7801;select * from t_ey_essay where is_hide=0 and is_del = 0 order by id desc, read_sum desc, comment_sum desc</span><br></pre></td></tr></table></figure>

<p>&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#xFF1A;<br><img src="https://gitee.com/songjianzaina/juejin_p6/raw/master/img/486e91aed2fbeb4e5cfea0ee325324eadf5d75b40a1fc068e3faef00cc5e6581" alt="image.png"></p>
<p><strong>&#x3010;&#x603B;&#x7ED3;&#x3011;</strong> &#xFF1A;&#x6392;&#x5E8F;&#x4E5F;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5148;&#x6765;&#x5148;&#x4F18;&#x5148;&#x6392;&#x5E8F;&#xFF01;</p>
<h2 id="&#x3010;&#x6700;&#x540E;&#x3011;"><a href="#&#x3010;&#x6700;&#x540E;&#x3011;" class="headerlink" title="&#x3010;&#x6700;&#x540E;&#x3011;"></a>&#x3010;&#x6700;&#x540E;&#x3011;</h2><blockquote>
<p>&#x611F;&#x8C22;&#x4F60;&#x770B;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6301;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6B22;&#x8FCE;&#x4F60;&#x5728;&#x6587;&#x7AE0;&#x4E0B;&#x65B9;&#x8FDB;&#x884C;&#x7559;&#x8A00;&#x3001;&#x8BC4;&#x8BBA;&#x3002;</p>
<p>&#x6211;&#x662F;&#x5357;&#x65B9;&#x8005;&#xFF0C;&#x4E00;&#x4E2A;&#x70ED;&#x7231;&#x8BA1;&#x7B97;&#x673A;&#x66F4;&#x70ED;&#x7231;&#x7956;&#x56FD;&#x7684;&#x5357;&#x65B9;&#x4EBA;&#x3002;</p>
<p>&#x3000;&#x3000;<strong>&#x6587;&#x7AE0;&#x5185;&#x5BB9;&#x4EC5;&#x4F9B;&#x5B66;&#x4E60;&#x53C2;&#x8003;&#xFF0C;&#x5982;&#x6709;&#x4FB5;&#x6743;&#xFF0C;&#x975E;&#x5E38;&#x62B1;&#x6B49;&#xFF0C;&#x8BF7;&#x7ACB;&#x5373;&#x8054;&#x7CFB;&#x4F5C;&#x8005;&#x5220;&#x9664;&#x3002;</strong></p>
</blockquote>
<p><strong>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;:</strong> <a href="/external_links/02286b701bb1132aee9d0a4177ec8181.html" target="blank" rel="noopener">&#x6398;&#x91D1;</a></p>
<p><em><a href="https://dev.newban.cn/">&#x5F00;&#x53D1;&#x8005;&#x535A;&#x5BA2; &#x2013; &#x548C;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x7684; &#x8FD9;&#x91CC;&#x5168;&#x90FD;&#x6709;</a></em></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
  </section>

  
  <nav class="pagination">
    <a class="extend prev" rel="prev" href="../182/"><i class="fa fa-angle-left"></i></a><a class="page-number" href="../../">1</a><span class="space">&hellip;</span><a class="page-number" href="../182/">182</a><span class="page-number current">183</span><a class="page-number" href="../184/">184</a><span class="space">&hellip;</span><a class="page-number" href="../399/">399</a><a class="extend next" rel="next" href="../184/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">开发者博客</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="https://dev.newban.cn/archives/">
              
                  <span class="site-state-item-count">3990</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">1304</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="../../atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2024</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">开发者博客</span>
  <div>
  <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
  <span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
  </div>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




  <script type="text/javascript" async src="js/src/mermaid.min.js"></script>
  <script>
  if (window.mermaid) {
        var mermaid_config = {
            startOnLoad: true,
            theme: 'default',
            flowchart:{
                useMaxWidth: false,
                htmlLabels: true
            }                
        }
        mermaid.initialize(mermaid_config);
  }
  </script>
  

        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="../../lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="../../lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="../../lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="../../lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="../../lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="../../lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="../../js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="../../js/src/motion.js?v=5.1.4"></script>



  
  

  

  


  <script type="text/javascript" src="../../js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  

  

</body>
</html>
